{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、イブ、アダ、ダン、ロブ、エイミー、ジョー――がいました。ダンは3位でフィニッシュしました。アナはアダよりも上位でフィニッシュしました。エイミーは最下位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはアダよりも下位でフィニッシュしました。ロブはジョーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが3位でフィニッシュした\n(B) イブが3位でフィニッシュした\n(C) アダが3位でフィニッシュした\n(D) ダンが3位でフィニッシュした\n(E) ロブが3位でフィニッシュした\n(F) エイミーが3位でフィニッシュした\n(G) ジョーが3位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：バス、オートバイ、ハッチバック、ステーションワゴン、ミニバン、トラック、リムジンです。ステーションワゴンは最も新しい車両から4番目です。オートバイはトラックよりも新しい車両です。ステーションワゴンはハッチバックよりも古い車両です。ミニバンはハッチバックよりも新しい車両です。バスはミニバンよりも新しい車両です。トラックはリムジンよりも新しい車両です。\n選択肢:\n(A) バスが最も古い車両から3番目である\n(B) オートバイが最も古い車両から3番目である\n(C) ハッチバックが最も古い車両から3番目である\n(D) ステーションワゴンが最も古い車両から3番目である\n(E) ミニバンが最も古い車両から3番目である\n(F) トラックが最も古い車両から3番目である\n(G) リムジンが最も古い車両から3番目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ハチドリ、ショウジョウコウカンチョウ、アオカケス、フクロウ、ワタリガラス、ウズラ、シジュウカラです。ハチドリはウズラの左側にあります。シジュウカラはショウジョウコウカンチョウの左側にあります。アオカケスが最も左側の位置にあります。ショウジョウコウカンチョウは左から4番目の位置にあります。ワタリガラスは右から3番目の位置にあります。フクロウは左から3番目の位置にあります。\n選択肢:\n(A) ハチドリは右から2番目の位置にある\n(B) ショウジョウコウカンチョウは右から2番目の位置にある\n(C) アオカケスは右から2番目の位置にある\n(D) フクロウは右から2番目の位置にある\n(E) ワタリガラスは右から2番目の位置にある\n(F) ウズラは右から2番目の位置にある\n(G) シジュウカラは右から2番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コマドリ、フクロウ、ウズラ、ハヤブサ、ハチドリ、ショウジョウコウカンチョウ、カラスです。ハチドリはハヤブサの左側にあります。カラスはショウジョウコウカンチョウの右側にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。ウズラは右側から3番目の位置にあります。ハヤブサはコマドリの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) コマドリは左側から4番目の位置にある\n(B) フクロウは左側から4番目の位置にある\n(C) ウズラは左側から4番目の位置にある\n(D) ハヤブサは左側から4番目の位置にある\n(E) ハチドリは左側から4番目の位置にある\n(F) ショウジョウコウカンチョウは左側から4番目の位置にある\n(G) カラスは左側から4番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、プラム、マンゴー、スイカ、梨、桃、オレンジ――を販売しています。梨は最も安価な3番目の果物です。キウイは最も高価な2番目の果物です。梨はプラムよりも高価です。オレンジはキウイよりも安価です。マンゴーは最も高価な3番目の果物です。桃は最も安価な2番目の果物です。\n選択肢:\n(A) キウイは最も安価な2番目の果物である\n(B) プラムは最も安価な2番目の果物である\n(C) マンゴーは最も安価な2番目の果物である\n(D) スイカは最も安価な2番目の果物である\n(E) 梨は最も安価な2番目の果物である\n(F) 桃は最も安価な2番目の果物である\n(G) オレンジは最も安価な2番目の果物である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、イブ、メル、ジョー、ミャ、ロブ、アダ――がいました。アダはミャよりも上位でフィニッシュしました。エリはジョーよりも下位でフィニッシュしました。エリはイブよりも上位でフィニッシュしました。アダは最下位から2番目でフィニッシュしました。メルは3位でフィニッシュしました。ロブは4位でフィニッシュしました。\n選択肢:\n(A) エリが準々々々々々々決勝で敗退した\n(B) イブが準々々々々々々決勝で敗退した\n(C) メルが準々々々々々々決勝で敗退した\n(D) ジョーが準々々々々々々決勝で敗退した\n(E) ミャが準々々々々々々決勝で敗退した\n(F) ロブが準々々々々々々決勝で敗退した\n(G) アダが準々々々々々々決勝で敗退した", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エイミー、イブ、エイダ、ロブ、ダン、メル、ジョー――がいました。ジョーは3位でフィニッシュしました。ダンが最下位でフィニッシュしました。イブが1位でフィニッシュしました。メルはロブよりも下位でフィニッシュしました。エイダはジョーよりも上位でフィニッシュしました。ロブは3位下からフィニッシュしました。\n選択肢:\n(A) エイミーが最下位でフィニッシュした\n(B) イブが最下位でフィニッシュした\n(C) エイダが最下位でフィニッシュした\n(D) ロブが最下位でフィニッシュした\n(E) ダンが最下位でフィニッシュした\n(F) メルが最下位でフィニッシュした\n(G) ジョーが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋台では7種類の果物――オレンジ、ビワ、リンゴ、キウイ、マンゴー、スモモ、桃――を販売しています。リンゴは最も安価な2番目の価格です。桃は最も安価な果物です。スモモは最も高価な4番目の価格です。ビワは最も安価な3番目の価格です。キウイはマンゴーよりも高価です。オレンジはマンゴーよりも安価です。\n選択肢:\n(A) オレンジは最も安価な3番目の価格である\n(B) ビワは最も安価な3番目の価格である\n(C) リンゴは最も安価な3番目の価格である\n(D) キウイは最も安価な3番目の価格である\n(E) マンゴーは最も安価な3番目の価格である\n(F) スモモは最も安価な3番目の価格である\n(G) 桃は最も安価な3番目の価格である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、トラック、ミニバン、トラクター、ハッチバック、バス、オープンカーです。オープンカーは2番目に古い車両です。トラクターは4番目に新しい車両です。ミニバンはトラックよりも古い車両です。トラックはリムジンよりも古い車両です。ハッチバックは3番目に古い車両です。バスはリムジンよりも新しい車両です。\n選択肢:\n(A) リムジンが最も古い車両である\n(B) トラックが最も古い車両である\n(C) ミニバンが最も古い車両である\n(D) トラクターが最も古い車両である\n(E) ハッチバックが最も古い車両である\n(F) バスが最も古い車両である\n(G) オープンカーが最も古い車両である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、黄色の本、黒い本、白い本、緑色の本、オレンジ色の本、紫色の本です。紫色の本が最も右側にあります。黄色の本が最も左側にあります。オレンジ色の本は右側から2冊目です。茶色の本は緑色の本の左側にあります。茶色の本は黒い本の右側にあります。白い本は左から4冊目です。\n選択肢:\n(A) 茶色の本が最も左側にある\n(B) 黄色の本が最も左側にある\n(C) 黒い本が最も左側にある\n(D) 白い本が最も左側にある\n(E) 緑色の本が最も左側にある\n(F) オレンジ色の本が最も左側にある\n(G) 紫色の本が最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では7種類の果物――マンゴー、スイカ、桃、キウイ、オレンジ、カンタロープメロン、プラム――を販売しています。スイカが最も安価です。桃はマンゴーよりも高価です。カンタロープメロンは2番目に高価な果物です。オレンジはカンタロープメロンよりも高価です。桃はプラムよりも安価です。キウイは3番目に安価な果物です。\n選択肢:\n(A) マンゴーは3番目に高価な果物である\n(B) スイカは3番目に高価な果物である\n(C) 桃は3番目に高価な果物である\n(D) キウイは3番目に安価な果物である\n(E) オレンジは3番目に高価な果物である\n(F) カンタロープメロンは3番目に高価な果物である\n(G) プラムは3番目に高価な果物である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、白い本、黒い本、黄色い本、オレンジ色の本、青い本、緑色の本です。黄色い本が最も右側にあります。青い本はオレンジ色の本の左側にあります。緑色の本は白い本の右側にあります。青い本は緑色の本の右側にあります。黒い本は左から4冊目です。茶色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本は左から4冊目である\n(B) 白い本は左から4冊目である\n(C) 黒い本は左から4冊目である\n(D) 黄色い本は左から4冊目である\n(E) オレンジ色の本は左から4冊目である\n(F) 青い本は左から4冊目である\n(G) 緑色の本は左から4冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、アナ、メル、アダ、イブ、エイミー――がいました。イブはエイミーよりも上位でフィニッシュしました。ダンは2位でフィニッシュしました。アダはアナよりも下位でフィニッシュしました。アナは3位と最下位の間の順位でフィニッシュしました。メルが最下位でフィニッシュしました。エイミーは3位でフィニッシュしました。\n選択肢:\n(A) ジョーが最下位でフィニッシュした\n(B) ダンが最下位でフィニッシュした\n(C) アナが最下位でフィニッシュした\n(D) メルが最下位でフィニッシュした\n(E) アダが最下位でフィニッシュした\n(F) イブが最下位でフィニッシュした\n(G) エイミーが最下位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：カラス、ハチドリ、コマドリ、クロウタドリ、ウズラ、アオカケス、ショウジョウコウカンチョウです。ハチドリはカラスの左側に位置しています。ウズラはカラスの右側に位置しています。カラスはコマドリの左側に位置しています。アオカケスは右側から3番目の位置にあります。ショウジョウコウカンチョウは最も左側にあります。ハチドリは左から4番目の位置にあります。\n選択肢:\n(A) カラスは右側から3番目の位置にある\n(B) ハチドリは右側から3番目の位置にある\n(C) コマドリは右側から3番目の位置にある\n(D) カラスは右側から3番目の位置にある\n(E) ウズラは右側から3番目の位置にある\n(F) アオカケスは右側から3番目の位置にある\n(G) ショウジョウコウカンチョウは右側から3番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：からす、コウヨウチョウ、ハヤブサ、フクロウ、アオカケス、ウズラ、コマドリです。フクロウは右側から2番目の位置にあります。コウヨウチョウは左側から4番目の位置にあります。ハヤブサはアオカケスの左側にあります。ウズラはハヤブサの左側にあります。からすは左側から2番目の位置にあります。コマドリはウズラの左側にあります。\n選択肢:\n(A) からすは左側から2番目の位置にある\n(B) コウヨウチョウは左側から2番目の位置にある\n(C) ハヤブサは左側から2番目の位置にある\n(D) フクロウは左側から2番目の位置にある\n(E) アオカケスは左側から2番目の位置にある\n(F) ウズラは左側から2番目の位置にある\n(G) コマドリは左側から2番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黒い本、黄色い本、白い本、灰色の本、紫色の本、オレンジ色の本、緑色の本です。緑色の本は灰色の本の左側にあります。灰色の本は右から3冊目です。白い本は最も右側にあります。オレンジ色の本は左から2冊目です。黒い本は黄色い本の右側にあります。黒い本は左から3冊目です。\n選択肢:\n(A) 黒い本は右から2冊目である\n(B) 黄色い本は右から2冊目である\n(C) 白い本は右から2冊目である\n(D) 灰色の本は右から2冊目である\n(E) 紫色の本は右から2冊目である\n(F) オレンジ色の本は右から2冊目である\n(G) 緑色の本は右から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――プラム、キウイ、カンタロープメロン、梨、スイカ、リンゴ、ビワ――を販売しています。スイカはカンタロープメロンよりも高価です。リンゴはカンタロープメロンよりも安価です。スイカは価格が2番目に高い果物です。ビワはキウイよりも安価です。リンゴはビワよりも高価です。ビワは価格が3番目に安い果物です。プラムは最も安価な果物です。\n選択肢:\n(A) プラムが最も高価である\n(B) キウイが最も高価である\n(C) カンタロープメロンが最も高価である\n(D) 梨が最も高価である\n(E) スイカが最も高価である\n(F) リンゴが最も高価である\n(G) ビワが最も高価である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：緑色の本、茶色の本、白色の本、黒色の本、オレンジ色の本、紫色の本、黄色の本です。紫色の本は黄色の本の左側にあります。緑色の本は白色の本の左側にあります。茶色の本は黄色の本の右側にあります。白色の本は左から4冊目です。緑色の本はオレンジ色の本の右側にあります。黒色の本は左から2冊目です。\n選択肢:\n(A) 緑色の本が最も左側にある\n(B) 茶色の本が最も左側にある\n(C) 白色の本が最も左側にある\n(D) 黒色の本が最も左側にある\n(E) オレンジ色の本が最も左側にある\n(F) 紫色の本が最も左側にある\n(G) 黄色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：トラック、ハッチバック、ミニバン、バス、トラクター、ステーションワゴン、オープンカーです。ステーションワゴンは最も新しいモデルから4番目です。ミニバンは最も新しいモデルから3番目です。トラクターは最も古いモデルから2番目です。オープンカーはステーションワゴンよりも古いモデルです。トラックはバスよりも新しいモデルです。ハッチバックはオープンカーよりも古いモデルです。\n選択肢:\n(A) トラックは最も古いモデルから3番目である\n(B) ハッチバックは最も古いモデルから3番目である\n(C) ミニバンは最も古いモデルから3番目である\n(D) バスは最も古いモデルから3番目である\n(E) トラクターは最も古いモデルから3番目である\n(F) ステーションワゴンは最も古いモデルから3番目である\n(G) オープンカーは最も古いモデルから3番目である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黒い本、黄色い本、白い本、灰色の本、紫色の本、オレンジ色の本、緑色の本です。緑色の本は灰色の本の左側にあります。灰色の本は右側から3冊目です。白い本は最も右側にあります。オレンジ色の本は左から2冊目です。黒い本は黄色い本の右側にあります。黒い本は左側から3冊目です。\n選択肢:\n(A) 黒い本は左側から3冊目である\n(B) 黄色い本は左側から3冊目である\n(C) 白い本は左側から3冊目である\n(D) 灰色の本は左側から3冊目である\n(E) 紫色の本は左側から3冊目である\n(F) オレンジ色の本は左側から3冊目である\n(G) 緑色の本は左側から3冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：カラス、ショウジョウコウカンチョウ、ハヤブサ、フクロウ、アオカケス、ウズラ、コマドリです。フクロウは右側から2番目の位置にあります。ショウジョウコウカンチョウは左側から4番目の位置にあります。ハヤブサはアオカケスの左側にあります。ウズラはハヤブサの左側にあります。カラスは左側から2番目の位置にあります。コマドリはウズラの左側にあります。\n選択肢:\n(A) カラスは右側から2番目の位置にある\n(B) ショウジョウコウカンチョウは右側から2番目の位置にある\n(C) ハヤブサは右側から2番目の位置にある\n(D) フクロウは右側から2番目の位置にある\n(E) アオカケスは右側から2番目の位置にある\n(F) ウズラは右側から2番目の位置にある\n(G) コマドリは右側から2番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：オナガフクロウ、ハチドリ、ウズラ、フクロウ、カラス、コマドリ、カージナルです。カージナルは右側から2番目の位置にあります。オナガフクロウは最も右側に位置しています。フクロウはハチドリの左側にいます。コマドリはウズラの左側に位置しています。フクロウはカラスの右側にあります。コマドリは左から4番目の位置にあります。\n選択肢:\n(A) オナガフクロウは右側から3番目の位置にある\n(B) ハチドリは右側から3番目の位置にある\n(C) ウズラは右側から3番目の位置にある\n(D) フクロウは右側から3番目の位置にある\n(E) カラスは右側から3番目の位置にある\n(F) コマドリは右側から3番目の位置にある\n(G) カージナルは右側から3番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、ハヤブサ、ショウジョウコウカンチョウ、ハチドリ、ウズラ、タカです。ハヤブサはカラスの左側に位置しています。ウズラはショウジョウコウカンチョウの右側に位置しています。ハチドリはウズラの右側に位置しています。ハヤブサは右側から2番目の位置にあります。ハチドリはタカの左側に位置しています。フクロウは左側から3番目の位置にあります。\n選択肢:\n(A) フクロウは左側から3番目の位置にある\n(B) カラスは左側から3番目の位置にある\n(C) ハヤブサは左側から3番目の位置にある\n(D) ショウジョウコウカンチョウは左側から3番目の位置にある\n(E) ハチドリは左側から3番目の位置にある\n(F) ウズラは左側から3番目の位置にある\n(G) タカは左側から3番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：スイカ、マンゴー、キウイ、梨、カンタロープメロン、オレンジ、桃です。オレンジは桃よりも高価です。カンタロープメロンは価格が4番目に高い果物です。梨はカンタロープメロンよりも安価です。桃は価格が2番目に高い果物です。マンゴーは最も安価な果物です。キウイは価格が3番目に安い果物です。\n選択肢:\n(A) スイカは価格が4番目に高い\n(B) マンゴーは価格が4番目に高い\n(C) キウイは価格が4番目に高い\n(D) 梨は価格が4番目に高い\n(E) カンタロープメロンは価格が4番目に高い\n(F) オレンジは価格が4番目に高い\n(G) 桃は価格が4番目に高い", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ショウジョウコウカンチョウ、アオカケス、コマドリ、ハヤブサ、ウズラ、ハチドリ、ワタリガラスです。ハヤブサはウズラの右側に位置しています。コマドリはハチドリの右側に位置しています。ワタリガラスはウズラの左側に位置しています。アオカケスは左から2番目です。コマドリは左から3番目です。ショウジョウコウカンチョウは右から3番目です。\n選択肢:\n(A) ショウジョウコウカンチョウが最も右側に位置する\n(B) アオカケスが最も右側に位置する\n(C) コマドリが最も右側に位置する\n(D) ハヤブサが最も右側に位置する\n(E) ウズラが最も右側に位置する\n(F) ハチドリが最も右側に位置する\n(G) ワタリガラスが最も右側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、ハヤブサ、タカ、ワタリガラス、カラス、ハチドリです。ハヤブサは左から2番目の位置にあります。カラスは最も右側に位置しています。ハチドリはアオカケスの右側にあります。タカはハチドリの右側に位置しています。アオカケスはフクロウの右側にあります。ワタリガラスはハヤブサの左側に位置しています。\n選択肢:\n(A) アオカケスは左から4番目の位置にある\n(B) フクロウは左から4番目の位置にある\n(C) ハヤブサは左から4番目の位置にある\n(D) タカは左から4番目の位置にある\n(E) ワタリガラスは左から4番目の位置にある\n(F) カラスは左から4番目の位置にある\n(G) ハチドリは左から4番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：セダン、ミニバン、オートバイ、リムジン、ハッチバック、トラック、トラクターです。オートバイはトラクターよりも古い車両です。ハッチバックはリムジンよりも古い車両です。ハッチバックはトラックよりも新しい車両です。トラックはトラクターよりも新しい車両です。ミニバンは最も新しい車両の2番目です。セダンは最も新しい車両の3番目です。\n選択肢:\n(A) セダンは最も古い車両の3番目である\n(B) ミニバンは最も古い車両の3番目である\n(C) オートバイは最も古い車両の3番目である\n(D) リムジンは最も古い車両の3番目である\n(E) ハッチバックは最も古い車両の3番目である\n(F) トラックは最も古い車両の3番目である\n(G) トラクターは最も古い車両の3番目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ロブ、ダン、メル、アナ、エリ、アダ――がいました。アダはロブよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。アダはダンよりも下位でフィニッシュしました。アナは3位でフィニッシュしました。エリは2位でフィニッシュしました。\n選択肢:\n(A) イブが4位でフィニッシュした\n(B) ロブが4位でフィニッシュした\n(C) ダンが4位でフィニッシュした\n(D) メルが4位でフィニッシュした\n(E) アナが4位でフィニッシュした\n(F) エリが4位でフィニッシュした\n(G) アダが4位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：リムジン、オープンカー、ステーションワゴン、ミニバン、バス、トラクター、トラックです。この中でミニバンが最も古い車両です。トラックはステーションワゴンよりも古く、リムジンよりも新しい車両です。バスはオープンカーよりも新しく、トラクターよりも古い車両です。リムジンはトラクターよりも新しい車両です。\n選択肢:\n(A) リムジンは2番目に古い車両である\n(B) オープンカーは2番目に古い車両である\n(C) ステーションワゴンは2番目に古い車両である\n(D) ミニバンは2番目に古い車両である\n(E) バスは2番目に古い車両である\n(F) トラクターは2番目に古い車両である\n(G) トラックは2番目に古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：青色の本、黄色の本、茶色の本、灰色の本、緑色の本、紫色の本、オレンジ色の本です。青色の本は茶色の本の右側にあります。灰色の本は最も右側に位置しています。紫色の本は緑色の本の左側に位置しています。緑色の本は黄色の本の左側に位置しています。茶色の本は左から2番目にあります。紫色の本は青色の本の右側に位置しています。\n選択肢:\n(A) 青色の本は右側から3冊目である\n(B) 黄色の本は右側から3冊目である\n(C) 茶色の本は右側から3冊目である\n(D) 灰色の本は右側から3冊目である\n(E) 緑色の本は右側から3冊目である\n(F) 紫色の本は右側から3冊目である\n(G) オレンジ色の本は右側から3冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：ステーションワゴン、リムジン、トラック、ミニバン、オートバイ、ハッチバック、バスです。オートバイはトラックよりも古い年式です。ステーションワゴンはハッチバックよりも古い年式です。オートバイはハッチバックよりも新しい年式です。バスは最も新しい年式の2番目です。ミニバンは最も古い年式です。リムジンはステーションワゴンよりも古い年式です。\n選択肢:\n(A) ステーションワゴンが最も新しい年式である\n(B) リムジンが最も新しい年式である\n(C) トラックが最も新しい年式である\n(D) ミニバンが最も新しい年式である\n(E) オートバイが最も新しい年式である\n(F) ハッチバックが最も新しい年式である\n(G) バスが最も新しい年式である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、エイダ、エイミー、ロブ、ミア、メル――がいました。エイダはエイミーよりも下位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。ダンはエイダよりも下位でフィニッシュしました。メルは3番目に下位でフィニッシュしました。エイミーは3位でフィニッシュしました。ロブはミアよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) ダンが3位でフィニッシュした\n(C) エイダが3位でフィニッシュした\n(D) エイミーが3位でフィニッシュした\n(E) ロブが3位でフィニッシュした\n(F) ミアが3位でフィニッシュした\n(G) メルが3位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、アダ、エイミー、アナ、イブ、メル、ダン――がいました。アダはメルよりも上位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。エイミーが最下位でフィニッシュしました。アナは下から3番目でフィニッシュしました。ダンはエリよりも下位でフィニッシュしました。イブは3位でフィニッシュしました。\n選択肢:\n(A) エリが最下位でフィニッシュした\n(B) アダが最下位でフィニッシュした\n(C) エイミーが最下位でフィニッシュした\n(D) アナが最下位でフィニッシュした\n(E) イブが最下位でフィニッシュした\n(F) メルが最下位でフィニッシュした\n(G) ダンが最下位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、アナ、ロブ、エイミー、ダン、ジョー、エリ――がいました。エリはエイミーよりも下位でフィニッシュしました。アダは3位でフィニッシュしました。エイミーはロブよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。ロブは2位でフィニッシュしました。アナは4位でフィニッシュしました。\n選択肢:\n(A) アダが3位でフィニッシュした\n(B) アナが3位でフィニッシュした\n(C) ロブが3位でフィニッシュした\n(D) エイミーが3位でフィニッシュした\n(E) ダンが3位でフィニッシュした\n(F) ジョーが3位でフィニッシュした\n(G) エリが3位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、プラム、マンゴー、スイカ、梨、桃、オレンジ――を販売しています。梨は最も安価な3番目の果物です。キウイは最も高価な2番目の果物です。梨はプラムよりも高価です。オレンジはキウイよりも安価です。マンゴーは最も高価な3番目の果物です。桃は最も安価な2番目の果物です。\n選択肢:\n(A) キウイは最も高価な4番目の果物である\n(B) プラムは最も高価な4番目の果物である\n(C) マンゴーは最も高価な4番目の果物である\n(D) スイカは最も高価な4番目の果物である\n(E) 梨は最も高価な4番目の果物である\n(F) 桃は最も高価な4番目の果物である\n(G) オレンジは最も高価な4番目の果物である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：赤い本、紫色の本、緑色の本、白い本、オレンジ色の本、青い本、灰色の本です。緑色の本は白い本の左側にあります。赤い本は紫色の本の左側にあります。赤い本はオレンジ色の本の右側にあります。灰色の本は左から3冊目です。紫色の本は緑色の本の左側にあります。青い本は左から4冊目です。\n選択肢:\n(A) 赤い本は左から3冊目である\n(B) 紫色の本は左から3冊目である\n(C) 緑色の本は左から3冊目である\n(D) 白い本は左から3冊目である\n(E) オレンジ色の本は左から3冊目である\n(F) 青い本は左から3冊目である\n(G) 灰色の本は左から3冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：からす、コウヨウチョウ、ハヤブサ、フクロウ、アオカケス、ウズラ、コマドリです。フクロウは右側から2番目の位置にあります。コウヨウチョウは左側から4番目の位置にあります。ハヤブサはアオカケスの左側にあります。ウズラはハヤブサの左側にあります。からすは左側から2番目の位置にあります。コマドリはウズラの左側にあります。\n選択肢:\n(A) からすは左側から3番目の位置にある\n(B) コウヨウチョウは左側から3番目の位置にある\n(C) ハヤブサは左側から3番目の位置にある\n(D) フクロウは左側から3番目の位置にある\n(E) アオカケスは左側から3番目の位置にある\n(F) ウズラは左側から3番目の位置にある\n(G) コマドリは左側から3番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：ビワ、カンタロープメロン、スイカ、リンゴ、オレンジ、ナシ、マンゴーです。オレンジは価格が2番目に安い果物です。リンゴはナシよりも安価です。マンゴーはカンタロープメロンよりも高価です。マンゴーは価格が3番目に安い果物です。スイカは価格が2番目に高い果物です。ビワは価格が3番目に高い果物です。\n選択肢:\n(A) ビワは価格が2番目に高い\n(B) カンタロープメロンは価格が2番目に高い\n(C) スイカは価格が2番目に高い\n(D) リンゴは価格が2番目に高い\n(E) オレンジは価格が2番目に高い\n(F) ナシは価格が2番目に高い\n(G) マンゴーは価格が2番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：ステーションワゴン、セダン、バス、オートバイ、ハッチバック、トラクター、ミニバンです。セダンは最も古い車両から数えて3番目に古い車両です。トラクターはオートバイよりも新しい車両です。バスはオートバイよりも古い車両です。バスはハッチバックよりも新しい車両です。ミニバンは最も新しい車両です。ステーションワゴンは最も古い車両です。\n選択肢:\n(A) ステーションワゴンが最も古い車両である\n(B) セダンが最も古い車両である\n(C) バスが最も古い車両である\n(D) オートバイが最も古い車両である\n(E) ハッチバックが最も古い車両である\n(F) トラクターが最も古い車両である\n(G) ミニバンが最も古い車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、エリ、ミア、エイミー、ジョー、メル、アダ――がいました。アダはメルよりも上位でフィニッシュしました。アダは準々々々決勝で敗退しました。エイミーはアナよりも上位でフィニッシュしました。ミアは準々々決勝で敗退しました。ジョーはエイミーよりも上位でフィニッシュしました。エリはアナよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが準々々々決勝で敗退した\n(B) エリが準々々々決勝で敗退した\n(C) ミアが準々々々決勝で敗退した\n(D) エイミーが準々々々決勝で敗退した\n(E) ジョーが準々々々決勝で敗退した\n(F) メルが準々々々決勝で敗退した\n(G) アダが準々々々決勝で敗退した", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：リンゴ、プラム、マンゴー、スイカ、オレンジ、キウイ、ビワです。スイカはプラムよりも安価です。スイカはオレンジよりも高価です。キウイはオレンジよりも安価です。リンゴはビワよりも高価です。プラムはマンゴーよりも安価です。マンゴーは最も高価な3種類の果物のうちの1つです。\n選択肢:\n(A) リンゴは最も高価な3種類のうちの1つである\n(B) プラムは最も高価な3種類のうちの1つである\n(C) マンゴーは最も高価な3種類のうちの1つである\n(D) スイカは最も高価な3種類のうちの1つである\n(E) オレンジは最も高価な3種類のうちの1つである\n(F) キウイは最も高価な3種類のうちの1つである\n(G) ビワは最も高価な3種類のうちの1つである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：白い本、灰色の本、黄色い本、紫色の本、赤い本、黒い本、緑色の本です。黒い本は右から2冊目に位置しています。赤い本は緑色の本の左側に配置されています。赤い本は左から2冊目です。灰色の本は右から3冊目に位置しています。黄色い本は左から3冊目です。白い本は左から4冊目に位置しています。\n選択肢:\n(A) 白い本が最も左側にある\n(B) 灰色の本が最も左側にある\n(C) 黄色い本が最も左側にある\n(D) 紫色の本が最も左側にある\n(E) 赤い本が最も左側にある\n(F) 黒い本が最も左側にある\n(G) 緑色の本が最も左側にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――マンゴー、キウイ、オレンジ、スイカ、リンゴ、ナシ、ビワ――を販売しています。ビワはオレンジよりも安価です。オレンジは価格が3番目に高い果物です。リンゴは最も安価な果物です。キウイはナシよりも高価です。マンゴーはスイカよりも高価です。ビワはキウイよりも高価です。\n選択肢:\n(A) マンゴーが最も安価である\n(B) キウイが最も安価である\n(C) オレンジが最も安価である\n(D) スイカが最も安価である\n(E) リンゴが最も安価である\n(F) ナシが最も安価である\n(G) ビワが最も安価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、ハヤブサ、ワタリガラス、カラス、コマドリ、フクロウ、ハチドリです。コマドリはフクロウの左側にあります。カラスは最も右側に位置しています。ハチドリは左から4番目です。フクロウは右から3番目です。アオカケスはコマドリの左側にあります。ワタリガラスは左から2番目です。\n選択肢:\n(A) アオカケスが最も右側に位置する\n(B) ハヤブサが最も右側に位置する\n(C) ワタリガラスが最も右側に位置する\n(D) カラスが最も右側に位置する\n(E) コマドリが最も右側に位置する\n(F) フクロウが最も右側に位置する\n(G) ハチドリが最も右側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：オートバイ、セダン、ステーションワゴン、トラクター、ミニバン、バス、貨物自動車です。オートバイはミニバンよりも古い車両です。ミニバンはトラクターよりも古い車両です。バスは貨物自動車よりも新しい車両です。ステーションワゴンは最も新しい車両のうち3番目に新しいモデルです。セダンは貨物自動車よりも古い車両です。トラクターはセダンよりも古い車両です。\n選択肢:\n(A) オートバイが最も古い車両である\n(B) セダンが最も古い車両である\n(C) ステーションワゴンが最も古い車両である\n(D) トラクターが最も古い車両である\n(E) ミニバンが最も古い車両である\n(F) バスが最も古い車両である\n(G) 貨物自動車が最も古い車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、茶色の本、白色の本、オレンジ色の本、黒色の本、青色の本、紫色の本です。黒色の本は左から2冊目です。白色の本はオレンジ色の本の右側にあります。黒色の本は茶色の本の右側に位置しています。黄色の本は右から3冊目です。紫色の本は左から3冊目です。オレンジ色の本は右から2冊目です。\n選択肢:\n(A) 黄色の本が一番左にある\n(B) 茶色の本が一番左にある\n(C) 白色の本が一番左にある\n(D) オレンジ色の本が一番左にある\n(E) 黒色の本が一番左にある\n(F) 青色の本が一番左にある\n(G) 紫色の本が一番左にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――メル、ロブ、エリ、ダン、アナ、アダ、マイア――がいました。アナが最下位でフィニッシュしました。マイアはロブよりも上位でフィニッシュしました。ダンはマイアよりも上位でフィニッシュしました。ロブは4位でフィニッシュしました。エリは2位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。\n選択肢:\n(A) メルが1位でフィニッシュした\n(B) ロブが1位でフィニッシュした\n(C) エリが1位でフィニッシュした\n(D) ダンが1位でフィニッシュした\n(E) アナが1位でフィニッシュした\n(F) アダが1位でフィニッシュした\n(G) マイアが1位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、緑色の本、黒色の本、オレンジ色の本、白色の本、青色の本、灰色の本です。茶色の本は最も右側にあります。黒色の本は白色の本の右側に位置しています。灰色の本は左から3冊目です。オレンジ色の本は灰色の本の右側にあります。オレンジ色の本は緑色の本の左側に位置しています。青色の本は最も左側から3冊目です。\n選択肢:\n(A) 茶色の本は右側から2冊目である\n(B) 緑色の本は右側から2冊目である\n(C) 黒色の本は右側から2冊目である\n(D) オレンジ色の本は右側から2冊目である\n(E) 白色の本は右側から2冊目である\n(F) 青色の本は右側から2冊目である\n(G) 灰色の本は右側から2冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、アナ、メル、アダ、イブ、エイミー――がいました。イブはエイミーよりも上位でフィニッシュしました。ダンは2位でフィニッシュしました。アダはアナよりも下位でフィニッシュしました。アナは3位と最下位の間の順位でフィニッシュしました。メルが最下位でフィニッシュしました。エイミーは3位でフィニッシュしました。\n選択肢:\n(A) ジョーが1位でフィニッシュした\n(B) ダンが1位でフィニッシュした\n(C) アナが1位でフィニッシュした\n(D) メルが1位でフィニッシュした\n(E) アダが1位でフィニッシュした\n(F) イブが1位でフィニッシュした\n(G) エイミーが1位でフィニッシュした", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――リンゴ、プラム、マンゴー、スイカ、オレンジ、キウイ、ビワ――を販売しています。スイカはプラムよりも安価です。スイカはオレンジよりも高価です。キウイはオレンジよりも安価です。リンゴはビワよりも高価です。プラムはマンゴーよりも安価です。マンゴーは最も高価な3番目の果物です。\n選択肢:\n(A) リンゴが最も安価である\n(B) プラムが最も安価である\n(C) マンゴーが最も安価である\n(D) スイカが最も安価である\n(E) オレンジが最も安価である\n(F) キウイが最も安価である\n(G) ビワが最も安価である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――マンゴー、カンタロープメロン、リンゴ、プラム、ビワ、スイカ、桃――を販売しています。プラムはマンゴーよりも高価です。スイカはビワよりも高価です。ビワは価格が2番目に安い果物です。プラムは桃よりも安価です。マンゴーは4番目に高価な果物です。桃はカンタロープメロンよりも安価です。\n選択肢:\n(A) マンゴーは価格が3番目に安い\n(B) カンタロープメロンは価格が3番目に安い\n(C) リンゴは価格が3番目に安い\n(D) プラムは価格が3番目に安い\n(E) ビワは価格が3番目に安い\n(F) スイカは価格が3番目に安い\n(G) 桃は価格が3番目に安い", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、イブ、アダ、ダン、ロブ、エイミー、ジョー――がいました。ダンは3位でフィニッシュしました。アナはアダよりも上位でフィニッシュしました。エイミーは最下位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはアダよりも下位でフィニッシュしました。ロブはジョーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが4位でフィニッシュした\n(B) イブが4位でフィニッシュした\n(C) アダが4位でフィニッシュした\n(D) ダンが4位でフィニッシュした\n(E) ロブが4位でフィニッシュした\n(F) エイミーが4位でフィニッシュした\n(G) ジョーが4位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、イブ、アダ、ダン、ロブ、エイミー、ジョー――がいました。ダンは3位でフィニッシュしました。アナはアダよりも上位でフィニッシュしました。エイミーは最下位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはアダよりも下位でフィニッシュしました。ロブはジョーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが3位下から2番目でフィニッシュした\n(B) イブが3位下から2番目でフィニッシュした\n(C) アダが3位下から2番目でフィニッシュした\n(D) ダンが3位下から2番目でフィニッシュした\n(E) ロブが3位下から2番目でフィニッシュした\n(F) エイミーが3位下から2番目でフィニッシュした\n(G) ジョーが3位下から2番目でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されていました：トラック、オートバイ、セダン、ミニバン、ステーションワゴン、ハッチバック、トラクターです。ハッチバックはトラックよりも新しいモデルです。セダンは3番目に新しいモデルです。ステーションワゴンは最も新しいモデルです。オートバイはトラックよりも古いモデルです。ミニバンはセダンよりも新しいモデルです。トラクターは3番目に古いモデルです。\n選択肢:\n(A) トラックは2番目に新しいモデルである\n(B) オートバイは2番目に新しいモデルである\n(C) セダンは2番目に新しいモデルである\n(D) ミニバンは2番目に新しいモデルである\n(E) ステーションワゴンは2番目に新しいモデルである\n(F) ハッチバックは2番目に新しいモデルである\n(G) トラクターは2番目に古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、アダ、エイミー、アナ、イブ、メル、ダン――がいました。アダはメルよりも上位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。エイミーが最下位でフィニッシュしました。アナは下から3番目でフィニッシュしました。ダンはエリよりも下位でフィニッシュしました。イブは3位でフィニッシュしました。\n選択肢:\n(A) エリが4位でフィニッシュした\n(B) アダが4位でフィニッシュした\n(C) エイミーが4位でフィニッシュした\n(D) アナが4位でフィニッシュした\n(E) イブが4位でフィニッシュした\n(F) メルが4位でフィニッシュした\n(G) ダンが4位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：カラス、ハチドリ、コマドリ、クロウタドリ、ウズラ、アオカケス、ショウジョウコウカンチョウです。ハチドリはカラスの左側にあります。ウズラはカラスの右側にあります。カラスはコマドリの左側にあります。アオカケスは右側から3番目の位置にあります。ショウジョウコウカンチョウは最も左側にあります。ハチドリは左から4番目の位置にあります。\n選択肢:\n(A) カラスが最も右側に位置する\n(B) ハチドリが最も右側に位置する\n(C) コマドリが最も右側に位置する\n(D) クロウタドリが最も右側に位置する\n(E) ウズラが最も右側に位置する\n(F) アオカケスが最も右側に位置する\n(G) ショウジョウコウカンチョウが最も右側に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：トラック、オープンカー、バス、ステーションワゴン、ミニバン、セダン、オートバイです。バスはセダンよりも新しいモデルです。オートバイはトラックよりも古いモデルです。ステーションワゴンはオートバイよりも古いモデルです。セダンはオープンカーよりも新しいモデルです。ステーションワゴンはバスよりも新しいモデルです。ミニバンは最も新しいモデルから数えて4番目です。\n選択肢:\n(A) トラックは2番目に新しいモデルである\n(B) オープンカーは2番目に新しいモデルである\n(C) バスは2番目に新しいモデルである\n(D) ステーションワゴンは2番目に新しいモデルである\n(E) ミニバンは2番目に新しいモデルである\n(F) セダンは2番目に新しいモデルである\n(G) オートバイは2番目に新しいモデルである", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ショウジョウコウカンチョウ、カラス、ハチドリ、アオカケス、フクロウ、コマドリ、ウズラです。ショウジョウコウカンチョウはカラスの右側に位置しています。ウズラは左から3番目です。フクロウはコマドリの右側にいます。ハチドリはアオカケスの右側に位置しています。ショウジョウコウカンチョウは左から2番目です。フクロウは右から3番目です。\n選択肢:\n(A) ショウジョウコウカンチョウは左から4番目に位置する\n(B) カラスは左から4番目に位置する\n(C) ハチドリは左から4番目に位置する\n(D) アオカケスは左から4番目に位置する\n(E) フクロウは左から4番目に位置する\n(F) コマドリは左から4番目に位置する\n(G) ウズラは左から4番目に位置する", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――ビワ、カンタロープメロン、スイカ、リンゴ、オレンジ、ナシ、マンゴー――を販売しています。オレンジは価格が2番目に安い果物です。リンゴはナシよりも安価です。マンゴーはカンタロープメロンよりも高価です。マンゴーは価格が3番目に安い果物です。スイカは価格が2番目に高い果物です。ビワは価格が3番目に高い果物です。\n選択肢:\n(A) ビワは価格が4番目に高い\n(B) カンタロープメロンは価格が4番目に高い\n(C) スイカは価格が4番目に高い\n(D) リンゴは価格が4番目に高い\n(E) オレンジは価格が4番目に高い\n(F) ナシは価格が4番目に高い\n(G) マンゴーは価格が4番目に高い", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：赤い本、白い本、紫色の本、黒い本、灰色の本、オレンジ色の本、青い本です。赤い本は白い本の右側にあります。灰色の本はオレンジ色の本の左側にあります。灰色の本は青い本の右側にあります。赤い本は右側から2冊目です。黒い本は左側から4冊目です。オレンジ色の本は白い本の左側にあります。\n選択肢:\n(A) 赤い本は左側から4冊目である\n(B) 白い本は左側から4冊目である\n(C) 紫色の本は左側から4冊目である\n(D) 黒い本は左側から4冊目である\n(E) 灰色の本は左側から4冊目である\n(F) オレンジ色の本は左側から4冊目である\n(G) 青い本は左側から4冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ロブ、ダン、メル、アナ、エリ、アダ――がいました。アダはロブよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。アダはダンよりも下位でフィニッシュしました。アナは3位でフィニッシュしました。エリは2位でフィニッシュしました。\n選択肢:\n(A) イブが準々々々々々々決勝で敗退した\n(B) ロブが準々々々々々々決勝で敗退した\n(C) ダンが準々々々々々々決勝で敗退した\n(D) メルが準々々々々々々決勝で敗退した\n(E) アナが準々々々々々々決勝で敗退した\n(F) エリが準々々々々々々決勝で敗退した\n(G) アダが準々々々々々々決勝で敗退した", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：赤い本、紫の本、緑の本、白い本、オレンジ色の本、青い本、灰色の本です。緑の本は白い本の左側にあります。赤い本は紫の本の左側にあります。赤い本はオレンジ色の本の右側にあります。灰色の本は左から2冊目です。紫の本は緑の本の左側にあります。青い本は左から4冊目です。\n選択肢:\n(A) 赤い本は左から4冊目である\n(B) 紫の本は左から4冊目である\n(C) 緑の本は左から4冊目である\n(D) 白い本は左から4冊目である\n(E) オレンジ色の本は左から4冊目である\n(F) 青い本は左から4冊目である\n(G) 灰色の本は左から4冊目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、灰色の本、オレンジ色の本、緑色の本、黒色の本、紫色の本、黄色の本です。紫色の本が最も左側にあります。茶色の本は黄色の本の右側に位置しています。緑色の本はオレンジ色の本の左側に位置しています。オレンジ色の本は灰色の本の左側に位置しています。黒色の本は左から3冊目です。緑色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本が最も右側にある\n(B) 灰色の本が最も右側にある\n(C) オレンジ色の本が最も右側にある\n(D) 緑色の本が最も右側にある\n(E) 黒色の本が最も右側にある\n(F) 紫色の本が最も右側にある\n(G) 黄色の本が最も右側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、トラック、ミニバン、トラクター、ハッチバック、バス、オープンカーです。オープンカーは2番目に古い車両です。トラクターは4番目に新しい車両です。ミニバンはトラックよりも古い車両です。トラックはリムジンよりも古い車両です。ハッチバックは3番目に古い車両です。バスはリムジンよりも新しい車両です。\n選択肢:\n(A) リムジンが2番目に古い車両である\n(B) トラックが2番目に古い車両である\n(C) ミニバンが2番目に古い車両である\n(D) トラクターが2番目に古い車両である\n(E) ハッチバックが2番目に古い車両である\n(F) バスが2番目に古い車両である\n(G) オープンカーが2番目に古い車両である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、エイダ、エイミー、ロブ、ミア、メル――がいました。エイダはエイミーよりも下位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。ダンはエイダよりも下位でフィニッシュしました。メルは3番目に下位でフィニッシュしました。エイミーは3位でフィニッシュしました。ロブはミアよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが最下位でフィニッシュした\n(B) ダンが最下位でフィニッシュした\n(C) エイダが最下位でフィニッシュした\n(D) エイミーが最下位でフィニッシュした\n(E) ロブが最下位でフィニッシュした\n(F) ミアが最下位でフィニッシュした\n(G) メルが最下位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：スイカ、オレンジ、マンゴー、カンタロープメロン、キウイ、梨、桃です。梨は最も安価な2番目の果物です。桃はカンタロープメロンよりも高価です。桃はマンゴーよりも安価です。カンタロープメロンはキウイよりも高価です。オレンジは最も高価な4番目の果物です。スイカは最も高価な2番目の果物です。\n選択肢:\n(A) スイカは最も高価な3番目の果物である\n(B) オレンジは最も高価な3番目の果物である\n(C) マンゴーは最も高価な3番目の果物である\n(D) カンタロープメロンは最も高価な3番目の果物である\n(E) キウイは最も高価な3番目の果物である\n(F) 梨は最も高価な3番目の果物である\n(G) 桃は最も高価な3番目の果物である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ロブ、ダン、メル、アナ、エリ、アダ――がいました。アダはロブよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。アダはダンよりも下位でフィニッシュしました。アナは3位でフィニッシュしました。エリは2位でフィニッシュしました。\n選択肢:\n(A) イブが3位でフィニッシュした\n(B) ロブが3位でフィニッシュした\n(C) ダンが3位でフィニッシュした\n(D) メルが3位でフィニッシュした\n(E) アナが3位でフィニッシュした\n(F) エリが3位でフィニッシュした\n(G) アダが3位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――マイア、エリ、アナ、エイミー、メル、ダン、ジョー――がいました。エイミーはジョーよりも下位でフィニッシュしました。ダンはマイアよりも上位でフィニッシュしました。エリは3位でフィニッシュしました。アナが1位でフィニッシュしました。エイミーは最下位から2番目でフィニッシュしました。マイアは4位でフィニッシュしました。\n選択肢:\n(A) マイアが1位でフィニッシュした\n(B) エリが1位でフィニッシュした\n(C) アナが1位でフィニッシュした\n(D) エイミーが1位でフィニッシュした\n(E) メルが1位でフィニッシュした\n(F) ダンが1位でフィニッシュした\n(G) ジョーが1位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――リンゴ、ナシ、マンゴー、オレンジ、スイカ、桃、カンタロープメロン――を販売しています。ナシはオレンジよりも高価です。オレンジはカンタロープメロンよりも高価です。桃はカンタロープメロンよりも安価です。リンゴは最も安価な3番目の価格です。スイカは2番目に高価な果物です。マンゴーは4番目に高価な果物です。\n選択肢:\n(A) リンゴが最も安価である\n(B) ナシが最も安価である\n(C) マンゴーが最も安価である\n(D) オレンジが最も安価である\n(E) スイカが最も安価である\n(F) 桃が最も安価である\n(G) カンタロープメロンが最も安価である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、灰色の本、オレンジ色の本、緑色の本、黒色の本、紫色の本、黄色の本です。紫色の本が最も左側にあります。茶色の本は黄色の本の右側に位置しています。緑色の本はオレンジ色の本の左側に位置しています。オレンジ色の本は灰色の本の左側に位置しています。黒色の本は左から3冊目です。緑色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本は左から2冊目である\n(B) 灰色の本は左から2冊目である\n(C) オレンジ色の本は左から2冊目である\n(D) 緑色の本は左から2冊目である\n(E) 黒色の本は左から2冊目である\n(F) 紫色の本は左から2冊目である\n(G) 黄色の本は左から2冊目である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、タカ、ハヤブサ、ハチドリ、コマドリ、ウズラです。ハチドリはハヤブサの左側にあります。フクロウは左から2番目の位置です。コマドリはハチドリの左側にあります。ウズラはハヤブサの右側にあります。コマドリはフクロウの右側に位置しています。アオカケスは右側から3番目の位置にあります。\n選択肢:\n(A) アオカケスは左から2番目の位置にある\n(B) フクロウは左から2番目の位置にある\n(C) タカは左から2番目の位置にある\n(D) ハヤブサは左から2番目の位置にある\n(E) ハチドリは左から2番目の位置にある\n(F) コマドリは左から2番目の位置にある\n(G) ウズラは左から2番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、赤色の本、茶色の本、青色の本、黒色の本、灰色の本、白色の本です。白色の本が最も左側にあります。赤色の本は青色の本の右側に位置しています。オレンジ色の本は右側から2冊目です。灰色の本は左側から4冊目です。黒色の本が最も右側にあります。灰色の本は赤色の本の右側に位置しています。\n選択肢:\n(A) オレンジ色の本は右側から3冊目である\n(B) 赤色の本は右側から3冊目である\n(C) 茶色の本は右側から3冊目である\n(D) 青色の本は右側から3冊目である\n(E) 黒色の本は右側から3冊目である\n(F) 灰色の本は右側から3冊目である\n(G) 白色の本は右側から3冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、ミニバン、バス、ステーションワゴン、トラクター、トラック、ハッチバックです。この中でトラックが最も古い車両です。トラクターはミニバンよりも古い車両です。ミニバンは3番目に新しい車両です。リムジンは4番目に新しい車両です。ステーションワゴンはハッチバックよりも新しい車両です。バスは2番目に古い車両です。\n選択肢:\n(A) リムジンが最も古い車両である\n(B) ミニバンが最も古い車両である\n(C) バスが最も古い車両である\n(D) ステーションワゴンが最も古い車両である\n(E) トラクターが最も古い車両である\n(F) トラックが最も古い車両である\n(G) ハッチバックが最も古い車両である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――スイカ、オレンジ、マンゴー、カンタロープメロン、キウイ、梨、桃――を販売しています。梨は最も安価な2番目の果物です。桃はカンタロープメロンよりも高価です。桃はマンゴーよりも安価です。カンタロープメロンはキウイよりも高価です。オレンジは最も高価な4番目の果物です。スイカは最も高価な2番目の果物です。\n選択肢:\n(A) スイカが最も安価である\n(B) オレンジが最も安価である\n(C) マンゴーが最も安価である\n(D) カンタロープメロンが最も安価である\n(E) キウイが最も安価である\n(F) 梨が最も安価である\n(G) 桃が最も安価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：バス、オートバイ、ハッチバック、ステーションワゴン、ミニバン、トラック、リムジンです。ステーションワゴンは最も新しい車両から4番目です。オートバイはトラックよりも新しい車両です。ステーションワゴンはハッチバックよりも古い車両です。ミニバンはハッチバックよりも新しい車両です。バスはミニバンよりも新しい車両です。トラックはリムジンよりも新しい車両です。\n選択肢:\n(A) バスが最も新しい車両である\n(B) オートバイが最も新しい車両である\n(C) ハッチバックが最も新しい車両である\n(D) ステーションワゴンが最も新しい車両である\n(E) ミニバンが最も新しい車両である\n(F) トラックが最も新しい車両である\n(G) リムジンが最も新しい車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、オナガフクロウ、ワタリガラス、ハヤブサ、ウズラ、ハチドリです。ハチドリは左から2番目の位置にあります。ワタリガラスは左から4番目の位置にあります。ワタリガラスはフクロウの右側に位置しています。オナガフクロウはカラスの右側にいます。ハヤブサは最も右側に位置しています。フクロウはハチドリの右側にいます。ウズラは左から2番目の位置にあります。\n選択肢:\n(A) フクロウは右側から3番目の位置にある\n(B) カラスは右側から3番目の位置にある\n(C) オナガフクロウは右側から3番目の位置にある\n(D) ワタリガラスは右側から3番目の位置にある\n(E) ハヤブサは右側から3番目の位置にある\n(F) ウズラは右側から3番目の位置にある\n(G) ハチドリは右側から3番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、灰色の本、オレンジ色の本、緑色の本、黒色の本、紫色の本、黄色の本です。紫色の本が最も左側にあります。茶色の本は黄色の本の右側に位置しています。緑色の本はオレンジ色の本の左側に位置しています。オレンジ色の本は灰色の本の左側に位置しています。黒色の本は左から3冊目です。緑色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本は左から4冊目である\n(B) 灰色の本は左から4冊目である\n(C) オレンジ色の本は左から4冊目である\n(D) 緑色の本は左から4冊目である\n(E) 黒色の本は左から4冊目である\n(F) 紫色の本は左から4冊目である\n(G) 黄色の本は左から4冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、黄色の本、黒い本、白い本、緑色の本、オレンジ色の本、紫色の本です。紫色の本が最も右側にあります。黄色の本が最も左側にあります。オレンジ色の本は右側から2冊目です。茶色の本は緑色の本の左側にあります。茶色の本は黒い本の右側にあります。白い本は左から4冊目です。\n選択肢:\n(A) 茶色の本が最も右側にある\n(B) 黄色の本が最も右側にある\n(C) 黒い本が最も右側にある\n(D) 白い本が最も右側にある\n(E) 緑色の本が最も右側にある\n(F) オレンジ色の本が最も右側にある\n(G) 紫色の本が最も右側にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、タカ、ハヤブサ、ハチドリ、コマドリ、ウズラです。ハチドリはハヤブサの左側にあります。フクロウは左から2番目の位置です。コマドリはハチドリの左側にあります。ウズラはハヤブサの右側に位置しています。コマドリはフクロウの右側にあります。アオカケスは右側から3番目の位置です。\n選択肢:\n(A) アオカケスは右側から3番目の位置にある\n(B) フクロウは右側から3番目の位置にある\n(C) タカは右側から3番目の位置にある\n(D) ハヤブサは右側から3番目の位置にある\n(E) ハチドリは右側から3番目の位置にある\n(F) コマドリは右側から3番目の位置にある\n(G) ウズラは右側から3番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黒い本、オレンジ色の本、黄色い本、白い本、青い本、赤い本、緑の本です。赤い本は黄色い本の右側にあります。白い本は右側から2冊目です。赤い本は緑の本の左側にあります。青い本は黒い本の右側にあります。黒い本は右側から3冊目です。オレンジ色の本は最も左側にあります。\n選択肢:\n(A) 黒い本が最も左側にある\n(B) オレンジ色の本が最も左側にある\n(C) 黄色い本が最も左側にある\n(D) 白い本が最も左側にある\n(E) 青い本が最も左側にある\n(F) 赤い本が最も左側にある\n(G) 緑の本が最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ダン、イブ、ミア、エイミー、ロブ、アダ、ジョー――がいました。エイミーは3位でフィニッシュしました。ジョーが最下位でフィニッシュしました。ミアはダンよりも上位でフィニッシュしました。イブは4位でフィニッシュしました。エイミーはロブよりも上位でフィニッシュしました。アダは6位でフィニッシュしました。\n選択肢:\n(A) ダンが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) エイミーが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした\n(F) アダが2位でフィニッシュした\n(G) ジョーが2位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：紫色の本、緑色の本、白色の本、灰色の本、赤色の本、黒色の本、茶色の本です。灰色の本は紫色の本の左側にあります。白色の本は茶色の本の右側にあります。黒色の本は右側から3冊目です。紫色の本は白色の本の左側にあります。白色の本は右側から2冊目です。灰色の本は左側から3冊目です。茶色の本は緑色の本の右側にあります。\n選択肢:\n(A) 紫色の本は左側から3冊目である\n(B) 緑色の本は左側から3冊目である\n(C) 白色の本は左側から3冊目である\n(D) 灰色の本は左側から3冊目である\n(E) 赤色の本は左側から3冊目である\n(F) 黒色の本は左側から3冊目である\n(G) 茶色の本は左側から3冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――リンゴ、プラム、マンゴー、スイカ、オレンジ、キウイ、ビワ――を販売しています。スイカはプラムよりも安価です。スイカはオレンジよりも高価です。キウイはオレンジよりも安価です。リンゴはビワよりも高価です。プラムはマンゴーよりも安価です。マンゴーは最も高価な3番目の果物です。\n選択肢:\n(A) リンゴは2番目に安価な果物である\n(B) プラムは2番目に安価な果物である\n(C) マンゴーは2番目に安価な果物である\n(D) スイカは2番目に安価な果物である\n(E) オレンジは2番目に安価な果物である\n(F) キウイは2番目に安価な果物である\n(G) ビワは2番目に安価な果物である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：セダン、トラック、バス、ステーションワゴン、トラクター、コンバーチブル、リムジンです。トラックが最も古い車両です。トラクターが最も新しい車両です。セダンはステーションワゴンよりも古い車両です。ステーションワゴンは7台中3番目に新しい車両です。バスはコンバーチブルよりも古い車両です。セダンはコンバーチブルよりも新しい車両です。\n選択肢:\n(A) セダンは7台中4番目に新しい車両である\n(B) トラックは7台中4番目に新しい車両である\n(C) バスは7台中4番目に新しい車両である\n(D) ステーションワゴンは7台中4番目に新しい車両である\n(E) トラクターは7台中4番目に新しい車両である\n(F) コンバーチブルは7台中4番目に新しい車両である\n(G) リムジンは7台中4番目に新しい車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――メル、ロブ、エリ、ダン、アナ、アダ、マイア――がいました。アナが最下位でフィニッシュしました。マイアはロブよりも上位でフィニッシュしました。ダンはマイアよりも上位でフィニッシュしました。ロブは4位でフィニッシュしました。エリは2位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。\n選択肢:\n(A) メルが4位でフィニッシュした\n(B) ロブが4位でフィニッシュした\n(C) エリが4位でフィニッシュした\n(D) ダンが4位でフィニッシュした\n(E) アナが4位でフィニッシュした\n(F) アダが4位でフィニッシュした\n(G) マイアが4位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では、7種類の果物――ビワ、スイカ、オレンジ、キウイ、リンゴ、プラム、モモ――を販売しています。プラムが最も安価です。スイカは価格が3番目に高い果物です。リンゴはオレンジよりも高価です。キウイが最も高価です。リンゴはモモよりも安価です。ビワは価格が3番目に安い果物です。\n選択肢:\n(A) ビワは価格が2番目に高い\n(B) スイカは価格が2番目に高い\n(C) オレンジは価格が2番目に高い\n(D) キウイは価格が2番目に高い\n(E) リンゴは価格が2番目に高い\n(F) プラムは価格が2番目に高い\n(G) モモは価格が2番目に高い", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：バス、オートバイ、ハッチバック、ステーションワゴン、ミニバン、トラック、リムジンです。ステーションワゴンは最も新しい車両から4番目に位置しています。オートバイはトラックよりも新しい車両です。ステーションワゴンはハッチバックよりも古い車両です。ミニバンはハッチバックよりも新しい車両です。バスはミニバンよりも新しい車両です。トラックはリムジンよりも新しい車両です。\n選択肢:\n(A) バスが最も新しい車両から4番目に位置している\n(B) オートバイが最も新しい車両から4番目に位置している\n(C) ハッチバックが最も新しい車両から4番目に位置している\n(D) ステーションワゴンが最も新しい車両から4番目に位置している\n(E) ミニバンが最も新しい車両から4番目に位置している\n(F) トラックが最も新しい車両から4番目に位置している\n(G) リムジンが最も新しい車両から4番目に位置している", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：ステーションワゴン、リムジン、トラック、ミニバン、オートバイ、ハッチバック、バスです。オートバイはトラックよりも古い年式です。ステーションワゴンはハッチバックよりも古い年式です。オートバイはハッチバックよりも新しい年式です。バスは最も新しい年式の2番目です。ミニバンが最も古い年式です。リムジンはステーションワゴンよりも古い年式です。\n選択肢:\n(A) ステーションワゴンが最も古い\n(B) リムジンが最も古い\n(C) トラックが最も古い\n(D) ミニバンが最も古い\n(E) オートバイが最も古い\n(F) ハッチバックが最も古い\n(G) バスが最も古い", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、赤色の本、緑色の本、白色の本、紫色の本、茶色の本、黄色の本です。緑色の本は紫色の本の左側にあります。白色の本はオレンジ色の本の右側にあります。緑色の本は茶色の本の右側にあります。黄色の本は白色の本の右側にあります。赤色の本は黄色の本の右側にあります。茶色の本は赤色の本の右側にあります。\n選択肢:\n(A) オレンジ色の本が最も右側にある\n(B) 赤色の本が最も右側にある\n(C) 緑色の本が最も右側にある\n(D) 白色の本が最も右側にある\n(E) 紫色の本が最も右側にある\n(F) 茶色の本が最も右側にある\n(G) 黄色の本が最も右側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、ミニバン、バス、ステーションワゴン、トラクター、トラック、ハッチバックです。この中でトラックが最も古い車両です。トラクターはミニバンよりも古い車両です。ミニバンは3番目に新しい車両です。リムジンは4番目に新しい車両です。ステーションワゴンはハッチバックよりも新しい車両です。バスは2番目に古い車両です。\n選択肢:\n(A) リムジンが最も新しい車両である\n(B) ミニバンが最も新しい車両である\n(C) バスが最も新しい車両である\n(D) ステーションワゴンが最も新しい車両である\n(E) トラクターが最も新しい車両である\n(F) トラックが最も新しい車両である\n(G) ハッチバックが最も新しい車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、エリ、エイダ、メル、イブ、ロブ、アナ――がいました。ジョーが1位でフィニッシュしました。メルが2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。ロブはエイダよりも下位でフィニッシュしました。イブが4位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) エリが3位でフィニッシュした\n(C) エイダが3位でフィニッシュした\n(D) メルが3位でフィニッシュした\n(E) イブが3位でフィニッシュした\n(F) ロブが3位でフィニッシュした\n(G) アナが3位でフィニッシュした", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ショウジョウコウカンチョウ、アオカケス、コマドリ、ハヤブサ、ウズラ、ハチドリ、ワタリガラスです。ハヤブサはウズラの右側に位置しています。コマドリはハチドリの右側に位置しています。ワタリガラスはウズラの左側に位置しています。アオカケスは左から2番目です。コマドリは左から3番目です。ショウジョウコウカンチョウは右から3番目です。\n選択肢:\n(A) ショウジョウコウカンチョウが最も左側に位置する\n(B) アオカケスが最も左側に位置する\n(C) コマドリが最も左側に位置する\n(D) ハヤブサが最も左側に位置する\n(E) ウズラが最も左側に位置する\n(F) ハチドリが最も左側に位置する\n(G) ワタリガラスが最も左側に位置する", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、白い本、黒い本、黄色い本、オレンジ色の本、青い本、緑色の本です。黄色い本が最も右側にあります。青い本はオレンジ色の本の左側にあります。緑色の本は白い本の右側にあります。青い本は緑色の本の右側にあります。黒い本は左から4冊目です。茶色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本が最も右側にある\n(B) 白い本が最も右側にある\n(C) 黒い本が最も右側にある\n(D) 黄色い本が最も右側にある\n(E) オレンジ色の本が最も右側にある\n(F) 青い本が最も右側にある\n(G) 緑色の本が最も右側にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：緑色の本、茶色の本、白色の本、黒色の本、オレンジ色の本、紫色の本、黄色の本です。紫色の本は黄色の本の左側にあります。緑色の本は白色の本の左側にあります。茶色の本は黄色の本の右側にあります。白色の本は左から4冊目です。緑色の本はオレンジ色の本の右側にあります。黒色の本は左から2冊目です。\n選択肢:\n(A) 緑色の本は右から2冊目である\n(B) 茶色の本は右から2冊目である\n(C) 白色の本は右から2冊目である\n(D) 黒色の本は右から2冊目である\n(E) オレンジ色の本は右から2冊目である\n(F) 紫色の本は右から2冊目である\n(G) 黄色の本は右から2冊目である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、エイミー、エリ、ロブ、ジョー、イブ、アナ――がいました。ロブは2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。ジョーはアダよりも上位でフィニッシュしました。ジョーはイブよりも下位でフィニッシュしました。アダはアナよりも上位でフィニッシュしました。エリは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) アダが2位でフィニッシュした\n(B) エイミーが2位でフィニッシュした\n(C) エリが2位でフィニッシュした\n(D) ロブが2位でフィニッシュした\n(E) ジョーが2位でフィニッシュした\n(F) イブが2位でフィニッシュした\n(G) アナが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物――リンゴ、プラム、マンゴー、スイカ、オレンジ、キウイ、ビワ――を販売しています。スイカはプラムよりも安価です。スイカはオレンジよりも高価です。キウイはオレンジよりも安価です。リンゴはビワよりも高価です。プラムはマンゴーよりも安価です。マンゴーは最も高価な3番目の果物です。\n選択肢:\n(A) リンゴが最も高価である\n(B) プラムが最も高価である\n(C) マンゴーが最も高価である\n(D) スイカが最も高価である\n(E) オレンジが最も高価である\n(F) キウイが最も高価である\n(G) ビワが最も高価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では7種類の果物を販売しています：プラム、キウイ、カンタロープメロン、梨、スイカ、リンゴ、ビワです。スイカはカンタロープメロンよりも高価です。リンゴはカンタロープメロンよりも安価です。スイカは価格が2番目に高い果物です。ビワはキウイよりも安価です。リンゴはビワよりも高価です。ビワは価格が3番目に安い果物です。プラムは最も安価な果物です。\n選択肢:\n(A) プラムは価格が3番目に安い\n(B) キウイは価格が3番目に安い\n(C) カンタロープメロンは価格が3番目に安い\n(D) 梨は価格が3番目に安い\n(E) スイカは価格が3番目に安い\n(F) リンゴは価格が3番目に安い\n(G) ビワは価格が3番目に安い", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、イブ、エイダ、ダン、ロブ、エイミー、ジョー――がいました。ダンは3位でフィニッシュしました。アナはエイダよりも上位でフィニッシュしました。エイミーは最下位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはエイダよりも下位でフィニッシュしました。ロブはジョーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) エイダが2位でフィニッシュした\n(D) ダンが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした\n(F) エイミーが2位でフィニッシュした\n(G) ジョーが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、イブ、アダ、ダン、ロブ、エイミー、ジョー――がいました。ダンは3位でフィニッシュしました。アナはアダよりも上位でフィニッシュしました。エイミーは最下位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはアダよりも下位でフィニッシュしました。ロブはジョーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが最下位でフィニッシュした\n(B) イブが最下位でフィニッシュした\n(C) アダが最下位でフィニッシュした\n(D) ダンが最下位でフィニッシュした\n(E) ロブが最下位でフィニッシュした\n(F) エイミーが最下位でフィニッシュした\n(G) ジョーが最下位でフィニッシュした", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、7台の車両――オートバイ、セダン、ステーションワゴン、トラクター、ミニバン、バス、トラック――が展示されています。オートバイはミニバンよりも古い年代の車両です。ミニバンはトラクターよりも古い年代の車両です。バスはトラックよりも新しい年代の車両です。ステーションワゴンは最も新しい年代の3番目に位置する車両です。セダンはトラックよりも古い年代の車両です。トラクターはセダンよりも古い年代の車両です。\n選択肢:\n(A) オートバイが最も古い年代の3番目に位置する\n(B) セダンが最も古い年代の3番目に位置する\n(C) ステーションワゴンが最も古い年代の3番目に位置する\n(D) トラクターが最も古い年代の3番目に位置する\n(E) ミニバンが最も古い年代の3番目に位置する\n(F) バスが最も古い年代の3番目に位置する\n(G) トラックが最も古い年代の3番目に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、セダン、トラクター、オートバイ、ミニバン、ハッチバック、トラックです。ミニバンはリムジンよりも新しいモデルです。トラクターは2番目に新しいモデルです。トラックはセダンよりも古いモデルです。ミニバンはトラックよりも新しいモデルです。ハッチバックはトラクターよりも新しいモデルです。オートバイは4番目に新しいモデルです。\n選択肢:\n(A) リムジンが最も古いモデルである\n(B) セダンが最も古いモデルである\n(C) トラクターが最も古いモデルである\n(D) オートバイが最も古いモデルである\n(E) ミニバンが最も古いモデルである\n(F) ハッチバックが最も古いモデルである\n(G) トラックが最も古いモデルである", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、黄色の本、黒い本、白い本、緑色の本、オレンジ色の本、紫色の本です。紫色の本が一番右端にあります。黄色の本が一番左端にあります。オレンジ色の本は右から2番目です。茶色の本は緑色の本の左側にあります。茶色の本は黒い本の右側にあります。白い本は左から4番目です。\n選択肢:\n(A) 茶色の本は左から2番目にある\n(B) 黄色の本は左から2番目にある\n(C) 黒い本は左から2番目にある\n(D) 白い本は左から2番目にある\n(E) 緑色の本は左から2番目にある\n(F) オレンジ色の本は左から2番目にある\n(G) 紫色の本は左から2番目にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：紫色の本、茶色の本、赤色の本、青色の本、灰色の本、黒色の本、緑色の本です。茶色の本は緑色の本の左側にあります。灰色の本は左から2冊目です。黒色の本は灰色の本の左側にあります。青色の本は赤色の本の左側にあります。青色の本は右から2冊目です。緑色の本は紫色の本の左側にあります。\n選択肢:\n(A) 紫色の本は左から2冊目である\n(B) 茶色の本は左から2冊目である\n(C) 赤色の本は左から2冊目である\n(D) 青色の本は左から2冊目である\n(E) 灰色の本は左から2冊目である\n(F) 黒色の本は左から2冊目である\n(G) 緑色の本は左から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、緑色の本、赤色の本、灰色の本、紫色の本、青色の本、茶色の本です。紫色の本は左から4冊目に位置しています。茶色の本は左から3冊目です。緑色の本は青色の本の左側に配置されています。赤色の本は最も左側にあります。灰色の本は右から3冊目です。オレンジ色の本は最も右側に位置しています。\n選択肢:\n(A) オレンジ色の本は左から2冊目である\n(B) 緑色の本は左から2冊目である\n(C) 赤色の本は左から2冊目である\n(D) 灰色の本は左から2冊目である\n(E) 紫色の本は左から2冊目である\n(F) 青色の本は左から2冊目である\n(G) 茶色の本は左から2冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ショウジョウコウカンチョウ、アオカケス、コマドリ、ハヤブサ、ウズラ、ハチドリ、ワタリガラスです。ハヤブサはウズラの右側に位置しています。コマドリはハチドリの右側に位置しています。ワタリガラスはウズラの左側に位置しています。アオカケスは左から2番目の位置にあります。コマドリは左から3番目の位置にあります。ショウジョウコウカンチョウは右から3番目の位置にあります。\n選択肢:\n(A) ショウジョウコウカンチョウが左から3番目の位置にある\n(B) アオカケスが左から3番目の位置にある\n(C) コマドリが左から3番目の位置にある\n(D) ハヤブサが左から3番目の位置にある\n(E) ウズラが左から3番目の位置にある\n(F) ハチドリが左から3番目の位置にある\n(G) ワタリガラスが左から3番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：紫色の本、茶色の本、赤色の本、青色の本、灰色の本、黒色の本、緑色の本です。茶色の本は緑色の本の左側にあります。灰色の本は左から2冊目です。黒色の本は灰色の本の左側にあります。青色の本は赤色の本の左側にあります。青色の本は右から2冊目です。緑色の本は紫色の本の左側にあります。\n選択肢:\n(A) 紫色の本が右から2冊目である\n(B) 茶色の本が右から2冊目である\n(C) 赤色の本が右から2冊目である\n(D) 青色の本が右から2冊目である\n(E) 灰色の本が右から2冊目である\n(F) 黒色の本が右から2冊目である\n(G) 緑色の本が右から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：青色の本、黄色の本、茶色の本、灰色の本、緑色の本、紫色の本、オレンジ色の本です。青色の本は茶色の本の右側にあります。灰色の本は最も右側に位置しています。紫色の本は緑色の本の左側に位置しています。緑色の本は黄色の本の左側に位置しています。茶色の本は左から2番目にあります。紫色の本は青色の本の右側に位置しています。\n選択肢:\n(A) 青色の本は右から2番目にある\n(B) 黄色の本は右から2番目にある\n(C) 茶色の本は右から2番目にある\n(D) 灰色の本は右から2番目にある\n(E) 緑色の本は右から2番目にある\n(F) 紫色の本は右から2番目にある\n(G) オレンジ色の本は右から2番目にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ショウジョウコウカンチョウ、アオカケス、コマドリ、カラス、ハヤブサ、ノスリ、ワタリガラスです。ノスリは右側から2番目の位置にあります。ワタリガラスは左側から4番目の位置にあります。コマドリは左側から2番目の位置にあります。ショウジョウコウカンチョウはワタリガラスの左側にあります。ハヤブサはコマドリの左側にあります。カラスはアオカケスの右側に位置しています。\n選択肢:\n(A) ショウジョウコウカンチョウが左側から2番目の位置にある\n(B) アオカケスが左側から2番目の位置にある\n(C) コマドリが左側から2番目の位置にある\n(D) カラスが左側から2番目の位置にある\n(E) ハヤブサが左側から2番目の位置にある\n(F) ノスリが左側から2番目の位置にある\n(G) ワタリガラスが左側から2番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、エリ、エイダ、メル、イブ、ロブ、アナ――がいました。ジョーが1位でフィニッシュしました。メルが2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。ロブはエイダよりも下位でフィニッシュしました。イブが4位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) エリが2位でフィニッシュした\n(C) エイダが2位でフィニッシュした\n(D) メルが2位でフィニッシュした\n(E) イブが2位でフィニッシュした\n(F) ロブが2位でフィニッシュした\n(G) アナが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、セダン、ミニバン、オートバイ、リムジン、ハッチバック、トラック、トラクターの7台の車両が展示されています。オートバイはトラクターよりも古い車両です。ハッチバックはリムジンよりも古い車両です。ハッチバックはトラックよりも新しい車両です。トラックはトラクターよりも新しい車両です。ミニバンは最も新しい車両から2番目です。セダンは最も新しい車両から3番目です。\n選択肢:\n(A) セダンは最も新しい車両から3番目である\n(B) ミニバンは最も新しい車両から3番目である\n(C) オートバイは最も新しい車両から3番目である\n(D) リムジンは最も新しい車両から3番目である\n(E) ハッチバックは最も新しい車両から3番目である\n(F) トラックは最も新しい車両から3番目である\n(G) トラクターは最も新しい車両から3番目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、ハヤブサ、ショウジョウコウカンチョウ、ハチドリ、ウズラ、タカです。ハヤブサはカラスの左側にあります。ウズラはショウジョウコウカンチョウの右側にあります。ハチドリはウズラの右側にあります。ハヤブサは右側から2番目の位置にあります。ハチドリはタカの左側にあります。フクロウは左側から3番目の位置にあります。\n選択肢:\n(A) フクロウは左側から4番目の位置にある\n(B) カラスは左側から4番目の位置にある\n(C) ハヤブサは左側から4番目の位置にある\n(D) ショウジョウコウカンチョウは左側から4番目の位置にある\n(E) ハチドリは左側から4番目の位置にある\n(F) ウズラは左側から4番目の位置にある\n(G) タカは左側から4番目の位置にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コウヨウチョウ、アオカケス、コマドリ、カラス、ノスリ、タカ、ワタリガラスです。ノスリは右側から2番目の位置にあります。ワタリガラスは左側から4番目の位置にあります。コマドリは左側から2番目の位置にあります。コウヨウチョウはワタリガラスの左側にあります。タカはコマドリの左側にあります。カラスはアオカケスの右側に位置しています。\n選択肢:\n(A) コウヨウチョウは右側から3番目の位置にある\n(B) アオカケスは右側から3番目の位置にある\n(C) コマドリは右側から3番目の位置にある\n(D) カラスは右側から3番目の位置にある\n(E) ノスリは右側から3番目の位置にある\n(F) タカは右側から3番目の位置にある\n(G) ワタリガラスは右側から3番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、イブ、メル、エイミー、ミャ、ダン、ロブ――がいました。エイミーはダンよりも上位でフィニッシュしました。ロブは3位でフィニッシュしました。メルはロブよりも下位でフィニッシュしました。ダンは2位でフィニッシュしました。イブはエイミーよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーは4位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) メルが2位でフィニッシュした\n(D) エイミーが2位でフィニッシュした\n(E) ミャが2位でフィニッシュした\n(F) ダンが2位でフィニッシュした\n(G) ロブが2位でフィニッシュした", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、ハチドリ、ウズラ、フクロウ、カラス、コマドリ、コウヨウチョウです。コウヨウチョウは右側から2番目の位置にあります。フクロウは最も右側に位置しています。ハチドリはフクロウの左側にいます。コマドリはウズラの左側に位置しています。カラスはフクロウの右側にあります。コマドリは左から4番目の位置にあります。\n選択肢:\n(A) フクロウは左から3番目の位置にある\n(B) ハチドリは左から3番目の位置にある\n(C) ウズラは左から3番目の位置にある\n(D) フクロウは左から3番目の位置にある\n(E) カラスは左から3番目の位置にある\n(F) コマドリは左から3番目の位置にある\n(G) コウヨウチョウは左から3番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、赤色の本、灰色の本、青色の本、白色の本、橙色の本、紫色の本です。赤色の本は右から3冊目に位置しています。白色の本は橙色の本の右側にあります。紫色の本は左から3冊目に位置しています。黄色の本は紫色の本の右側にあります。青色の本は赤色の本の右側にあります。青色の本は灰色の本の左側にあります。\n選択肢:\n(A) 黄色の本は左から3冊目に位置している\n(B) 赤色の本は左から3冊目に位置している\n(C) 灰色の本は左から3冊目に位置している\n(D) 青色の本は左から3冊目に位置している\n(E) 白色の本は左から3冊目に位置している\n(F) 橙色の本は左から3冊目に位置している\n(G) 紫色の本は左から3冊目に位置している", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：白い本、灰色の本、黄色い本、紫色の本、赤い本、黒い本、緑色の本です。黒い本は右から2冊目に位置しています。赤い本は緑色の本の左側に配置されています。赤い本は左から2冊目です。灰色の本は右から3冊目に位置しています。黄色い本は左から3冊目です。白い本は左から4冊目に位置しています。\n選択肢:\n(A) 白い本が左から2冊目である\n(B) 灰色の本が左から2冊目である\n(C) 黄色い本が左から2冊目である\n(D) 紫色の本が左から2冊目である\n(E) 赤い本が左から2冊目である\n(F) 黒い本が左から2冊目である\n(G) 緑色の本が左から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、リムジン、セダン、トラクター、オートバイ、ミニバン、ハッチバック、トラックの7台の車両が展示されています。ミニバンはリムジンよりも新しいモデルです。トラクターは2番目に新しいモデルです。トラックはセダンよりも古いモデルです。ミニバンはトラックよりも新しいモデルです。ハッチバックはトラクターよりも新しいモデルです。オートバイは4番目に新しいモデルです。\n選択肢:\n(A) リムジンは4番目に新しいモデルである\n(B) セダンは4番目に新しいモデルである\n(C) トラクターは4番目に新しいモデルである\n(D) オートバイは4番目に新しいモデルである\n(E) ミニバンは4番目に新しいモデルである\n(F) ハッチバックは4番目に新しいモデルである\n(G) トラックは4番目に新しいモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――スイカ、オレンジ、マンゴー、カンタロープメロン、キウイ、梨、桃――を販売しています。梨は最も安価な2番目の果物です。桃はカンタロープメロンよりも高価です。桃はマンゴーよりも安価です。カンタロープメロンはキウイよりも高価です。オレンジは最も高価な4番目の果物です。スイカは最も高価な2番目の果物です。\n選択肢:\n(A) スイカは最も安価な3番目の果物である\n(B) オレンジは最も安価な3番目の果物である\n(C) マンゴーは最も安価な3番目の果物である\n(D) カンタロープメロンは最も安価な3番目の果物である\n(E) キウイは最も安価な3番目の果物である\n(F) 梨は最も安価な3番目の果物である\n(G) 桃は最も安価な3番目の果物である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コウヨウチョウ、アオカケス、コマドリ、カラス、ノスリ、タカ、ワタリガラスです。タカは右側から2番目の位置にあります。ワタリガラスは左側から4番目の位置にあります。コマドリは左側から2番目の位置にあります。コウヨウチョウはワタリガラスの左側にあります。ノスリはコマドリの左側にあります。カラスはアオカケスの右側に位置しています。\n選択肢:\n(A) コウヨウチョウは左側から4番目の位置にある\n(B) アオカケスは左側から4番目の位置にある\n(C) コマドリは左側から4番目の位置にある\n(D) カラスは左側から4番目の位置にある\n(E) ノスリは左側から4番目の位置にある\n(F) タカは左側から4番目の位置にある\n(G) ワタリガラスは左側から4番目の位置にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：オープンカー、リムジン、ハッチバック、バス、ステーションワゴン、トラクター、ミニバンです。ステーションワゴンは最も新しい車両から4番目です。ハッチバックはバスよりも古い車両です。ハッチバックは最も新しい車両から2番目です。ミニバンはリムジンよりも新しい車両です。オープンカーはリムジンよりも古い車両です。トラクターは最も新しい車両から2番目です。\n選択肢:\n(A) オープンカーが最も新しい車両から4番目である\n(B) リムジンが最も新しい車両から4番目である\n(C) ハッチバックが最も新しい車両から4番目である\n(D) バスが最も新しい車両から4番目である\n(E) ステーションワゴンが最も新しい車両から4番目である\n(F) トラクターが最も新しい車両から4番目である\n(G) ミニバンが最も新しい車両から4番目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コマドリ、ハチドリ、ワタリガラス、アオカケス、カラス、ショウジョウコウカンチョウ、ウズラです。ハチドリはカラスの左側に位置しています。ショウジョウコウカンチョウはウズラの右側に位置しています。アオカケスは左から4番目の位置にあります。コマドリは左から2番目の位置にあります。ウズラはカラスの右側に位置しています。ワタリガラスはコマドリの左側に位置しています。\n選択肢:\n(A) コマドリは左から4番目の位置にある\n(B) ハチドリは左から4番目の位置にある\n(C) ワタリガラスは左から4番目の位置にある\n(D) アオカケスは左から4番目の位置にある\n(E) カラスは左から4番目の位置にある\n(F) ショウジョウコウカンチョウは左から4番目の位置にある\n(G) ウズラは左から4番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、エイダ、エイミー、ロブ、ミャ、メル――がいました。エイダはエイミーよりも下位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。ダンはエイダよりも下位でフィニッシュしました。メルは準々々々々決勝で敗退しました。エイミーは3位でフィニッシュしました。ロブはミャよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが準々々々々決勝で敗退した\n(B) ダンが準々々々々決勝で敗退した\n(C) エイダが準々々々々決勝で敗退した\n(D) エイミーが準々々々々決勝で敗退した\n(E) ロブが準々々々々決勝で敗退した\n(F) ミャが準々々々々決勝で敗退した\n(G) メルが準々々々々決勝で敗退した", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、プラム、マンゴー、スイカ、梨、桃、オレンジ――を販売しています。梨は最も安価な3番目の果物です。キウイは最も高価な2番目の果物です。梨はプラムよりも高価です。オレンジはキウイよりも安価です。マンゴーは最も高価な3番目の果物です。桃は最も安価な2番目の果物です。\n選択肢:\n(A) キウイは最も高価な3番目の果物である\n(B) プラムは最も高価な3番目の果物である\n(C) マンゴーは最も高価な3番目の果物である\n(D) スイカは最も高価な3番目の果物である\n(E) 梨は最も高価な3番目の果物である\n(F) 桃は最も安価な2番目の果物である\n(G) オレンジは最も高価な3番目の果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、アダ、エイミー、アナ、イブ、メル、ダン――がいました。アダはメルよりも上位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。エイミーが最下位でフィニッシュしました。アナは3番目に下位でフィニッシュしました。ダンはエリよりも下位でフィニッシュしました。イブは3位でフィニッシュしました。\n選択肢:\n(A) エリが3番目に下位でフィニッシュした\n(B) アダが3番目に下位でフィニッシュした\n(C) エイミーが3番目に下位でフィニッシュした\n(D) アナが3番目に下位でフィニッシュした\n(E) イブが3番目に下位でフィニッシュした\n(F) メルが3番目に下位でフィニッシュした\n(G) ダンが3番目に下位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、エリ、エイダ、メル、イブ、ロブ、アナ――がいました。ジョーが1位でフィニッシュしました。メルが2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。ロブはエイダよりも下位でフィニッシュしました。イブは4位でフィニッシュしました。\n選択肢:\n(A) ジョーが1位でフィニッシュした\n(B) エリが1位でフィニッシュした\n(C) エイダが1位でフィニッシュした\n(D) メルが1位でフィニッシュした\n(E) イブが1位でフィニッシュした\n(F) ロブが1位でフィニッシュした\n(G) アナが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、タカ、ハヤブサ、ハチドリ、コマドリ、ウズラです。ハチドリはハヤブサの左側にあります。フクロウは左から2番目の位置です。コマドリはハチドリの左側にあります。ウズラはハヤブサの右側にあります。コマドリはフクロウの右側に位置しています。アオカケスは右側から3番目の位置にあります。\n選択肢:\n(A) アオカケスが最も右側に位置する\n(B) フクロウが最も右側に位置する\n(C) タカが最も右側に位置する\n(D) ハヤブサが最も右側に位置する\n(E) ハチドリが最も右側に位置する\n(F) コマドリが最も右側に位置する\n(G) ウズラが最も右側に位置する", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ロブ、ダン、メル、アナ、エリ、アダ――がいました。アダはロブよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。アダはダンよりも下位でフィニッシュしました。アナは3位でフィニッシュしました。エリは2位でフィニッシュしました。\n選択肢:\n(A) イブが1位でフィニッシュした\n(B) ロブが1位でフィニッシュした\n(C) ダンが1位でフィニッシュした\n(D) メルが1位でフィニッシュした\n(E) アナが1位でフィニッシュした\n(F) エリが1位でフィニッシュした\n(G) アダが1位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、赤色の本、灰色の本、青色の本、白色の本、オレンジ色の本、紫色の本です。赤色の本は右から3冊目に位置しています。白色の本はオレンジ色の本の右側にあります。紫色の本は左から3冊目に位置しています。黄色の本は紫色の本の右側にあります。青色の本は赤色の本の右側にあります。青色の本は灰色の本の左側にあります。\n選択肢:\n(A) 黄色の本が最も左側にある\n(B) 赤色の本が最も左側にある\n(C) 灰色の本が最も左側にある\n(D) 青色の本が最も左側にある\n(E) 白色の本が最も左側にある\n(F) オレンジ色の本が最も左側にある\n(G) 紫色の本が最も左側にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：ステーションワゴン、セダン、バス、オートバイ、ハッチバック、トラクター、ミニバンです。セダンは最も古い車両から数えて3番目に古い車両です。トラクターはオートバイよりも新しい車両です。バスはオートバイよりも古い車両です。バスはハッチバックよりも新しい車両です。ミニバンは最も新しい車両です。ステーションワゴンは最も古い車両です。\n選択肢:\n(A) ステーションワゴンは3番目に古い車両である\n(B) セダンは3番目に古い車両である\n(C) バスは3番目に古い車両である\n(D) オートバイは3番目に古い車両である\n(E) ハッチバックは3番目に古い車両である\n(F) トラクターは3番目に古い車両である\n(G) ミニバンは3番目に古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、カンタロープメロン、オレンジ、ビワ、梨、スイカ、桃――を販売しています。ビワは桃よりも安価です。梨は価格が3番目に安い果物です。オレンジはカンタロープメロンよりも安価です。ビワはスイカよりも高価です。桃はオレンジよりも安価です。キウイは価格が2番目に高い果物です。\n選択肢:\n(A) キウイは価格が2番目に高い\n(B) カンタロープメロンは価格が2番目に高い\n(C) オレンジは価格が2番目に高い\n(D) ビワは価格が2番目に高い\n(E) 梨は価格が2番目に高い\n(F) スイカは価格が2番目に高い\n(G) 桃は価格が2番目に高い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ミア、ロブ、アナ、アダ、メル、ジョー――がいました。イブは3位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。ミアはロブよりも上位でフィニッシュしました。メルはジョーよりも下位でフィニッシュしました。ミアは2位でフィニッシュしました。アダは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) イブが最下位でフィニッシュした\n(B) ミアが最下位でフィニッシュした\n(C) ロブが最下位でフィニッシュした\n(D) アナが最下位でフィニッシュした\n(E) アダが最下位でフィニッシュした\n(F) メルが最下位でフィニッシュした\n(G) ジョーが最下位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、エイミー、エリ、ロブ、ジョー、イブ、アナ――がいました。ロブは2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。ジョーはアダよりも上位でフィニッシュしました。ジョーはイブよりも下位でフィニッシュしました。アダはアナよりも上位でフィニッシュしました。エリは最下位から3番目でフィニッシュしました。\n選択肢:\n(A) アダが最下位でフィニッシュした\n(B) エイミーが最下位でフィニッシュした\n(C) エリが最下位でフィニッシュした\n(D) ロブが最下位でフィニッシュした\n(E) ジョーが最下位でフィニッシュした\n(F) イブが最下位でフィニッシュした\n(G) アナが最下位でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ハヤブサ、カラス、タカ、ハチドリ、アオカケス、コマドリ、ワタリガラスです。アオカケスはコマドリの右側に位置しています。タカはハチドリの左側に位置しています。コマドリは右側から2番目の位置にあります。ハヤブサは左側から3番目の位置にあります。カラスはハチドリの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。\n選択肢:\n(A) ハヤブサは左側から3番目の位置にある\n(B) カラスは左側から3番目の位置にある\n(C) タカは左側から3番目の位置にある\n(D) ハチドリは左側から3番目の位置にある\n(E) アオカケスは左側から3番目の位置にある\n(F) コマドリは左側から3番目の位置にある\n(G) ワタリガラスは左側から3番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ハチドリ、ショウジョウコウカンチョウ、アオカケス、フクロウ、ワタリガラス、ウズラ、コマドリです。ハチドリはウズラの左側にあります。コマドリはショウジョウコウカンチョウの左側にあります。アオカケスは最も左側の位置にあります。ショウジョウコウカンチョウは左から4番目の位置にあります。ワタリガラスは右から3番目の位置にあります。フクロウは左から3番目の位置にあります。\n選択肢:\n(A) ハチドリは左から4番目の位置にある\n(B) ショウジョウコウカンチョウは左から4番目の位置にある\n(C) アオカケスは左から4番目の位置にある\n(D) フクロウは左から4番目の位置にある\n(E) ワタリガラスは左から4番目の位置にある\n(F) ウズラは左から4番目の位置にある\n(G) コマドリは左から4番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、アナ、メル、アダ、イブ、エイミー――がいました。イブはエイミーよりも上位でフィニッシュしました。ダンは2位でフィニッシュしました。アダはアナよりも下位でフィニッシュしました。アナは3位から4番目でフィニッシュしました。メルが最下位でフィニッシュしました。エイミーは3位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) ダンが3位でフィニッシュした\n(C) アナが3位でフィニッシュした\n(D) メルが3位でフィニッシュした\n(E) アダが3位でフィニッシュした\n(F) イブが3位でフィニッシュした\n(G) エイミーが3位でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物――ビワ、スイカ、オレンジ、キウイ、リンゴ、プラム、桃――を販売しています。プラムが最も安価です。スイカは価格が3番目に高い部類に入ります。リンゴはオレンジよりも高価です。キウイが最も高価です。リンゴは桃よりも安価です。ビワは価格が3番目に安い部類に入ります。\n選択肢:\n(A) ビワが最も高価である\n(B) スイカが最も高価である\n(C) オレンジが最も高価である\n(D) キウイが最も高価である\n(E) リンゴが最も高価である\n(F) プラムが最も高価である\n(G) 桃が最も高価である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、エイミー、エリ、ロブ、ジョー、イブ、アナ――がいました。ロブは2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。ジョーはアダよりも上位でフィニッシュしました。ジョーはイブよりも下位でフィニッシュしました。アダはアナよりも上位でフィニッシュしました。エリは最下位から3番目でフィニッシュしました。\n選択肢:\n(A) アダが1位でフィニッシュした\n(B) エイミーが1位でフィニッシュした\n(C) エリが1位でフィニッシュした\n(D) ロブが1位でフィニッシュした\n(E) ジョーが1位でフィニッシュした\n(F) イブが1位でフィニッシュした\n(G) アナが1位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、茶色の本、白色の本、オレンジ色の本、黒色の本、青色の本、紫色の本です。黒色の本は左から2冊目です。白色の本はオレンジ色の本の右側にあります。黒色の本は茶色の本の右側に位置しています。黄色の本は右から3冊目です。紫色の本は左から3冊目です。オレンジ色の本は右から2冊目です。\n選択肢:\n(A) 黄色の本は左から2冊目である\n(B) 茶色の本は左から2冊目である\n(C) 白色の本は左から2冊目である\n(D) オレンジ色の本は左から2冊目である\n(E) 黒色の本は左から2冊目である\n(F) 青色の本は左から2冊目である\n(G) 紫色の本は左から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、ハヤブサ、タカ、ワタリガラス、カラス、ハチドリです。ハヤブサは左から2番目の位置にあります。カラスは最も右側に位置しています。ハチドリはアオカケスの右側にあります。タカはハチドリの右側に位置しています。アオカケスはフクロウの右側にあります。ワタリガラスはハヤブサの左側に位置しています。\n選択肢:\n(A) アオカケスは右側から3番目の位置にある\n(B) フクロウは右側から3番目の位置にある\n(C) ハヤブサは右側から3番目の位置にある\n(D) タカは右側から3番目の位置にある\n(E) ワタリガラスは右側から3番目の位置にある\n(F) カラスは右側から3番目の位置にある\n(G) ハチドリは右側から3番目の位置にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、ロブ、イブ、メル、ミア、ジョー、エリ――がいました。ジョーは2番目に下位でフィニッシュしました。エリが1位でフィニッシュしました。ミアはジョーよりも下位でフィニッシュしました。メルは2位でフィニッシュしました。ロブは3番目に下位でフィニッシュしました。アナは3位でフィニッシュしました。\n選択肢:\n(A) アナが最下位でフィニッシュした\n(B) ロブが最下位でフィニッシュした\n(C) イブが最下位でフィニッシュした\n(D) メルが最下位でフィニッシュした\n(E) ミアが最下位でフィニッシュした\n(F) ジョーが最下位でフィニッシュした\n(G) エリが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：オナガフクロウ、ハチドリ、ハヤブサ、ショウジョウコウカンチョウ、フクロウ、コマツグミ、アオカケスです。ハチドリはフクロウの左側にあります。コマツグミは最も右側に位置しています。アオカケスはオナガフクロウの左側にあります。アオカケスは左から3番目の位置にあります。ハヤブサは左から4番目の位置にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。\n選択肢:\n(A) オナガフクロウは左から2番目の位置にある\n(B) ハチドリは左から2番目の位置にある\n(C) ハヤブサは左から2番目の位置にある\n(D) ショウジョウコウカンチョウは左から2番目の位置にある\n(E) オナガフクロウは左から2番目の位置にある\n(F) コマツグミは左から2番目の位置にある\n(G) アオカケスは左から2番目の位置にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、赤色の本、灰色の本、青色の本、白色の本、オレンジ色の本、紫色の本です。赤色の本は右から3冊目に位置しています。白色の本はオレンジ色の本の右側にあります。紫色の本は左から3冊目に位置しています。黄色の本は紫色の本の右側にあります。青色の本は赤色の本の右側にあります。青色の本は灰色の本の左側に位置しています。\n選択肢:\n(A) 黄色の本が一番右側にある\n(B) 赤色の本が一番右側にある\n(C) 灰色の本が一番右側にある\n(D) 青色の本が一番右側にある\n(E) 白色の本が一番右側にある\n(F) オレンジ色の本が一番右側にある\n(G) 紫色の本が一番右側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ハヤブサ、カラス、タカ、ハチドリ、アオカケス、コマドリ、ワタリガラスです。アオカケスはコマドリの右側に位置しています。タカはハチドリの左側に位置しています。コマドリは右側から2番目の位置にあります。ハヤブサは左側から3番目の位置にあります。カラスはハチドリの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。\n選択肢:\n(A) ハヤブサは左側から4番目の位置にある\n(B) カラスは左側から4番目の位置にある\n(C) タカは左側から4番目の位置にある\n(D) ハチドリは左側から4番目の位置にある\n(E) アオカケスは左側から4番目の位置にある\n(F) コマドリは左側から4番目の位置にある\n(G) ワタリガラスは左側から4番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、フクロウ、ハヤブサ、タカ、ワタリガラス、カラス、ハチドリです。ハヤブサは左から2番目の位置にあります。カラスは最も右側に位置しています。ハチドリはアオカケスの右側にあります。タカはハチドリの右側に位置しています。アオカケスはフクロウの右側にあります。ワタリガラスはハヤブサの左側に位置しています。\n選択肢:\n(A) アオカケスは左から3番目の位置にある\n(B) フクロウは左から3番目の位置にある\n(C) ハヤブサは左から3番目の位置にある\n(D) タカは左から3番目の位置にある\n(E) ワタリガラスは左から3番目の位置にある\n(F) カラスは左から3番目の位置にある\n(G) ハチドリは左から3番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、イブ、メル、ジョー、ミャ、ロブ、アダ――がいました。アダはミャよりも上位でフィニッシュしました。エリはジョーよりも下位でフィニッシュしました。エリはイブよりも上位でフィニッシュしました。アダは2位でフィニッシュしました。メルは3位でフィニッシュしました。ロブは4位でフィニッシュしました。\n選択肢:\n(A) エリが最下位でフィニッシュした\n(B) イブが最下位でフィニッシュした\n(C) メルが最下位でフィニッシュした\n(D) ジョーが最下位でフィニッシュした\n(E) ミャが最下位でフィニッシュした\n(F) ロブが最下位でフィニッシュした\n(G) アダが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――プラム、キウイ、梨、マンゴー、リンゴ、オレンジ、ビワ――を販売しています。梨はオレンジよりも安価です。マンゴーはキウイよりも安価です。プラムは2番目に高価な果物です。ビワはリンゴよりも高価です。キウイはリンゴよりも安価です。ビワは4番目に高価な果物です。\n選択肢:\n(A) プラムが2番目に安価な果物である\n(B) キウイが2番目に安価な果物である\n(C) 梨が2番目に安価な果物である\n(D) マンゴーが2番目に安価な果物である\n(E) リンゴが2番目に安価な果物である\n(F) オレンジが2番目に安価な果物である\n(G) ビワが2番目に安価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、アナ、エイミー、ダン、エリ、ロブ、マイア――がいました。マイアはエリよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。エイミーは2位でフィニッシュしました。ロブはダンよりも下位でフィニッシュしました。アナは最下位から2番目でフィニッシュしました。ダンは4位でフィニッシュしました。\n選択肢:\n(A) イブが4位でフィニッシュした\n(B) アナが4位でフィニッシュした\n(C) エイミーが4位でフィニッシュした\n(D) ダンが4位でフィニッシュした\n(E) エリが4位でフィニッシュした\n(F) ロブが4位でフィニッシュした\n(G) マイアが4位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：ステーションワゴン、セダン、バス、オートバイ、ハッチバック、トラクター、ミニバンです。セダンは最も古い車両から数えて3番目に古い車両です。トラクターはオートバイよりも新しい車両です。バスはオートバイよりも古い車両です。バスはハッチバックよりも新しい車両です。ミニバンは最も新しい車両です。ステーションワゴンは最も古い車両です。\n選択肢:\n(A) ステーションワゴンは2番目に新しい車両である\n(B) セダンは2番目に新しい車両である\n(C) バスは2番目に新しい車両である\n(D) オートバイは2番目に新しい車両である\n(E) ハッチバックは2番目に新しい車両である\n(F) トラクターは2番目に新しい車両である\n(G) ミニバンは2番目に新しい車両である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――マンゴー、スイカ、桃、キウイ、オレンジ、カンタロープメロン、プラム――を販売しています。スイカが最も安価です。桃はマンゴーよりも高価です。カンタロープメロンは2番目に高価な果物です。オレンジはカンタロープメロンよりも高価です。桃はプラムよりも安価です。キウイは3番目に安価な果物です。\n選択肢:\n(A) マンゴーが最も高価である\n(B) スイカが最も高価である\n(C) 桃が最も高価である\n(D) キウイが最も高価である\n(E) オレンジが最も高価である\n(F) カンタロープメロンが最も高価である\n(G) プラムが最も高価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：赤い本、白い本、紫色の本、黒い本、灰色の本、オレンジ色の本、青い本です。赤い本は白い本の右側にあります。灰色の本はオレンジ色の本の左側にあります。灰色の本は青い本の右側にあります。赤い本は右側から3冊目です。黒い本は左側から4冊目です。オレンジ色の本は白い本の左側にあります。\n選択肢:\n(A) 赤い本は左から3冊目である\n(B) 白い本は左から3冊目である\n(C) 紫色の本は左から3冊目である\n(D) 黒い本は左から3冊目である\n(E) 灰色の本は左から3冊目である\n(F) オレンジ色の本は左から3冊目である\n(G) 青い本は左から3冊目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：ミニバン、バス、リムジン、トラック、オープンカー、トラクター、オートバイです。リムジンはミニバンよりも古い車両です。トラクターはリムジンよりも古い車両です。バスは最も新しい車両です。トラックは5番目に新しい車両です。オートバイは4番目に新しい車両です。オープンカーはトラクターよりも古い車両です。\n選択肢:\n(A) ミニバンは5番目に新しい車両である\n(B) バスは5番目に新しい車両である\n(C) リムジンは5番目に新しい車両である\n(D) トラックは5番目に新しい車両である\n(E) オープンカーは5番目に新しい車両である\n(F) トラクターは5番目に新しい車両である\n(G) オートバイは5番目に新しい車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：オートバイ、セダン、ステーションワゴン、トラクター、ミニバン、バス、トラックです。オートバイはミニバンよりも古い車両です。ミニバンはトラクターよりも古い車両です。バスはトラックよりも新しい車両です。ステーションワゴンは最も新しい車両から3番目です。セダンはトラックよりも古い車両です。トラクターはセダンよりも古い車両です。\n選択肢:\n(A) オートバイが最も新しい車両から3番目である\n(B) セダンが最も新しい車両から3番目である\n(C) ステーションワゴンが最も新しい車両から3番目である\n(D) トラクターが最も新しい車両から3番目である\n(E) ミニバンが最も新しい車両から3番目である\n(F) バスが最も新しい車両から3番目である\n(G) トラックが最も新しい車両から3番目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラック、ハッチバック、ミニバン、バス、トラクター、ステーションワゴン、オープンカーの7台の車両が展示されています。ステーションワゴンは最も新しい車両から4番目です。ミニバンは最も新しい車両から3番目です。トラクターは最も古い車両から2番目です。オープンカーはステーションワゴンよりも古い車両です。トラックはバスよりも新しい車両です。ハッチバックはオープンカーよりも古い車両です。\n選択肢:\n(A) トラックは最も新しい車両から3番目である\n(B) ハッチバックは最も新しい車両から3番目である\n(C) ミニバンは最も新しい車両から3番目である\n(D) バスは最も新しい車両から3番目である\n(E) トラクターは最も新しい車両から3番目である\n(F) ステーションワゴンは最も新しい車両から3番目である\n(G) オープンカーは最も新しい車両から3番目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、アダ、エイミー、アナ、イブ、メル、ダン――がいました。アダはメルよりも上位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。エイミーが最下位でフィニッシュしました。アナは3番目に下位でフィニッシュしました。ダンはエリよりも下位でフィニッシュしました。イブは3位でフィニッシュしました。\n選択肢:\n(A) エリが2番目に下位でフィニッシュした\n(B) アダが2番目に下位でフィニッシュした\n(C) エイミーが2番目に下位でフィニッシュした\n(D) アナが2番目に下位でフィニッシュした\n(E) イブが2番目に下位でフィニッシュした\n(F) メルが2番目に下位でフィニッシュした\n(G) ダンが2番目に下位でフィニッシュした", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黒い本、オレンジ色の本、黄色い本、白い本、青い本、赤い本、緑の本です。赤い本は黄色い本の右側にあります。白い本は右側から2冊目です。赤い本は緑の本の左側にあります。青い本は黒い本の右側にあります。黒い本は右側から3冊目です。オレンジ色の本は最も左側にあります。\n選択肢:\n(A) 黒い本は左から2冊目である\n(B) オレンジ色の本は左から2冊目である\n(C) 黄色い本は左から2冊目である\n(D) 白い本は左から2冊目である\n(E) 青い本は左から2冊目である\n(F) 赤い本は左から2冊目である\n(G) 緑の本は左から2冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：リムジン、ミニバン、バス、ステーションワゴン、トラクター、トラック、ハッチバックです。この中でトラックが最も古い車両です。トラクターはミニバンよりも古い車両です。ミニバンは3番目に新しい車両です。リムジンは4番目に新しい車両です。ステーションワゴンはハッチバックよりも新しい車両です。バスは2番目に古い車両です。\n選択肢:\n(A) リムジンが3番目に古い車両である\n(B) ミニバンが3番目に古い車両である\n(C) バスが3番目に古い車両である\n(D) ステーションワゴンが3番目に古い車両である\n(E) トラクターが3番目に古い車両である\n(F) トラックが3番目に古い車両である\n(G) ハッチバックが3番目に古い車両である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ウズラ、ワタリガラス、ハチドリ、コマドリ、ハヤブサ、フクロウ、アオカケスです。アオカケスはハヤブサの左側にあります。アオカケスは右側から2番目の位置です。ワタリガラスはコマドリの左側にあります。フクロウは右側から3番目の位置です。ハチドリはウズラの左側にあります。ワタリガラスは左側から3番目の位置です。\n選択肢:\n(A) ウズラは左側から3番目の位置にある\n(B) ワタリガラスは左側から3番目の位置にある\n(C) ハチドリは左側から3番目の位置にある\n(D) コマドリは左側から3番目の位置にある\n(E) ハヤブサは左側から3番目の位置にある\n(F) フクロウは左側から3番目の位置にある\n(G) アオカケスは左側から3番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、エイダ、エイミー、ロブ、ミア、メル――がいました。エイダはエイミーよりも下位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。ダンはエイダよりも下位でフィニッシュしました。メルは3番目に下位でフィニッシュしました。エイミーは3位でフィニッシュしました。ロブはミアよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが4位でフィニッシュした\n(B) ダンが4位でフィニッシュした\n(C) エイダが4位でフィニッシュした\n(D) エイミーが4位でフィニッシュした\n(E) ロブが4位でフィニッシュした\n(F) ミアが4位でフィニッシュした\n(G) メルが4位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、ハヤブサ、ワタリガラス、カラス、コマドリ、フクロウ、ハチドリです。コマドリはフクロウの左側にあります。カラスは最も右側に位置しています。ハチドリは左から4番目です。フクロウは右から3番目です。アオカケスはコマドリの左側にあります。ワタリガラスは左から2番目です。\n選択肢:\n(A) アオカケスは右から2番目に位置する\n(B) ハヤブサは右から2番目に位置する\n(C) ワタリガラスは右から2番目に位置する\n(D) カラスは右から2番目に位置する\n(E) コマドリは右から2番目に位置する\n(F) フクロウは右から2番目に位置する\n(G) ハチドリは右から2番目に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、ハヤブサ、ワタリガラス、カラス、コマドリ、フクロウ、ハチドリです。コマドリはフクロウの左側にあります。カラスは最も右側に位置しています。ハチドリは左から4番目です。フクロウは右側から3番目です。アオカケスはコマドリの左側にあります。ワタリガラスは左から2番目です。\n選択肢:\n(A) アオカケスは左から3番目に位置する\n(B) ハヤブサは左から3番目に位置する\n(C) ワタリガラスは左から3番目に位置する\n(D) カラスは左から3番目に位置する\n(E) コマドリは左から3番目に位置する\n(F) フクロウは左から3番目に位置する\n(G) ハチドリは左から3番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、緑色の本、灰色の本、紫色の本、黒色の本、黄色の本、白色の本です。オレンジ色の本は灰色の本の右側にあります。黄色の本は右側から3冊目です。紫色の本は左側から2冊目です。黄色の本はオレンジ色の本の右側にあります。白色の本は右側から2冊目です。黒色の本は最も左側にあります。\n選択肢:\n(A) オレンジ色の本が最も左側にある\n(B) 緑色の本が最も左側にある\n(C) 灰色の本が最も左側にある\n(D) 紫色の本が最も左側にある\n(E) 黒色の本が最も左側にある\n(F) 黄色の本が最も左側にある\n(G) 白色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ミア、ロブ、アナ、アダ、メル、ジョー――がいました。イブは3位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。ミアはロブよりも上位でフィニッシュしました。メルはジョーよりも下位でフィニッシュしました。ミアは2位でフィニッシュしました。アダは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) イブが3位でフィニッシュした\n(B) ミアが3位でフィニッシュした\n(C) ロブが3位でフィニッシュした\n(D) アナが3位でフィニッシュした\n(E) アダが3位でフィニッシュした\n(F) メルが3位でフィニッシュした\n(G) ジョーが3位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：オープンカー、リムジン、ハッチバック、バス、ステーションワゴン、トラクター、ミニバンです。ステーションワゴンは最も新しい車両から4番目です。ハッチバックはバスよりも古い車両です。ハッチバックは最も新しい車両から2番目です。ミニバンはリムジンよりも新しい車両です。オープンカーはリムジンよりも古い車両です。トラクターは最も新しい車両から2番目です。\n選択肢:\n(A) オープンカーは最も新しい車両から2番目である\n(B) リムジンは最も新しい車両から2番目である\n(C) ハッチバックは最も新しい車両から2番目である\n(D) バスは最も新しい車両から2番目である\n(E) ステーションワゴンは最も新しい車両から2番目である\n(F) トラクターは最も新しい車両から2番目である\n(G) ミニバンは最も新しい車両から2番目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：鷹、ワタリガラス、ハチドリ、ハヤブサ、フクロウ、鶉、コウヨウチョウです。鶉はハチドリの左側にあります。ワタリガラスはハチドリの右側に位置しています。コウヨウチョウは左から2番目です。フクロウはコウヨウチョウの左側にいます。ワタリガラスは右から3番目です。ハヤブサは最も右側に位置しています。\n選択肢:\n(A) 鷹が最も左側にある\n(B) ワタリガラスが最も左側にある\n(C) ハチドリが最も左側にある\n(D) ハヤブサが最も左側にある\n(E) フクロウが最も左側にある\n(F) 鶉が最も左側にある\n(G) コウヨウチョウが最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、ステーションワゴン、リムジン、トラック、ミニバン、オートバイ、ハッチバック、バスの7台の車両が展示されています。オートバイはトラックよりも古い年式です。ステーションワゴンはハッチバックよりも古い年式です。オートバイはハッチバックよりも新しい年式です。バスは最も新しい年式の車両です。ミニバンは最も古い年式の車両です。リムジンはステーションワゴンよりも古い年式です。\n選択肢:\n(A) ステーションワゴンは3番目に古い年式である\n(B) リムジンは3番目に古い年式である\n(C) トラックは3番目に古い年式である\n(D) ミニバンは3番目に古い年式である\n(E) オートバイは3番目に古い年式である\n(F) ハッチバックは3番目に古い年式である\n(G) バスは3番目に古い年式である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エイミー、イブ、エイダ、ロブ、ダン、メル、ジョー――がいました。ジョーは3位でフィニッシュしました。ダンが最下位でフィニッシュしました。イブが1位でフィニッシュしました。メルはロブよりも下位でフィニッシュしました。エイダはジョーよりも上位でフィニッシュしました。ロブは下から3番目の順位でフィニッシュしました。\n選択肢:\n(A) エイミーが1位でフィニッシュした\n(B) イブが1位でフィニッシュした\n(C) エイダが1位でフィニッシュした\n(D) ロブが1位でフィニッシュした\n(E) ダンが1位でフィニッシュした\n(F) メルが1位でフィニッシュした\n(G) ジョーが1位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋台では7種類の果物――マンゴー、キウイ、オレンジ、スイカ、リンゴ、ナシ、ビワ――を販売しています。ビワはオレンジよりも安価です。オレンジは価格が3番目に高い果物です。リンゴは最も安価な果物です。キウイはナシよりも高価です。マンゴーはスイカよりも高価です。ビワはキウイよりも高価です。\n選択肢:\n(A) マンゴーは価格が3番目に高い\n(B) キウイは価格が3番目に高い\n(C) オレンジは価格が3番目に高い\n(D) スイカは価格が3番目に高い\n(E) リンゴは価格が3番目に高い\n(F) ナシは価格が3番目に高い\n(G) ビワは価格が3番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、アナ、ロブ、エイミー、ダン、ジョー、エリ――がいました。エリはエイミーよりも下位でフィニッシュしました。アダは3位でフィニッシュしました。エイミーはロブよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。ロブは2位でフィニッシュしました。アナは4位でフィニッシュしました。\n選択肢:\n(A) アダが2位でフィニッシュした\n(B) アナが2位でフィニッシュした\n(C) ロブが2位でフィニッシュした\n(D) エイミーが2位でフィニッシュした\n(E) ダンが2位でフィニッシュした\n(F) ジョーが2位でフィニッシュした\n(G) エリが2位でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――マンゴー、スイカ、桃、キウイ、オレンジ、カンタロープメロン、プラム――を販売しています。スイカが最も安価です。桃はマンゴーよりも高価です。カンタロープメロンは2番目に高価な果物です。オレンジはカンタロープメロンよりも高価です。桃はプラムよりも安価です。キウイは3番目に安価な果物です。\n選択肢:\n(A) マンゴーは2番目に高価な果物である\n(B) スイカは2番目に高価な果物である\n(C) 桃は2番目に高価な果物である\n(D) キウイは2番目に安価な果物である\n(E) オレンジは2番目に高価な果物である\n(F) カンタロープメロンは2番目に高価な果物である\n(G) プラムは2番目に安価な果物である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コマドリ、ハチドリ、ワタリガラス、アオカケス、カラス、ショウジョウコウカンチョウ、ウズラです。ハチドリはカラスの左側にあります。ショウジョウコウカンチョウはウズラの右側にあります。アオカケスは左から4番目の位置にあります。コマドリは左から2番目の位置にあります。ウズラはカラスの右側にあります。ワタリガラスはコマドリの左側にあります。\n選択肢:\n(A) コマドリが最も左側に位置する\n(B) ハチドリが最も左側に位置する\n(C) ワタリガラスが最も左側に位置する\n(D) アオカケスが最も左側に位置する\n(E) カラスが最も左側に位置する\n(F) ショウジョウコウカンチョウが最も左側に位置する\n(G) ウズラが最も左側に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ジョウビタキ、アオカケス、コマドリ、カラス、ノスリ、タカ、ワタリガラスです。ノスリは右側から2番目の位置にあります。ワタリガラスは左側から4番目の位置にあります。コマドリは左側から2番目の位置にあります。ジョウビタキはワタリガラスの左側にあります。タカはコマドリの左側にあります。カラスはアオカケスの右側に位置しています。\n選択肢:\n(A) ジョウビタキは左側から3番目の位置にある\n(B) アオカケスは左側から3番目の位置にある\n(C) コマドリは左側から3番目の位置にある\n(D) カラスは左側から3番目の位置にある\n(E) ノスリは左側から3番目の位置にある\n(F) タカは左側から3番目の位置にある\n(G) ワタリガラスは左側から3番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、緑色の本、赤色の本、灰色の本、紫色の本、青色の本、茶色の本です。紫色の本は左から4冊目に位置しています。茶色の本は左から3冊目です。緑色の本は青色の本の左側に配置されています。赤色の本は最も左側にあります。灰色の本は右から3冊目です。オレンジ色の本は最も右側に位置しています。\n選択肢:\n(A) オレンジ色の本が最も左側にある\n(B) 緑色の本が最も左側にある\n(C) 赤色の本が最も左側にある\n(D) 灰色の本が最も左側にある\n(E) 紫色の本が最も左側にある\n(F) 青色の本が最も左側にある\n(G) 茶色の本が最も左側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、イブ、メル、エイミー、ミャ、ダン、ロブ――がいました。エイミーはダンよりも上位でフィニッシュしました。ロブは3位でフィニッシュしました。メルはロブよりも下位でフィニッシュしました。ダンは2位と最下位の間の順位でフィニッシュしました。イブはエイミーよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーは4位でフィニッシュしました。\n選択肢:\n(A) ジョーが4位でフィニッシュした\n(B) イブが4位でフィニッシュした\n(C) メルが4位でフィニッシュした\n(D) エイミーが4位でフィニッシュした\n(E) ミャが4位でフィニッシュした\n(F) ダンが4位でフィニッシュした\n(G) ロブが4位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ミャ、エリ、アナ、エイミー、メル、ダン、ジョー――がいました。エイミーはジョーよりも下位でフィニッシュしました。ダンはミャよりも上位でフィニッシュしました。エリは3位でフィニッシュしました。アナが1位でフィニッシュしました。エイミーは最下位から2番目でフィニッシュしました。ミャは4位でフィニッシュしました。\n選択肢:\n(A) ミャが最下位でフィニッシュした\n(B) エリが最下位でフィニッシュした\n(C) アナが最下位でフィニッシュした\n(D) エイミーが最下位でフィニッシュした\n(E) メルが最下位でフィニッシュした\n(F) ダンが最下位でフィニッシュした\n(G) ジョーが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、カンタロープメロン、オレンジ、ビワ、梨、スイカ、桃――を販売しています。ビワは桃よりも安価です。梨は価格が3番目に安い果物です。オレンジはカンタロープメロンよりも安価です。ビワはスイカよりも高価です。桃はオレンジよりも安価です。キウイは価格が2番目に高い果物です。\n選択肢:\n(A) キウイが最も安価である\n(B) カンタロープメロンが最も安価である\n(C) オレンジが最も安価である\n(D) ビワが最も安価である\n(E) 梨が最も安価である\n(F) スイカが最も安価である\n(G) 桃が最も安価である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：アオカケス、ハヤブサ、ワタリガラス、カラス、コマドリ、フクロウ、ハチドリです。コマドリはフクロウの左側にあります。カラスは最も右側に位置しています。ハチドリは左から4番目です。フクロウは右側から3番目です。アオカケスはコマドリの左側にあります。ワタリガラスは左から2番目です。\n選択肢:\n(A) アオカケスは左から4番目に位置する\n(B) ハヤブサは左から4番目に位置する\n(C) ワタリガラスは左から4番目に位置する\n(D) カラスは左から4番目に位置する\n(E) コマドリは左から4番目に位置する\n(F) フクロウは左から4番目に位置する\n(G) ハチドリは左から4番目に位置する", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：リムジン、オープンカー、ステーションワゴン、ミニバン、バス、トラクター、トラックです。この中でミニバンが最も古い車両です。トラックはステーションワゴンよりも古く、リムジンよりも新しい車両です。バスはオープンカーよりも新しく、トラクターよりも古い車両です。リムジンはトラクターよりも新しい車両です。\n選択肢:\n(A) リムジンは4番目に新しい車両である\n(B) オープンカーは4番目に新しい車両である\n(C) ステーションワゴンは4番目に新しい車両である\n(D) ミニバンは4番目に新しい車両である\n(E) バスは4番目に新しい車両である\n(F) トラクターは4番目に新しい車両である\n(G) トラックは4番目に新しい車両である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：シジュウカラ、フクロウ、ウズラ、ハヤブサ、ハチドリ、ショウジョウコウカンチョウ、カラスです。ハチドリはハヤブサの左側にあります。カラスはショウジョウコウカンチョウの右側にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。ウズラは右側から3番目の位置にあります。ハヤブサはシジュウカラの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) シジュウカラは右側から2番目の位置にある\n(B) フクロウは右側から2番目の位置にある\n(C) ウズラは右側から2番目の位置にある\n(D) ハヤブサは右側から2番目の位置にある\n(E) ハチドリは右側から2番目の位置にある\n(F) ショウジョウコウカンチョウは右側から2番目の位置にある\n(G) カラスは右側から2番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、アナ、メル、アダ、イブ、エイミー――がいました。イブはエイミーよりも上位でフィニッシュしました。ダンは2位でフィニッシュしました。アダはアナよりも下位でフィニッシュしました。アナは3位と最下位の間の順位でフィニッシュしました。メルが最下位でフィニッシュしました。エイミーは3位でフィニッシュしました。\n選択肢:\n(A) ジョーが4位でフィニッシュした\n(B) ダンが4位でフィニッシュした\n(C) アナが4位でフィニッシュした\n(D) メルが4位でフィニッシュした\n(E) アダが4位でフィニッシュした\n(F) イブが4位でフィニッシュした\n(G) エイミーが4位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――オレンジ、スイカ、桃、梨、キウイ、カンタロープメロン、プラム――を販売しています。キウイは価格が2番目に安い果物です。プラムは最も安い果物です。カンタロープメロンはスイカよりも安価です。オレンジは最も高価な果物です。梨は価格が3番目に安い果物です。桃は価格が3番目に高い果物です。\n選択肢:\n(A) オレンジは価格が2番目に高い\n(B) スイカは価格が2番目に高い\n(C) 桃は価格が2番目に高い\n(D) 梨は価格が2番目に高い\n(E) キウイは価格が2番目に高い\n(F) カンタロープメロンは価格が2番目に高い\n(G) プラムは価格が2番目に高い", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――キウイ、ビワ、梨、桃、マンゴー、プラム、リンゴ――を販売しています。ビワは価格が4番目に高い果物です。桃はマンゴーよりも安価です。リンゴは梨よりも高価です。桃は価格が2番目に高い果物です。プラムは最も安価な果物です。梨はキウイよりも高価です。\n選択肢:\n(A) キウイは価格が3番目に高い\n(B) ビワは価格が3番目に高い\n(C) 梨は価格が3番目に高い\n(D) 桃は価格が3番目に高い\n(E) マンゴーは価格が3番目に高い\n(F) プラムは価格が3番目に高い\n(G) リンゴは価格が3番目に高い", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、エイミー、エリ、ロブ、ジョー、イブ、アナ――がいました。ロブは2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。ジョーはアダよりも上位でフィニッシュしました。ジョーはイブよりも下位でフィニッシュしました。アダはアナよりも上位でフィニッシュしました。エリは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) アダが最下位から2番目でフィニッシュした\n(B) エイミーが最下位から2番目でフィニッシュした\n(C) エリが最下位から2番目でフィニッシュした\n(D) ロブが最下位から2番目でフィニッシュした\n(E) ジョーが最下位から2番目でフィニッシュした\n(F) イブが最下位から2番目でフィニッシュした\n(G) アナが最下位から2番目でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アナ、ロブ、イブ、メル、ミア、ジョー、エリ――がいました。ジョーは2番目に下位でフィニッシュしました。エリが1位でフィニッシュしました。ミアはジョーよりも下位でフィニッシュしました。メルは2位でフィニッシュしました。ロブは3番目に下位でフィニッシュしました。アナは3位でフィニッシュしました。\n選択肢:\n(A) アナが4位でフィニッシュした\n(B) ロブが4位でフィニッシュした\n(C) イブが4位でフィニッシュした\n(D) メルが4位でフィニッシュした\n(E) ミアが4位でフィニッシュした\n(F) ジョーが4位でフィニッシュした\n(G) エリが4位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――アダ、アナ、ロブ、エイミー、ダン、ジョー、エリ――がいました。エリはエイミーよりも下位でフィニッシュしました。アダは3位でフィニッシュしました。エイミーはロブよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。ロブは2位でフィニッシュしました。アナは4位でフィニッシュしました。\n選択肢:\n(A) アダが4位でフィニッシュした\n(B) アナが4位でフィニッシュした\n(C) ロブが4位でフィニッシュした\n(D) エイミーが4位でフィニッシュした\n(E) ダンが4位でフィニッシュした\n(F) ジョーが4位でフィニッシュした\n(G) エリが4位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：プラム、キウイ、カンタロープメロン、梨、スイカ、リンゴ、ビワです。スイカはカンタロープメロンよりも高価です。リンゴはカンタロープメロンよりも安価です。スイカは価格が2番目に高い果物です。ビワはキウイよりも安価です。リンゴはビワよりも高価です。ビワは価格が3番目に安い果物です。プラムは最も安価な果物です。\n選択肢:\n(A) プラムは価格が2番目に安い\n(B) キウイは価格が2番目に安い\n(C) カンタロープメロンは価格が2番目に安い\n(D) 梨は価格が2番目に安い\n(E) スイカは価格が2番目に安い\n(F) リンゴは価格が2番目に安い\n(G) ビワは価格が2番目に安い", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物を販売しています：スイカ、オレンジ、マンゴー、カンタロープメロン、キウイ、梨、桃です。梨は最も安価な2番目の果物です。桃はカンタロープメロンよりも高価です。桃はマンゴーよりも安価です。カンタロープメロンはキウイよりも高価です。オレンジは最も高価な4番目の果物です。スイカは最も高価な2番目の果物です。\n選択肢:\n(A) スイカは最も高価な2番目の果物である\n(B) オレンジは最も高価な2番目の果物である\n(C) マンゴーは最も高価な2番目の果物である\n(D) カンタロープメロンは最も高価な2番目の果物である\n(E) キウイは最も高価な2番目の果物である\n(F) 梨は最も高価な2番目の果物である\n(G) 桃は最も高価な2番目の果物である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ロブ、エリ、ダン、ミア、アダ、アナ――がいました。ジョーはアナよりも上位でフィニッシュしました。アナは最下位から2番目でフィニッシュしました。ミアは4位でフィニッシュしました。ダンは3位でフィニッシュしました。アダは2位でフィニッシュしました。エリは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) ジョーが最下位から2番目でフィニッシュした\n(B) ロブが最下位から2番目でフィニッシュした\n(C) エリが最下位から2番目でフィニッシュした\n(D) ダンが最下位から2番目でフィニッシュした\n(E) ミアが最下位から2番目でフィニッシュした\n(F) アダが最下位から2番目でフィニッシュした\n(G) アナが最下位から2番目でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、7台の車両が展示されていました：オープンカー、トラック、トラクター、リムジン、オートバイ、ハッチバック、セダンです。ハッチバックは7台中4番目に新しいモデルです。リムジンはオートバイよりも古いモデルです。トラックはオートバイよりも新しいモデルです。セダンは7台中2番目に新しいモデルです。トラクターはオープンカーよりも新しいモデルです。ハッチバックはオープンカーよりも古いモデルです。\n選択肢:\n(A) オープンカーは7台中3番目に古いモデルである\n(B) トラックは7台中3番目に古いモデルである\n(C) トラクターは7台中3番目に古いモデルである\n(D) リムジンは7台中3番目に古いモデルである\n(E) オートバイは7台中3番目に古いモデルである\n(F) ハッチバックは7台中3番目に古いモデルである\n(G) セダンは7台中3番目に古いモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ロブ、エリ、ダン、ミア、アダ、アナ――がいました。ジョーはアナよりも上位でフィニッシュしました。アナは最下位から2番目でフィニッシュしました。ミアは4位でフィニッシュしました。ダンは3位でフィニッシュしました。アダは2位でフィニッシュしました。エリは最下位から3番目でフィニッシュしました。\n選択肢:\n(A) ジョーが最下位から3番目でフィニッシュした\n(B) ロブが最下位から3番目でフィニッシュした\n(C) エリが最下位から3番目でフィニッシュした\n(D) ダンが最下位から3番目でフィニッシュした\n(E) ミアが最下位から3番目でフィニッシュした\n(F) アダが最下位から3番目でフィニッシュした\n(G) アナが最下位から3番目でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、赤色の本、緑色の本、白色の本、紫色の本、茶色の本、黄色の本です。緑色の本は紫色の本の左側にあります。白色の本はオレンジ色の本の右側にあります。緑色の本は茶色の本の右側にあります。黄色の本は白色の本の右側にあります。赤色の本は黄色の本の右側にあります。茶色の本は赤色の本の右側にあります。\n選択肢:\n(A) オレンジ色の本は左から4冊目である\n(B) 赤色の本は左から4冊目である\n(C) 緑色の本は左から4冊目である\n(D) 白色の本は左から4冊目である\n(E) 紫色の本は左から4冊目である\n(F) 茶色の本は左から4冊目である\n(G) 黄色の本は左から4冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：リムジン、ミニバン、バス、ステーションワゴン、トラクター、トラック、ハッチバックです。この中でトラックが最も古い車両です。トラクターはミニバンよりも古い車両です。ミニバンは3番目に新しい車両です。リムジンは4番目に新しい車両です。ステーションワゴンはハッチバックよりも新しい車両です。バスは2番目に古い車両です。\n選択肢:\n(A) リムジンが3番目に新しい車両である\n(B) ミニバンが3番目に新しい車両である\n(C) バスが3番目に新しい車両である\n(D) ステーションワゴンが3番目に新しい車両である\n(E) トラクターが3番目に新しい車両である\n(F) トラックが3番目に新しい車両である\n(G) ハッチバックが3番目に新しい車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋台では、7種類の果物――ビワ、スイカ、オレンジ、キウイ、リンゴ、プラム、モモ――を販売しています。プラムが最も安価です。スイカは価格が3番目に高い部類に入ります。リンゴはオレンジよりも高価です。キウイが最も高価です。リンゴはモモよりも安価です。ビワは価格が3番目に安い部類に入ります。\n選択肢:\n(A) ビワは価格が4番目に高い\n(B) スイカは価格が4番目に高い\n(C) オレンジは価格が4番目に高い\n(D) キウイは価格が4番目に高い\n(E) リンゴは価格が4番目に高い\n(F) プラムは価格が4番目に高い\n(G) モモは価格が4番目に高い", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ロブ、エリ、ダン、ミア、アダ、アナ――がいました。ジョーはアナよりも上位でフィニッシュしました。アナは2番目に下位でフィニッシュしました。ミアは4位でフィニッシュしました。ダンは3位でフィニッシュしました。アダは2位でフィニッシュしました。エリは3番目に下位でフィニッシュしました。\n選択肢:\n(A) ジョーが4位でフィニッシュした\n(B) ロブが4位でフィニッシュした\n(C) エリが4位でフィニッシュした\n(D) ダンが4位でフィニッシュした\n(E) ミアが4位でフィニッシュした\n(F) アダが4位でフィニッシュした\n(G) アナが4位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：バス、オートバイ、ハッチバック、ステーションワゴン、ミニバン、トラック、リムジンです。ステーションワゴンは最も新しい車両から4番目です。オートバイはトラックよりも新しい車両です。ステーションワゴンはハッチバックよりも古い車両です。ミニバンはハッチバックよりも新しい車両です。バスはミニバンよりも新しい車両です。トラックはリムジンよりも新しい車両です。\n選択肢:\n(A) バスが最も新しい車両から3番目である\n(B) オートバイが最も新しい車両から3番目である\n(C) ハッチバックが最も新しい車両から3番目である\n(D) ステーションワゴンが最も新しい車両から3番目である\n(E) ミニバンが最も新しい車両から3番目である\n(F) トラックが最も新しい車両から3番目である\n(G) リムジンが最も新しい車両から3番目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ウズラ、ワタリガラス、ハチドリ、コマドリ、ハヤブサ、フクロウ、アオカケスです。アオカケスはハヤブサの左側にあります。アオカケスは右側から2番目の位置です。ワタリガラスはコマドリの左側にあります。フクロウは右側から3番目の位置です。ハチドリはウズラの左側にあります。ワタリガラスは左側から3番目の位置です。\n選択肢:\n(A) ウズラは右側から2番目の位置にある\n(B) ワタリガラスは右側から2番目の位置にある\n(C) ハチドリは右側から2番目の位置にある\n(D) コマドリは右側から2番目の位置にある\n(E) ハヤブサは右側から2番目の位置にある\n(F) フクロウは右側から2番目の位置にある\n(G) アオカケスは右側から2番目の位置にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物――ビワ、スイカ、オレンジ、キウイ、リンゴ、プラム、モモ――を販売しています。プラムが最も安価です。スイカは価格が3番目に高い果物です。リンゴはオレンジよりも高価です。キウイが最も高価です。リンゴはモモよりも安価です。ビワは価格が3番目に安い果物です。\n選択肢:\n(A) ビワは2番目に安価な果物である\n(B) スイカは2番目に安価な果物である\n(C) オレンジは2番目に安価な果物である\n(D) キウイは2番目に高価な果物である\n(E) リンゴは2番目に安価な果物である\n(F) プラムは2番目に安価な果物である\n(G) モモは2番目に安価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：鷹、ワタリガラス、ハチドリ、ハヤブサ、フクロウ、ウズラ、コウヨウチョウです。ウズラはハチドリの左側にあります。ワタリガラスはハチドリの右側に位置しています。コウヨウチョウは左から2番目です。フクロウはコウヨウチョウの左側にあります。ワタリガラスは右から3番目です。ハヤブサは最も右側に位置しています。\n選択肢:\n(A) 鷹が最も右側にある\n(B) ワタリガラスが最も右側にある\n(C) ハチドリが最も右側にある\n(D) ハヤブサが最も右側にある\n(E) フクロウが最も右側にある\n(F) ウズラが最も右側にある\n(G) コウヨウチョウが最も右側にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されていました：貨物自動車、オートバイ、セダン、ミニバン、ステーションワゴン、ハッチバック、トラクターです。ハッチバックは貨物自動車よりも新しいモデルです。セダンは7台中3番目に新しいモデルです。ステーションワゴンは最も新しいモデルです。オートバイは貨物自動車よりも古いモデルです。ミニバンはセダンよりも新しいモデルです。トラクターは7台中3番目に古いモデルです。\n選択肢:\n(A) 貨物自動車が最も新しいモデルである\n(B) オートバイが最も新しいモデルである\n(C) セダンが最も新しいモデルである\n(D) ミニバンが最も新しいモデルである\n(E) ステーションワゴンが最も新しいモデルである\n(F) ハッチバックが最も新しいモデルである\n(G) トラクターが最も新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ノスリ、ワタリガラス、ハヤブサ、カラス、ハチドリ、コマドリ、ショウジョウコウカンチョウです。ノスリは右側から2番目の位置にあります。コマドリはワタリガラスの左側にあります。ワタリガラスはカラスの左側にあります。ハヤブサはショウジョウコウカンチョウの左側にあります。ハチドリは左側から2番目の位置にあります。ハヤブサは右側から3番目の位置にあります。\n選択肢:\n(A) ノスリは左側から3番目の位置にある\n(B) ワタリガラスは左側から3番目の位置にある\n(C) ハヤブサは左側から3番目の位置にある\n(D) カラスは左側から3番目の位置にある\n(E) ハチドリは左側から3番目の位置にある\n(F) コマドリは左側から3番目の位置にある\n(G) ショウジョウコウカンチョウは左側から3番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黄色の本、茶色の本、白色の本、オレンジ色の本、黒色の本、青色の本、紫色の本です。黒色の本は左から2冊目に位置しています。白色の本はオレンジ色の本の右側にあります。黒色の本は茶色の本の右側に位置しています。黄色の本は右から3冊目です。紫色の本は左から3冊目です。オレンジ色の本は右から2冊目に位置しています。\n選択肢:\n(A) 黄色の本は右から2冊目である\n(B) 茶色の本は右から2冊目である\n(C) 白色の本は右から2冊目である\n(D) オレンジ色の本は右から2冊目である\n(E) 黒色の本は右から2冊目である\n(F) 青色の本は右から2冊目である\n(G) 紫色の本は右から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：セダン、貨物自動車、バス、ステーションワゴン、トラクター、オープンカー、リムジンです。この中で貨物自動車が最も古い車両です。トラクターが最も新しい車両です。セダンはステーションワゴンよりも古い車両です。ステーションワゴンは7台中3番目に新しい車両です。バスはオープンカーよりも古い車両です。セダンはオープンカーよりも新しい車両です。\n選択肢:\n(A) セダンが最も新しい車両である\n(B) 貨物自動車が最も新しい車両である\n(C) バスが最も新しい車両である\n(D) ステーションワゴンが最も新しい車両である\n(E) トラクターが最も新しい車両である\n(F) オープンカーが最も新しい車両である\n(G) リムジンが最も新しい車両である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されていました：ステーションワゴン、トラック、セダン、リムジン、オープンカー、バス、ハッチバックです。リムジンが最も新しい車両です。バスは3番目に新しい車両です。バスはオープンカーよりも古い車両です。セダンは3番目に古い車両です。ステーションワゴンはトラックよりも古い車両です。ハッチバックが最も古い車両です。\n選択肢:\n(A) ステーションワゴンは4番目に新しい車両である\n(B) トラックは4番目に新しい車両である\n(C) セダンは4番目に新しい車両である\n(D) リムジンは4番目に新しい車両である\n(E) オープンカーは4番目に新しい車両である\n(F) バスは4番目に新しい車両である\n(G) ハッチバックは4番目に新しい車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：カラス、ハチドリ、コマドリ、クロウタドリ、ウズラ、アオカケス、ショウジョウコウカンチョウです。ハチドリはカラスの左側にあります。ウズラはカラスの右側にあります。カラスはコマドリの左側にあります。アオカケスは右側から4番目の位置にあります。ショウジョウコウカンチョウは最も左側にあります。ハチドリは左側から4番目の位置にあります。\n選択肢:\n(A) カラスは左側から4番目の位置にある\n(B) ハチドリは左側から4番目の位置にある\n(C) コマドリは左側から4番目の位置にある\n(D) カラスは左側から4番目の位置にある\n(E) ウズラは左側から4番目の位置にある\n(F) アオカケスは左側から4番目の位置にある\n(G) ショウジョウコウカンチョウは左側から4番目の位置にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：シジュウカラ、フクロウ、ウズラ、ハヤブサ、ハチドリ、ショウジョウコウカンチョウ、カラスです。ハチドリはハヤブサの左側にあります。カラスはショウジョウコウカンチョウの右側にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。ウズラは右側から3番目の位置にあります。ハヤブサはシジュウカラの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) シジュウカラが最も右側に位置する\n(B) フクロウが最も右側に位置する\n(C) ウズラが最も右側に位置する\n(D) ハヤブサが最も右側に位置する\n(E) ハチドリが最も右側に位置する\n(F) ショウジョウコウカンチョウが最も右側に位置する\n(G) カラスが最も右側に位置する", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、ミニバン、バス、ステーションワゴン、トラクター、トラック、ハッチバックです。この中でトラックが最も古い車両です。トラクターはミニバンよりも古い車両です。ミニバンは7台中3番目に新しい車両です。リムジンは7台中4番目に新しい車両です。ステーションワゴンはハッチバックよりも新しい車両です。バスは7台中2番目に古い車両です。\n選択肢:\n(A) リムジンが7台中4番目に新しい車両である\n(B) ミニバンが7台中4番目に新しい車両である\n(C) バスが7台中4番目に古い車両である\n(D) ステーションワゴンが7台中4番目に新しい車両である\n(E) トラクターが7台中4番目に古い車両である\n(F) トラックが7台中4番目に古い車両である\n(G) ハッチバックが7台中4番目に新しい車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：コマドリ、フクロウ、ウズラ、ハヤブサ、ハチドリ、ショウジョウコウカンチョウ、カラスです。ハチドリはハヤブサの左側にあります。カラスはショウジョウコウカンチョウの右側にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。ウズラは右側から3番目の位置にあります。ハヤブサはコマドリの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) コマドリは左側から3番目の位置にある\n(B) フクロウは左側から3番目の位置にある\n(C) ウズラは左側から3番目の位置にある\n(D) ハヤブサは左側から3番目の位置にある\n(E) ハチドリは左側から3番目の位置にある\n(F) ショウジョウコウカンチョウは左側から3番目の位置にある\n(G) カラスは左側から3番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物を販売しています：カンタロープ、プラム、マンゴー、リンゴ、ビワ、ナシ、モモです。リンゴはカンタロープよりも安価です。リンゴはモモよりも高価です。マンゴーは最も高価な4番目の果物です。モモはプラムよりも高価です。ナシは最も高価な3番目の果物です。ビワは最も安価な3番目の果物です。\n選択肢:\n(A) カンタロープが最も安価である\n(B) プラムが最も安価である\n(C) マンゴーが最も安価である\n(D) リンゴが最も安価である\n(E) ビワが最も安価である\n(F) ナシが最も安価である\n(G) モモが最も安価である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――プラム、キウイ、カンタロープメロン、梨、スイカ、リンゴ、ビワ――を販売しています。スイカはカンタロープメロンよりも高価です。リンゴはカンタロープメロンよりも安価です。スイカは価格が2番目に高い果物です。ビワはキウイよりも安価です。リンゴはビワよりも高価です。ビワは価格が3番目に安い果物です。プラムは最も安価な果物です。\n選択肢:\n(A) プラムが最も安価である\n(B) キウイが最も安価である\n(C) カンタロープメロンが最も安価である\n(D) 梨が最も安価である\n(E) スイカが最も安価である\n(F) リンゴが最も安価である\n(G) ビワが最も安価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、ダン、アナ、メル、アダ、イブ、エイミー――がいました。イブはエイミーよりも上位でフィニッシュしました。ダンは2位でフィニッシュしました。アダはアナよりも下位でフィニッシュしました。アナは準決勝進出者を決める試合で最下位でフィニッシュしました。メルが最下位でフィニッシュしました。エイミーは3位でフィニッシュしました。\n選択肢:\n(A) ジョーが準決勝進出者を決める試合で最下位でフィニッシュした\n(B) ダンが準決勝進出者を決める試合で最下位でフィニッシュした\n(C) アナが準決勝進出者を決める試合で最下位でフィニッシュした\n(D) メルが準決勝進出者を決める試合で最下位でフィニッシュした\n(E) アダが準決勝進出者を決める試合で最下位でフィニッシュした\n(F) イブが準決勝進出者を決める試合で最下位でフィニッシュした\n(G) エイミーが準決勝進出者を決める試合で最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、エリ、エイダ、メル、イブ、ロブ、アナ――がいました。ジョーが1位でフィニッシュしました。メルが2位でフィニッシュしました。ロブはイブよりも上位でフィニッシュしました。メルはエリよりも上位でフィニッシュしました。ロブはエイダよりも下位でフィニッシュしました。イブが4位でフィニッシュしました。\n選択肢:\n(A) ジョーが準々々々々々々位でフィニッシュした\n(B) エリが準々々々々々々位でフィニッシュした\n(C) エイダが準々々々々々々位でフィニッシュした\n(D) メルが準々々々々々々位でフィニッシュした\n(E) イブが準々々々々々々位でフィニッシュした\n(F) ロブが準々々々々々々位でフィニッシュした\n(G) アナが準々々々々々々位でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋台では、7種類の果物――プラム、キウイ、梨、マンゴー、リンゴ、オレンジ、ビワ――を販売しています。梨はオレンジよりも安価です。マンゴーはキウイよりも安価です。プラムは価格が2番目に高い部類に入ります。ビワはリンゴよりも高価です。キウイはリンゴよりも安価です。ビワは価格が4番目に高い部類に入ります。\n選択肢:\n(A) プラムは価格が3番目に高い\n(B) キウイは価格が3番目に高い\n(C) 梨は価格が3番目に高い\n(D) マンゴーは価格が3番目に高い\n(E) リンゴは価格が3番目に高い\n(F) オレンジは価格が3番目に高い\n(G) ビワは価格が3番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物を販売しています：オレンジ、プラム、ビワ、リンゴ、キウイ、カンタロープメロン、桃です。ビワはキウイよりも安価です。プラムが最も安価です。ビワは価格が4番目に高い果物です。桃はオレンジよりも安価です。桃はキウイよりも高価です。リンゴは2番目に安価な果物です。\n選択肢:\n(A) オレンジは価格が4番目に高い\n(B) プラムは価格が4番目に高い\n(C) ビワは価格が4番目に高い\n(D) リンゴは価格が4番目に高い\n(E) キウイは価格が4番目に高い\n(F) カンタロープメロンは価格が4番目に高い\n(G) 桃は価格が4番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、アナ、エイミー、ダン、エリ、ロブ、ミア――がいました。ミアはエリよりも上位でフィニッシュしました。イブはロブよりも下位でフィニッシュしました。エイミーは2位でフィニッシュしました。ロブはダンよりも下位でフィニッシュしました。アナは最下位から2番目でフィニッシュしました。ダンは4位でフィニッシュしました。\n選択肢:\n(A) イブが1位でフィニッシュした\n(B) アナが1位でフィニッシュした\n(C) エイミーが1位でフィニッシュした\n(D) ダンが1位でフィニッシュした\n(E) エリが1位でフィニッシュした\n(F) ロブが1位でフィニッシュした\n(G) ミアが1位でフィニッシュした", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――スイカ、オレンジ、マンゴー、カンタロープメロン、キウイ、梨、桃――を販売しています。梨は最も安価な2番目の果物です。桃はカンタロープメロンよりも高価です。桃はマンゴーよりも安価です。カンタロープメロンはキウイよりも高価です。オレンジは最も高価な4番目の果物です。スイカは最も高価な2番目の果物です。\n選択肢:\n(A) スイカは最も安価な2番目の果物である\n(B) オレンジは最も安価な2番目の果物である\n(C) マンゴーは最も安価な2番目の果物である\n(D) カンタロープメロンは最も安価な2番目の果物である\n(E) キウイは最も安価な2番目の果物である\n(F) 梨は最も安価な2番目の果物である\n(G) 桃は最も安価な2番目の果物である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――メル、ロブ、エリ、ダン、アナ、アダ、マイア――がいました。アナが最下位でフィニッシュしました。マイアはロブよりも上位でフィニッシュしました。ダンはマイアよりも上位でフィニッシュしました。ロブは4位でフィニッシュしました。エリは2位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。\n選択肢:\n(A) メルが2位でフィニッシュした\n(B) ロブが2位でフィニッシュした\n(C) エリが2位でフィニッシュした\n(D) ダンが2位でフィニッシュした\n(E) アナが2位でフィニッシュした\n(F) アダが2位でフィニッシュした\n(G) マイアが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：ハッチバック、セダン、ステーションワゴン、オープンカー、トラクター、バス、トラックです。オープンカーは2番目に新しいモデルです。ステーションワゴンはトラックよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。トラックは4番目に新しいモデルです。ステーションワゴンはトラクターよりも古いモデルです。セダンは最も古いモデルです。\n選択肢:\n(A) ハッチバックは2番目に新しいモデルである\n(B) セダンは2番目に新しいモデルである\n(C) ステーションワゴンは2番目に新しいモデルである\n(D) オープンカーは2番目に新しいモデルである\n(E) トラクターは2番目に新しいモデルである\n(F) バスは2番目に新しいモデルである\n(G) トラックは2番目に新しいモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、ハヤブサ、ショウジョウコウカンチョウ、ハチドリ、ウズラ、タカです。ハヤブサはカラスの左側にあります。ウズラはショウジョウコウカンチョウの右側にあります。ハチドリはウズラの右側に位置しています。ハヤブサは右側から2番目です。ハチドリはタカの左側にあります。フクロウは左から3番目です。\n選択肢:\n(A) フクロウが最も左側に位置する\n(B) カラスが最も左側に位置する\n(C) ハヤブサが最も左側に位置する\n(D) ショウジョウコウカンチョウが最も左側に位置する\n(E) ハチドリが最も左側に位置する\n(F) ウズラが最も左側に位置する\n(G) タカが最も左側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：セダン、トラック、バス、ステーションワゴン、トラクター、オープンカー、リムジンです。この中でトラックが最も古い車両です。トラクターが最も新しい車両です。セダンはステーションワゴンよりも古い車両です。ステーションワゴンは7台中3番目に新しい車両です。バスはオープンカーよりも古い車両です。セダンはオープンカーよりも新しい車両です。\n選択肢:\n(A) セダンが最も古い車両である\n(B) トラックが最も古い車両である\n(C) バスが最も古い車両である\n(D) ステーションワゴンが最も古い車両である\n(E) トラクターが最も古い車両である\n(F) オープンカーが最も古い車両である\n(G) リムジンが最も古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：セダン、ミニバン、オートバイ、リムジン、ハッチバック、トラック、トラクターです。オートバイはトラクターよりも古い車両です。ハッチバックはリムジンよりも古い車両です。ハッチバックはトラックよりも新しい車両です。トラックはトラクターよりも新しい車両です。ミニバンは最も新しい車両ではありません。セダンは3番目に新しい車両です。\n選択肢:\n(A) セダンが最も新しい車両である\n(B) ミニバンが最も新しい車両である\n(C) オートバイが最も新しい車両である\n(D) リムジンが最も新しい車両である\n(E) ハッチバックが最も新しい車両である\n(F) トラックが最も新しい車両である\n(G) トラクターが最も新しい車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：ハッチバック、セダン、ステーションワゴン、オープンカー、トラクター、バス、トラックです。オープンカーは2番目に新しいモデルです。ステーションワゴンはトラックよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。トラックは4番目に新しいモデルです。ステーションワゴンはトラクターよりも古いモデルです。セダンは最も古いモデルです。\n選択肢:\n(A) ハッチバックは2番目に古いモデルである\n(B) セダンは2番目に古いモデルである\n(C) ステーションワゴンは2番目に古いモデルである\n(D) オープンカーは2番目に古いモデルである\n(E) トラクターは2番目に古いモデルである\n(F) バスは2番目に古いモデルである\n(G) トラックは2番目に古いモデルである", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：タカ、カラス、フクロウ、ワタリガラス、ハヤブサ、ウズラ、ハチドリです。ハチドリは左から2番目の位置にあります。ワタリガラスは左から4番目の位置にあります。ワタリガラスはタカの右側に位置しています。フクロウはカラスの右側にいます。ハヤブサは最も右側に位置しています。タカはハチドリの右側に位置しています。ウズラは左から2番目の位置にあります。\n選択肢:\n(A) タカは左から2番目の位置にある\n(B) カラスは左から2番目の位置にある\n(C) フクロウは左から2番目の位置にある\n(D) ワタリガラスは左から2番目の位置にある\n(E) ハヤブサは左から2番目の位置にある\n(F) ウズラは左から2番目の位置にある\n(G) ハチドリは左から2番目の位置にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――イブ、ミア、ロブ、アナ、アダ、メル、ジョー――がいました。イブは3位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。メルはアダよりも上位でフィニッシュしました。ミアはロブよりも上位でフィニッシュしました。メルはジョーよりも下位でフィニッシュしました。ミアは2位でフィニッシュしました。アダは最下位から2番目でフィニッシュしました。\n選択肢:\n(A) イブが2位でフィニッシュした\n(B) ミアが2位でフィニッシュした\n(C) ロブが2位でフィニッシュした\n(D) アナが2位でフィニッシュした\n(E) アダが2位でフィニッシュした\n(F) メルが2位でフィニッシュした\n(G) ジョーが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：セダン、ミニバン、オートバイ、リムジン、ハッチバック、トラック、トラクターです。オートバイはトラクターよりも古い車両です。ハッチバックはリムジンよりも古い車両です。ハッチバックはトラックよりも新しい車両です。トラックはトラクターよりも新しい車両です。ミニバンは7台中2番目に新しい車両です。セダンは7台中3番目に新しい車両です。\n選択肢:\n(A) セダンが最も古い車両である\n(B) ミニバンが最も古い車両である\n(C) オートバイが最も古い車両である\n(D) リムジンが最も古い車両である\n(E) ハッチバックが最も古い車両である\n(F) トラックが最も古い車両である\n(G) トラクターが最も古い車両である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：鷲、ハチドリ、ウズラ、フクロウ、カラス、コマドリ、コウヨウチョウです。コウヨウチョウは右側から2番目の位置にあります。鷲は最も右側に位置しています。フクロウはハチドリの左側にいます。コマドリはウズラの左側に位置しています。フクロウはカラスの右側にいます。コマドリは左から4番目の位置にあります。\n選択肢:\n(A) 鷲は右側から2番目の位置にある\n(B) ハチドリは右側から2番目の位置にある\n(C) ウズラは右側から2番目の位置にある\n(D) フクロウは右側から2番目の位置にある\n(E) カラスは右側から2番目の位置にある\n(F) コマドリは右側から2番目の位置にある\n(G) コウヨウチョウは右側から2番目の位置にある", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――マイア、エリ、アナ、エイミー、メル、ダン、ジョー――がいました。エイミーはジョーよりも下位でフィニッシュしました。ダンはマイアよりも上位でフィニッシュしました。エリは3位でフィニッシュしました。アナが1位でフィニッシュしました。エイミーは2位でフィニッシュしました。マイアは4位でフィニッシュしました。\n選択肢:\n(A) マイアが2位でフィニッシュした\n(B) エリが2位でフィニッシュした\n(C) アナが2位でフィニッシュした\n(D) エイミーが2位でフィニッシュした\n(E) メルが2位でフィニッシュした\n(F) ダンが2位でフィニッシュした\n(G) ジョーが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：紫色の本、緑色の本、白色の本、灰色の本、赤色の本、黒色の本、茶色の本です。灰色の本は紫色の本の左側にあります。白色の本は茶色の本の右側にあります。黒色の本は右側から3冊目です。紫色の本は白色の本の左側にあります。白色の本は右側から2冊目です。灰色の本は左側から3冊目です。茶色の本は緑色の本の右側にあります。\n選択肢:\n(A) 紫色の本は右側から3冊目である\n(B) 緑色の本は右側から3冊目である\n(C) 白色の本は右側から3冊目である\n(D) 灰色の本は右側から3冊目である\n(E) 赤色の本は右側から3冊目である\n(F) 黒色の本は右側から3冊目である\n(G) 茶色の本は右側から3冊目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、メル、ミア、イブ、ロブ、アダ、ダン――がいました。ロブが1位でフィニッシュしました。イブが最下位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。メルはミアよりも上位でフィニッシュしました。ジョーが2位でフィニッシュしました。ミアが3位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) メルが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) イブが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした\n(F) アダが2位でフィニッシュした\n(G) ダンが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、ハヤブサ、ショウジョウコウカンチョウ、ハチドリ、ウズラ、ノスリです。ハヤブサはカラスの左側にあります。ウズラはショウジョウコウカンチョウの右側にあります。ハチドリはウズラの右側に位置しています。ハヤブサは右側から2番目です。ハチドリはノスリの左側にあります。フクロウは左側から3番目です。\n選択肢:\n(A) フクロウは右側から2番目に位置する\n(B) カラスは右側から2番目に位置する\n(C) ハヤブサは右側から2番目に位置する\n(D) ショウジョウコウカンチョウは右側から2番目に位置する\n(E) ハチドリは右側から2番目に位置する\n(F) ウズラは右側から2番目に位置する\n(G) ノスリは右側から2番目に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、リムジン、セダン、トラクター、オートバイ、ミニバン、ハッチバック、トラックの7台の車両が展示されています。ミニバンはリムジンよりも新しいモデルです。トラクターは2番目に新しいモデルです。トラックはセダンよりも古いモデルです。ミニバンはトラックよりも新しいモデルです。ハッチバックはトラクターよりも新しいモデルです。オートバイは4番目に新しいモデルです。\n選択肢:\n(A) リムジンは2番目に古いモデルである\n(B) セダンは2番目に古いモデルである\n(C) トラクターは2番目に古いモデルである\n(D) オートバイは2番目に古いモデルである\n(E) ミニバンは2番目に古いモデルである\n(F) ハッチバックは2番目に古いモデルである\n(G) トラックは2番目に古いモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、灰色の本、オレンジ色の本、緑色の本、黒色の本、紫色の本、黄色の本です。紫色の本が最も左側にあります。茶色の本は黄色の本の右側に位置しています。緑色の本はオレンジ色の本の左側に位置しています。オレンジ色の本は灰色の本の左側に位置しています。黒色の本は左から3冊目です。緑色の本は右から3冊目です。\n選択肢:\n(A) 茶色の本は左から3冊目である\n(B) 灰色の本は左から3冊目である\n(C) オレンジ色の本は左から3冊目である\n(D) 緑色の本は左から3冊目である\n(E) 黒色の本は左から3冊目である\n(F) 紫色の本は左から3冊目である\n(G) 黄色の本は左から3冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ある果物屋では7種類の果物――オレンジ、ビワ、リンゴ、キウイ、マンゴー、スモモ、桃――を販売しています。リンゴは最も安価な2番目の果物です。桃は最も安価な果物です。スモモは最も高価な4番目の果物です。ビワは最も安価な3番目の果物です。キウイはマンゴーよりも高価な果物です。オレンジはマンゴーよりも安価な果物です。\n選択肢:\n(A) オレンジは最も高価な4番目の果物である\n(B) ビワは最も高価な4番目の果物である\n(C) リンゴは最も高価な4番目の果物である\n(D) キウイは最も高価な4番目の果物である\n(E) マンゴーは最も高価な4番目の果物である\n(F) スモモは最も高価な4番目の果物である\n(G) 桃は最も高価な4番目の果物である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：フクロウ、カラス、ハヤブサ、ショウジョウコウカンチョウ、ハチドリ、ウズラ、ノスリです。ハヤブサはカラスの左側に位置しています。ウズラはショウジョウコウカンチョウの右側に位置しています。ハチドリはウズラの右側に位置しています。ハヤブサは右側から2番目の位置にあります。ハチドリはノスリの左側に位置しています。フクロウは左側から3番目の位置にあります。\n選択肢:\n(A) フクロウは左側から2番目の位置にある\n(B) カラスは左側から2番目の位置にある\n(C) ハヤブサは左側から2番目の位置にある\n(D) ショウジョウコウカンチョウは左側から2番目の位置にある\n(E) ハチドリは左側から2番目の位置にある\n(F) ウズラは左側から2番目の位置にある\n(G) ノスリは左側から2番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：黒い本、オレンジ色の本、黄色い本、白い本、青い本、赤い本、緑の本です。赤い本は黄色い本の右側にあります。白い本は右側から2冊目です。赤い本は緑の本の左側にあります。青い本は黒い本の右側にあります。黒い本は右側から3冊目です。オレンジ色の本は最も左側にあります。\n選択肢:\n(A) 黒い本は左から4冊目である\n(B) オレンジ色の本は左から4冊目である\n(C) 黄色い本は左から4冊目である\n(D) 白い本は左から4冊目である\n(E) 青い本は左から4冊目である\n(F) 赤い本は左から4冊目である\n(G) 緑の本は左から4冊目である", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、ステーションワゴン、セダン、バス、オートバイ、ハッチバック、トラクター、ミニバンの7台の車両が展示されています。セダンは最も古い車両から数えて3番目に古い車両です。トラクターはオートバイよりも新しい車両です。バスはオートバイよりも古い車両です。バスはハッチバックよりも新しい車両です。ミニバンは最も新しい車両です。ステーションワゴンは最も古い車両です。\n選択肢:\n(A) ステーションワゴンは4番目に新しい車両である\n(B) セダンは4番目に新しい車両である\n(C) バスは4番目に新しい車両である\n(D) オートバイは4番目に新しい車両である\n(E) ハッチバックは4番目に新しい車両である\n(F) トラクターは4番目に新しい車両である\n(G) ミニバンは4番目に新しい車両である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されていました：トラック、オートバイ、セダン、ミニバン、ステーションワゴン、ハッチバック、トラクターです。ハッチバックはトラックよりも新しいモデルです。セダンは3番目に新しいモデルです。ステーションワゴンは最も新しいモデルです。オートバイはトラックよりも古いモデルです。ミニバンはセダンよりも新しいモデルです。トラクターは3番目に古いモデルです。\n選択肢:\n(A) トラックが最も古いモデルである\n(B) オートバイが最も古いモデルである\n(C) セダンが最も古いモデルである\n(D) ミニバンが最も古いモデルである\n(E) ステーションワゴンが最も古いモデルである\n(F) ハッチバックが最も古いモデルである\n(G) トラクターが最も古いモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――エリ、アダ、エイミー、アナ、イブ、メル、ダン――がいました。アダはメルよりも上位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。エイミーが最下位でフィニッシュしました。アナは下から3番目でフィニッシュしました。ダンはエリよりも下位でフィニッシュしました。イブは3位でフィニッシュしました。\n選択肢:\n(A) エリが1位でフィニッシュした\n(B) アダが1位でフィニッシュした\n(C) エイミーが1位でフィニッシュした\n(D) アナが1位でフィニッシュした\n(E) イブが1位でフィニッシュした\n(F) メルが1位でフィニッシュした\n(G) ダンが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：ミニバン、バス、リムジン、トラック、オープンカー、トラクター、オートバイです。リムジンはミニバンよりも古い車両です。トラクターはリムジンよりも古い車両です。バスは最も新しい車両です。トラックは5番目に新しい車両です。オートバイは4番目に新しい車両です。オープンカーはトラクターよりも古い車両です。\n選択肢:\n(A) ミニバンは2番目に古い車両である\n(B) バスは2番目に古い車両である\n(C) リムジンは2番目に古い車両である\n(D) トラックは2番目に古い車両である\n(E) オープンカーは2番目に古い車両である\n(F) トラクターは2番目に古い車両である\n(G) オートバイは2番目に古い車両である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、7台の車両が展示されています：リムジン、トラック、セダン、トラクター、ミニバン、オートバイ、ハッチバックです。ミニバンはトラクターよりも古い年式です。ハッチバックはセダンよりも古い年式です。トラックは最も新しい車両から3番目に古い車両です。ハッチバックは最も新しい車両から2番目に古い車両です。トラクターはリムジンよりも古い年式です。オートバイはリムジンよりも新しい年式です。\n選択肢:\n(A) リムジンが最も新しい車両から3番目に古い\n(B) トラックが最も新しい車両から3番目に古い\n(C) セダンが最も新しい車両から3番目に古い\n(D) トラクターが最も新しい車両から3番目に古い\n(E) ミニバンが最も新しい車両から3番目に古い\n(F) オートバイが最も新しい車両から3番目に古い\n(G) ハッチバックが最も新しい車両から3番目に古い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：茶色の本、緑色の本、黒色の本、オレンジ色の本、白色の本、青色の本、灰色の本です。茶色の本は最も右側にあります。黒色の本は白色の本の右側に位置しています。灰色の本は左から3冊目です。オレンジ色の本は灰色の本の右側にあります。オレンジ色の本は緑色の本の左側に位置しています。青色の本は最も左側から3冊目です。\n選択肢:\n(A) 茶色の本は右側から3冊目である\n(B) 緑色の本は右側から3冊目である\n(C) 黒色の本は右側から3冊目である\n(D) オレンジ色の本は右側から3冊目である\n(E) 白色の本は右側から3冊目である\n(F) 青色の本は右側から3冊目である\n(G) 灰色の本は右側から3冊目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ハヤブサ、カラス、タカ、ハチドリ、アオカケス、コマドリ、ワタリガラスです。アオカケスはコマドリの右側に位置しています。タカはハチドリの左側に位置しています。コマドリは右側から2番目の位置にあります。ハヤブサは左側から3番目の位置にあります。カラスはハチドリの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。\n選択肢:\n(A) ハヤブサは右側から2番目の位置にある\n(B) カラスは右側から2番目の位置にある\n(C) タカは右側から2番目の位置にある\n(D) ハチドリは右側から2番目の位置にある\n(E) アオカケスは右側から2番目の位置にある\n(F) コマドリは右側から2番目の位置にある\n(G) ワタリガラスは右側から2番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：リムジン、オープンカー、ステーションワゴン、ミニバン、バス、トラクター、トラックです。この中でミニバンが最も古い車両です。トラックはステーションワゴンよりも古く、リムジンよりも新しい車両です。バスはオープンカーよりも新しく、トラクターよりも古い車両です。リムジンはトラクターよりも新しい車両です。\n選択肢:\n(A) リムジンが3番目に古い車両である\n(B) オープンカーが3番目に古い車両である\n(C) ステーションワゴンが3番目に古い車両である\n(D) ミニバンが3番目に古い車両である\n(E) バスが3番目に古い車両である\n(F) トラクターが3番目に古い車両である\n(G) トラックが3番目に古い車両である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：タカ、ワタリガラス、ハヤブサ、カラス、ハチドリ、コマドリ、ショウジョウコウカンチョウです。タカは右側から2番目の位置にあります。コマドリはワタリガラスの左側にあります。ワタリガラスはカラスの左側にあります。ハヤブサはショウジョウコウカンチョウの左側にあります。ハチドリは左側から2番目の位置にあります。ハヤブサは右側から3番目の位置にあります。\n選択肢:\n(A) タカが最も右側に位置する\n(B) ワタリガラスが最も右側に位置する\n(C) ハヤブサが最も右側に位置する\n(D) カラスが最も右側に位置する\n(E) ハチドリが最も右側に位置する\n(F) コマドリが最も右側に位置する\n(G) ショウジョウコウカンチョウが最も右側に位置する", "target": "(G)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：オレンジ色の本、赤色の本、緑色の本、白色の本、紫色の本、茶色の本、黄色の本です。緑色の本は紫色の本の左側にあります。白色の本はオレンジ色の本の右側にあります。緑色の本は茶色の本の右側にあります。黄色の本は白色の本の右側にあります。赤色の本は黄色の本の右側にあります。茶色の本は赤色の本の右側にあります。\n選択肢:\n(A) オレンジ色の本は右側から3冊目である\n(B) 赤色の本は右側から3冊目である\n(C) 緑色の本は右側から3冊目である\n(D) 白色の本は右側から3冊目である\n(E) 紫色の本は右側から3冊目である\n(F) 茶色の本は右側から3冊目である\n(G) 黄色の本は右側から3冊目である", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：タカ、ハチドリ、ハヤブサ、ショウジョウコウカンチョウ、フクロウ、コマドリ、アオカケスです。ハチドリはフクロウの左側にあります。コマドリは最も右側に位置しています。アオカケスはタカの左側にあります。アオカケスは左から3番目の位置にあります。ハヤブサは左から4番目の位置にあります。ショウジョウコウカンチョウは右側から2番目の位置にあります。\n選択肢:\n(A) タカは左から4番目の位置にある\n(B) ハチドリは左から4番目の位置にある\n(C) ハヤブサは左から4番目の位置にある\n(D) ショウジョウコウカンチョウは左から4番目の位置にある\n(E) フクロウは左から4番目の位置にある\n(F) コマドリは左から4番目の位置にある\n(G) アオカケスは左から4番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では7種類の果物――スイカ、マンゴー、キウイ、梨、カンタロープメロン、オレンジ、桃――を販売しています。オレンジは桃よりも高価です。カンタロープメロンは価格が4番目に高い果物です。梨はカンタロープメロンよりも安価です。桃は価格が2番目に高い果物です。マンゴーは最も安価な果物です。キウイは価格が3番目に安い果物です。\n選択肢:\n(A) スイカは価格が3番目に安い\n(B) マンゴーは価格が3番目に安い\n(C) キウイは価格が3番目に安い\n(D) 梨は価格が3番目に安い\n(E) カンタロープメロンは価格が3番目に安い\n(F) オレンジは価格が3番目に安い\n(G) 桃は価格が3番目に安い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、7人のゴルファー――ジョー、メル、ミア、イブ、ロブ、アダ、ダン――がいました。ロブが1位でフィニッシュしました。イブが最下位でフィニッシュしました。ダンはアダよりも上位でフィニッシュしました。メルはミアよりも上位でフィニッシュしました。ジョーが2位でフィニッシュしました。ミアが3位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) メルが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) イブが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした\n(F) アダが2位でフィニッシュした\n(G) ダンが2位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：タカ、ハチドリ、ウズラ、フクロウ、カラス、コマドリ、コウヨウチョウです。コウヨウチョウは右側から2番目の位置にあります。タカは最も右側に位置しています。フクロウはハチドリの左側にいます。コマドリはウズラの左側に位置しています。フクロウはカラスの右側にいます。コマドリは左から4番目の位置にあります。\n選択肢:\n(A) タカは左側から2番目の位置にある\n(B) ハチドリは左側から2番目の位置にある\n(C) ウズラは左側から2番目の位置にある\n(D) フクロウは左側から2番目の位置にある\n(E) カラスは左側から2番目の位置にある\n(F) コマドリは左側から2番目の位置にある\n(G) コウヨウチョウは左側から2番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には7冊の本が並んでいます：白い本、灰色の本、黄色い本、紫色の本、赤い本、黒い本、緑色の本です。黒い本は右から2冊目に位置しています。赤い本は緑色の本の左側に配置されています。赤い本は左から2冊目です。灰色の本は右から3冊目に位置しています。黄色い本は左から3冊目です。白い本は左から4冊目に位置しています。\n選択肢:\n(A) 白い本は左から4冊目である\n(B) 灰色の本は左から4冊目である\n(C) 黄色い本は左から4冊目である\n(D) 紫色の本は左から4冊目である\n(E) 赤い本は左から4冊目である\n(F) 黒い本は左から4冊目である\n(G) 緑色の本は左から4冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には7羽の鳥がいます：ウズラ、ワタリガラス、ハチドリ、コマドリ、ハヤブサ、フクロウ、アオカケスです。アオカケスはハヤブサの左側にあります。アオカケスは右側から2番目の位置です。ワタリガラスはコマドリの左側にあります。フクロウは右側から3番目の位置です。ハチドリはウズラの左側にあります。ワタリガラスは左側から3番目の位置です。\n選択肢:\n(A) ウズラは右側から3番目の位置にある\n(B) ワタリガラスは右側から3番目の位置にある\n(C) ハチドリは右側から3番目の位置にある\n(D) コマドリは右側から3番目の位置にある\n(E) ハヤブサは右側から3番目の位置にある\n(F) フクロウは右側から3番目の位置にある\n(G) アオカケスは右側から3番目の位置にある", "target": "(F)"}
{"input": "以下の各段落では、固定された順序で配置された7つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、7台の車両が展示されています：セダン、トラック、バス、ステーションワゴン、トラクター、オープンカー、リムジンです。トラックが最も古い車両です。トラクターが最も新しい車両です。セダンはステーションワゴンよりも古い車両です。ステーションワゴンは7台中3番目に新しい車両です。バスはオープンカーよりも古い車両です。セダンはオープンカーよりも新しい車両です。\n選択肢:\n(A) セダンは7台中3番目に新しい車両である\n(B) トラックは7台中3番目に新しい車両である\n(C) バスは7台中3番目に新しい車両である\n(D) ステーションワゴンは7台中3番目に新しい車両である\n(E) トラクターは7台中3番目に新しい車両である\n(F) オープンカーは7台中3番目に新しい車両である\n(G) リムジンは7台中3番目に新しい車両である", "target": "(D)"}
