{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：鶉、フクロウ、ワタリガラス、ハヤブサ、コマドリです。フクロウが最も左側にあります。コマドリはワタリガラスの左側にあります。鶉が最も右側にあります。ワタリガラスは左から3番目の位置にあります。\n選択肢:\n(A) 鶉が最も右側に位置する\n(B) フクロウが最も右側に位置する\n(C) ワタリガラスが最も右側に位置する\n(D) ハヤブサが最も右側に位置する\n(E) コマドリが最も右側に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ハッチバック、バス、オープンカー、トラクター、ミニバンです。トラクターはバスよりも古い車両です。ミニバンはバスよりも新しい車両です。ハッチバックは5台の中で2番目に新しい車両です。ミニバンはオープンカーよりも古い車両です。\n選択肢:\n(A) ハッチバックは2番目に古い車両である\n(B) バスは2番目に古い車両である\n(C) オープンカーは2番目に古い車両である\n(D) トラクターは2番目に古い車両である\n(E) ミニバンは2番目に古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黄色の本、緑色の本、灰色の本、青色の本、オレンジ色の本です。灰色の本は緑色の本の左側にあります。灰色の本は右側から2冊目です。黄色の本はオレンジ色の本の右側にあります。青色の本は左側から2冊目です。\n選択肢:\n(A) 黄色の本が最も左側にある\n(B) 緑色の本が最も左側にある\n(C) 灰色の本が最も左側にある\n(D) 青色の本が最も左側にある\n(E) オレンジ色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、フクロウ、コウヨウチョウ、ハチドリ、イワサンショクヒタキです。コウヨウチョウは最も右側に位置しています。カラスはフクロウの左側にいます。イワサンショクヒタキはハチドリの右側にいます。ハチドリは左から3番目の位置にあります。\n選択肢:\n(A) カラスは左から2番目の位置にいる\n(B) フクロウは左から2番目の位置にいる\n(C) コウヨウチョウは左から2番目の位置にいる\n(D) ハチドリは左から2番目の位置にいる\n(E) イワサンショクヒタキは左から2番目の位置にいる", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：緑色の本、オレンジ色の本、灰色の本、黄色の本、紫色の本です。緑色の本は最も右側にあります。灰色の本はオレンジ色の本の右側に位置しています。紫色の本は黄色の本の左側に位置しています。紫色の本は灰色の本の右側にあります。\n選択肢:\n(A) 緑色の本は右側から2冊目である\n(B) オレンジ色の本は右側から2冊目である\n(C) 灰色の本は右側から2冊目である\n(D) 黄色の本は右側から2冊目である\n(E) 紫色の本は右側から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：白い本、緑の本、茶色の本、灰色の本、そしてオレンジ色の本です。灰色の本はオレンジ色の本の右側にあります。緑の本は右側から2冊目です。茶色の本は白い本の右側にあります。茶色の本はオレンジ色の本の左側にあります。\n選択肢:\n(A) 白い本は左から3冊目である\n(B) 緑の本は左から3冊目である\n(C) 茶色の本は左から3冊目である\n(D) 灰色の本は左から3冊目である\n(E) オレンジ色の本は左から3冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両――オープンカー、バス、ミニバン、トラック、セダン――が展示されています。オープンカーはトラックよりも新しいモデルです。ミニバンが最も新しいモデルです。バスは3番目に新しいモデルです。トラックはセダンよりも新しいモデルです。\n選択肢:\n(A) オープンカーが最も新しいモデルである\n(B) バスが最も新しいモデルである\n(C) ミニバンが最も新しいモデルである\n(D) トラックが最も新しいモデルである\n(E) セダンが最も新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、アダ、ダン、ジョー、メル――がいました。アダはメルよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。\n選択肢:\n(A) ロブが最下位でフィニッシュした\n(B) アダが最下位でフィニッシュした\n(C) ダンが最下位でフィニッシュした\n(D) ジョーが最下位でフィニッシュした\n(E) メルが最下位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：白い本、緑の本、茶色の本、灰色の本、そしてオレンジ色の本です。灰色の本はオレンジ色の本の右側にあります。緑の本は右側から2冊目です。茶色の本は白い本の右側にあります。茶色の本はオレンジ色の本の左側にあります。\n選択肢:\n(A) 白い本が最も右側にある\n(B) 緑の本が最も右側にある\n(C) 茶色の本が最も右側にある\n(D) 灰色の本が最も右側にある\n(E) オレンジ色の本が最も右側にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、コンバーチブル、セダン、トラクター、ミニバン、リムジンの5台の車両が展示されています。トラクターはミニバンよりも新しいモデルです。トラクターはリムジンよりも古いモデルです。コンバーチブルはセダンよりも古いモデルです。コンバーチブルは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) コンバーチブルは2番目に古いモデルである\n(B) セダンは2番目に古いモデルである\n(C) トラクターは2番目に古いモデルである\n(D) ミニバンは2番目に古いモデルである\n(E) リムジンは2番目に古いモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――キウイ、梨、桃、ビワ、リンゴ――を販売しています。ビワはキウイよりも高価です。梨は桃よりも高価です。リンゴはビワよりも高価です。リンゴは桃よりも安価です。\n選択肢:\n(A) キウイが2番目に安価な果物である\n(B) 梨が2番目に安価な果物である\n(C) 桃が2番目に安価な果物である\n(D) ビワが2番目に安価な果物である\n(E) リンゴが2番目に安価な果物である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――オレンジ、カンタロープメロン、桃、ビワ、キウイ――を販売しています。桃はオレンジよりも高価です。カンタロープメロンは桃よりも高価です。キウイは最も高価な3番目の果物です。ビワは最も安価な2番目の果物です。\n選択肢:\n(A) オレンジが最も高価である\n(B) カンタロープメロンが最も高価である\n(C) 桃が最も高価である\n(D) ビワが最も高価である\n(E) キウイが最も高価である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：茶色の本、黄色の本、オレンジ色の本、緑色の本、灰色の本です。緑色の本は灰色の本の左側にあります。茶色の本は左から3冊目です。灰色の本は右から2冊目です。黄色の本は緑色の本の左側にあります。\n選択肢:\n(A) 茶色の本は左から3冊目である\n(B) 黄色の本は左から3冊目である\n(C) オレンジ色の本は左から3冊目である\n(D) 緑色の本は左から3冊目である\n(E) 灰色の本は左から3冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アダ、エリ、エイミー、ジョー、メル――がいました。アダはエリよりも上位でフィニッシュしました。エイミーはメルよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。メルはエリよりも下位でフィニッシュしました。\n選択肢:\n(A) アダが1位でフィニッシュした\n(B) エリが1位でフィニッシュした\n(C) エイミーが1位でフィニッシュした\n(D) ジョーが1位でフィニッシュした\n(E) メルが1位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、オレンジ、ビワ、プラム、キウイ――を販売しています。プラムはキウイよりも安価です。プラムはスイカよりも高価です。ビワはキウイよりも高価です。オレンジは最も高価です。\n選択肢:\n(A) スイカが最も安価である\n(B) オレンジが最も安価である\n(C) ビワが最も安価である\n(D) プラムが最も安価である\n(E) キウイが最も安価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黄色の本、灰色の本、赤色の本、黒色の本、白色の本です。灰色の本は黄色の本の左側にあります。白色の本は赤色の本の左側にあります。黒色の本は赤色の本の右側にあります。黒色の本は灰色の本の左側にあります。\n選択肢:\n(A) 黄色の本が一番右側にある\n(B) 灰色の本が一番右側にある\n(C) 赤色の本が一番右側にある\n(D) 黒色の本が一番右側にある\n(E) 白色の本が一番右側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ハッチバック、オープンカー、トラクター、トラック、リムジンです。トラクターはハッチバックよりも新しいモデルです。リムジンは2番目に新しいモデルです。トラックはハッチバックよりも古いモデルです。オープンカーは2番目に古いモデルです。\n選択肢:\n(A) ハッチバックは2番目に古いモデルである\n(B) オープンカーは2番目に古いモデルである\n(C) トラクターは2番目に古いモデルである\n(D) トラックは2番目に古いモデルである\n(E) リムジンは2番目に古いモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ウズラ、フクロウ、ワタリガラス、ハヤブサ、コマドリです。フクロウが最も左側にあります。コマドリはワタリガラスの左側にあります。ウズラが最も右側にあります。ワタリガラスは左から3番目の位置にあります。\n選択肢:\n(A) ウズラは右側から2番目に位置する\n(B) フクロウは右側から2番目に位置する\n(C) ワタリガラスは右側から2番目に位置する\n(D) ハヤブサは右側から2番目に位置する\n(E) コマドリは右側から2番目に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――メル、ダン、エイミー、ジョー、イブ――がいました。エイミーはダンよりも下位でフィニッシュしました。メルが1位でフィニッシュしました。ジョーはダンよりも上位でフィニッシュしました。イブが最下位でフィニッシュしました。\n選択肢:\n(A) メルが1位でフィニッシュした\n(B) ダンが1位でフィニッシュした\n(C) エイミーが1位でフィニッシュした\n(D) ジョーが1位でフィニッシュした\n(E) イブが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、エイミー、ジョー、イブ、ダン――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーは2位でフィニッシュしました。ジョーはイブよりも上位でフィニッシュしました。イブはダンよりも上位でフィニッシュしました。\n選択肢:\n(A) ロブが2位でフィニッシュした\n(B) エイミーが2位でフィニッシュした\n(C) ジョーが2位でフィニッシュした\n(D) イブが2位でフィニッシュした\n(E) ダンが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、リンゴ、マンゴー、ナシ、カンタロープ――を販売しています。スイカはカンタロープよりも高価です。マンゴーはナシよりも安価です。リンゴは最も安価な2番目の価格です。スイカはマンゴーよりも安価です。\n選択肢:\n(A) スイカは最も安価な2番目の価格である\n(B) リンゴは最も安価な2番目の価格である\n(C) マンゴーは最も安価な2番目の価格である\n(D) ナシは最も安価な2番目の価格である\n(E) カンタロープは最も安価な2番目の価格である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両があります：トラック、ステーションワゴン、オートバイ、オープンカー、ハッチバックです。オープンカーはトラックよりも新しいモデルです。ステーションワゴンはハッチバックよりも新しいモデルです。オープンカーはハッチバックよりも古いモデルです。ステーションワゴンは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) トラックが最も新しいモデルである\n(B) ステーションワゴンが最も新しいモデルである\n(C) オートバイが最も新しいモデルである\n(D) オープンカーが最も新しいモデルである\n(E) ハッチバックが最も新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、ロブ、エイミー、ダン、ジョー――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーはアナよりも下位でフィニッシュしました。ジョーはエイミーよりも上位でフィニッシュしました。ダンはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが最下位でフィニッシュした\n(B) ロブが最下位でフィニッシュした\n(C) エイミーが最下位でフィニッシュした\n(D) ダンが最下位でフィニッシュした\n(E) ジョーが最下位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両――バス、トラック、オートバイ、セダン、ハッチバック――が展示されています。セダンは最も古い車両の2番目に古いものです。ハッチバックはオートバイよりも新しい車両です。オートバイはセダンよりも新しい車両です。ハッチバックはトラックよりも古い車両です。\n選択肢:\n(A) バスが最も古い車両である\n(B) トラックが最も古い車両である\n(C) オートバイが最も古い車両である\n(D) セダンが最も古い車両である\n(E) ハッチバックが最も古い車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：黄色の本、茶色の本、灰色の本、黒色の本、紫色の本です。黄色の本は紫色の本の右側にあります。黒色の本は紫色の本の左側にあります。黒色の本は左から3冊目です。茶色の本は最も左側にあります。\n選択肢:\n(A) 黄色の本は左から3冊目である\n(B) 茶色の本は左から3冊目である\n(C) 灰色の本は左から3冊目である\n(D) 黒色の本は左から3冊目である\n(E) 紫色の本は左から3冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、ビワ、梨、プラム、リンゴ――を販売しています。梨は最も安価な2番目の価格です。ビワは梨よりも高価です。プラムは最も高価な2番目の価格です。スイカは最も高価な果物です。\n選択肢:\n(A) スイカは最も高価な3番目の価格である\n(B) ビワは最も高価な3番目の価格である\n(C) 梨は最も高価な3番目の価格である\n(D) プラムは最も高価な3番目の価格である\n(E) リンゴは最も高価な3番目の価格である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、メル、ロブ、ジョー、アダ――がいました。ジョーは2位でフィニッシュしました。ジョーはエイミーよりも下位でフィニッシュしました。メルは5位（最下位から2番目）でフィニッシュしました。アダが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが最下位でフィニッシュした\n(B) メルが最下位でフィニッシュした\n(C) ロブが最下位でフィニッシュした\n(D) ジョーが最下位でフィニッシュした\n(E) アダが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、イブ、ミア、ロブ、ダン――がいました。ジョーはダンよりも下位でフィニッシュしました。ミアが1位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはロブよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) ロブが2位でフィニッシュした\n(E) ダンが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、メル、ロブ、ジョー、アダ――がいました。ジョーは2位でフィニッシュしました。ジョーはエイミーよりも下位でフィニッシュしました。メルは5位（最下位から2番目）でフィニッシュしました。アダが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが1位でフィニッシュした\n(B) メルが1位でフィニッシュした\n(C) ロブが1位でフィニッシュした\n(D) ジョーが1位でフィニッシュした\n(E) アダが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――メル、ダン、エイミー、ジョー、イブ――がいました。エイミーはダンよりも下位でフィニッシュしました。メルが1位でフィニッシュしました。ジョーはダンよりも上位でフィニッシュしました。イブが最下位でフィニッシュしました。\n選択肢:\n(A) メルが2位でフィニッシュした\n(B) ダンが2位でフィニッシュした\n(C) エイミーが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) イブが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：鶉、ハチドリ、アオカケス、鷹、コマドリです。コマドリは左から2番目の位置にあります。鶉は最も左側の位置にあります。ハチドリは鶉の左側にあります。鷹は左から3番目の位置にあります。\n選択肢:\n(A) 鶉が最も右側に位置する\n(B) ハチドリが最も右側に位置する\n(C) アオカケスが最も右側に位置する\n(D) 鷹が最も右側に位置する\n(E) コマドリが最も右側に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ウズラ、フクロウ、ワタリガラス、ハヤブサ、コマドリです。フクロウが最も左側にあります。コマドリはワタリガラスの左側にあります。ウズラが最も右側にあります。ワタリガラスは左から3番目の位置にあります。\n選択肢:\n(A) ウズラが左から3番目の位置にある\n(B) フクロウが左から3番目の位置にある\n(C) ワタリガラスが左から3番目の位置にある\n(D) ハヤブサが左から3番目の位置にある\n(E) コマドリが左から3番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、メル、アナ、エリ、ロブ――がいました。ロブはメルよりも上位でフィニッシュしました。メルは2位でフィニッシュしました。アナはエリよりも上位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが2位でフィニッシュした\n(B) メルが2位でフィニッシュした\n(C) アナが2位でフィニッシュした\n(D) エリが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：灰色の本、赤い本、黄色い本、青い本、オレンジ色の本です。灰色の本は黄色い本の右側にあります。オレンジ色の本は赤い本の右側にあります。青い本は最も右側に位置しています。灰色の本は赤い本の左側に位置しています。\n選択肢:\n(A) 灰色の本は左から2冊目である\n(B) 赤い本は左から2冊目である\n(C) 黄色い本は左から2冊目である\n(D) 青い本は左から2冊目である\n(E) オレンジ色の本は左から2冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エリ、ジョー、ロブ、マイア――がいました。ロブはマイアよりも上位でフィニッシュしました。イブが1位でフィニッシュしました。ジョーはエリよりも上位でフィニッシュしました。ジョーはマイアよりも下位でフィニッシュしました。\n選択肢:\n(A) イブが2位でフィニッシュした\n(B) エリが2位でフィニッシュした\n(C) ジョーが2位でフィニッシュした\n(D) ロブが2位でフィニッシュした\n(E) マイアが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、青色の本、茶色の本、灰色の本、赤色の本です。緑色の本は茶色の本の左側にあります。灰色の本は青色の本の左側にあります。緑色の本は青色の本の右側にあります。赤色の本は最も左側にあります。\n選択肢:\n(A) 緑色の本は左から2冊目である\n(B) 青色の本は左から2冊目である\n(C) 茶色の本は左から2冊目である\n(D) 灰色の本は左から2冊目である\n(E) 赤色の本は左から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――梨、マンゴー、キウイ、オレンジ、桃――を販売しています。桃はマンゴーよりも高価です。オレンジはキウイよりも高価です。梨が最も高価です。マンゴーはオレンジよりも高価です。\n選択肢:\n(A) 梨が最も安価である\n(B) マンゴーが最も安価である\n(C) キウイが最も安価である\n(D) オレンジが最も安価である\n(E) 桃が最も安価である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：黒い本、紫色の本、黄色い本、オレンジ色の本、赤い本です。黄色い本が最も右側にあります。黒い本はオレンジ色の本の左側にあります。オレンジ色の本は紫色の本の左側にあります。黒い本は左から2冊目です。\n選択肢:\n(A) 黒い本は右から2冊目である\n(B) 紫色の本は右から2冊目である\n(C) 黄色い本は右から2冊目である\n(D) オレンジ色の本は右から2冊目である\n(E) 赤い本は右から2冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、イブ、ミア、ロブ、ダン――がいました。ジョーはダンよりも下位でフィニッシュしました。ミアが1位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはロブよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) イブが3位でフィニッシュした\n(C) ミアが3位でフィニッシュした\n(D) ロブが3位でフィニッシュした\n(E) ダンが3位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、ショウジョウコウカンチョウ、コマドリ、ハチドリ、カラスです。ハチドリはフクロウの左側にあります。ハチドリはショウジョウコウカンチョウの右側にあります。カラスはコマドリの左側にあります。フクロウはカラスの左側にあります。\n選択肢:\n(A) フクロウは左から2番目に位置する\n(B) ショウジョウコウカンチョウは左から2番目に位置する\n(C) コマドリは左から2番目に位置する\n(D) ハチドリは左から2番目に位置する\n(E) カラスは左から2番目に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両が展示されています：ハッチバック、オープンカー、トラクター、トラック、リムジンです。トラクターはハッチバックよりも新しいモデルです。リムジンは2番目に新しいモデルです。トラックはハッチバックよりも古いモデルです。オープンカーは2番目に古いモデルです。\n選択肢:\n(A) ハッチバックが最も古いモデルである\n(B) オープンカーが最も古いモデルである\n(C) トラクターが最も古いモデルである\n(D) トラックが最も古いモデルである\n(E) リムジンが最も古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アダ、エリ、エイミー、ジョー、メル――がいました。アダはエリよりも上位でフィニッシュしました。エイミーはメルよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。メルはエリよりも下位でフィニッシュしました。\n選択肢:\n(A) アダが3位でフィニッシュした\n(B) エリが3位でフィニッシュした\n(C) エイミーが3位でフィニッシュした\n(D) ジョーが3位でフィニッシュした\n(E) メルが3位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：フクロウ、ショウジョウコウカンチョウ、コマドリ、ハチドリ、カラスです。ハチドリはフクロウの左側にあります。ハチドリはショウジョウコウカンチョウの右側にあります。カラスはコマドリの左側にあります。フクロウはカラスの左側にあります。\n選択肢:\n(A) フクロウが最も右側に位置する\n(B) ショウジョウコウカンチョウが最も右側に位置する\n(C) コマドリが最も右側に位置する\n(D) ハチドリが最も右側に位置する\n(E) カラスが最も右側に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、カラス、ワタリガラス、コマドリ、ショウジョウコウカンチョウです。ワタリガラスはフクロウの右側に位置しています。ワタリガラスは左から2番目です。コマドリはカラスの左側に位置しています。コマドリは右から2番目です。\n選択肢:\n(A) フクロウは左から3番目に位置する\n(B) カラスは左から3番目に位置する\n(C) ワタリガラスは左から3番目に位置する\n(D) コマドリは左から3番目に位置する\n(E) ショウジョウコウカンチョウは左から3番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラクター、ステーションワゴン、バス、オートバイ、ミニバンの5台の車両が展示されています。ミニバンはオートバイよりも古い年式です。バスは最も新しい車両です。トラクターは3番目に新しい車両です。ステーションワゴンは2番目に古い車両です。\n選択肢:\n(A) トラクターは3番目に新しい車両である\n(B) ステーションワゴンは3番目に新しい車両である\n(C) バスは3番目に新しい車両である\n(D) オートバイは3番目に新しい車両である\n(E) ミニバンは3番目に新しい車両である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ショウジョウコウカンチョウ、カラス、ハヤブサ、コマドリ、アオカケスです。コマドリはショウジョウコウカンチョウの右側に位置しています。ショウジョウコウカンチョウはアオカケスの右側に位置しています。アオカケスは左から2番目の位置にあります。カラスは最も右側に位置しています。\n選択肢:\n(A) ショウジョウコウカンチョウが最も右側に位置する\n(B) カラスが最も右側に位置する\n(C) ハヤブサが最も右側に位置する\n(D) コマドリが最も右側に位置する\n(E) アオカケスが最も右側に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：アオカケス、ショウジョウコウカンチョウ、タカ、ハチドリ、ウズラです。ウズラはアオカケスの左側にあります。ショウジョウコウカンチョウは左から3番目です。ウズラは左から2番目です。アオカケスはハチドリの左側にあります。\n選択肢:\n(A) アオカケスは左から2番目に位置する\n(B) ショウジョウコウカンチョウは左から2番目に位置する\n(C) タカは左から2番目に位置する\n(D) ハチドリは左から2番目に位置する\n(E) ウズラは左から2番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両が展示されています：オープンカー、トラック、バス、セダン、オートバイです。バスはトラックよりも新しいモデルです。トラックはオープンカーよりも新しいモデルです。セダンは5台の中で2番目に古いモデルです。オートバイはバスよりも新しいモデルです。\n選択肢:\n(A) オープンカーは2番目に新しいモデルである\n(B) トラックは2番目に新しいモデルである\n(C) バスは2番目に新しいモデルである\n(D) セダンは2番目に古いモデルである\n(E) オートバイは2番目に新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます――フクロウ、カラス、ワタリガラス、コマドリ、フコウカンチョウです。ワタリガラスはフクロウの右側に位置しています。ワタリガラスは左から2番目です。コマドリはカラスの左側に位置しています。コマドリは右から2番目です。\n選択肢:\n(A) フクロウが最も左側に位置する\n(B) カラスが最も左側に位置する\n(C) ワタリガラスが最も左側に位置する\n(D) コマドリが最も左側に位置する\n(E) フコウカンチョウが最も左側に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、ハヤブサ、タカ、コマドリ、ウズラです。コマドリはハヤブサの右側に位置しています。ウズラはタカの左側に位置しています。コマドリは左から2番目の位置にあります。タカは右から2番目の位置にあります。\n選択肢:\n(A) カラスが最も左側に位置する\n(B) ハヤブサが最も左側に位置する\n(C) タカが最も左側に位置する\n(D) コマドリが最も左側に位置する\n(E) ウズラが最も左側に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、紫の本、灰色の本、白い本です。白い本は灰色の本の右側にあります。青い本は最も左側にあります。赤い本は灰色の本の左側にあります。赤い本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本は右側から2冊目である\n(B) 赤い本は右側から2冊目である\n(C) 紫の本は右側から2冊目である\n(D) 灰色の本は右側から2冊目である\n(E) 白い本は右側から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、黒い本、緑色の本です。紫色の本は左から3冊目です。黄色い本は黒い本の左側にあります。緑色の本は紫色の本の左側にあります。青い本は緑色の本の左側にあります。\n選択肢:\n(A) 青い本は左から2冊目である\n(B) 紫色の本は左から2冊目である\n(C) 黄色い本は左から2冊目である\n(D) 黒い本は左から2冊目である\n(E) 緑色の本は左から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――リンゴ、ビワ、カンタロープメロン、スイカ、キウイ――を販売しています。スイカはビワよりも高価です。スイカはキウイよりも安価です。ビワはリンゴよりも高価です。カンタロープメロンが最も安価です。\n選択肢:\n(A) リンゴが最も安価である\n(B) ビワが最も安価である\n(C) カンタロープメロンが最も安価である\n(D) スイカが最も安価である\n(E) キウイが最も安価である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラクター、ステーションワゴン、ミニバン、セダン、ハッチバックです。ミニバンはセダンよりも古い年式です。トラクターはハッチバックよりも古い年式です。ミニバンは最も新しい車両から数えて3番目です。ステーションワゴンは最も新しい車両から数えて2番目です。\n選択肢:\n(A) トラクターは最も新しい車両から数えて2番目に古い\n(B) ステーションワゴンは最も新しい車両から数えて2番目に古い\n(C) ミニバンは最も新しい車両から数えて2番目に古い\n(D) セダンは最も新しい車両から数えて2番目に古い\n(E) ハッチバックは最も新しい車両から数えて2番目に古い", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、オレンジ色の本、灰色の本、黄色の本、紫色の本です。緑色の本は最も右側に位置しています。灰色の本はオレンジ色の本の右側にあります。紫色の本は黄色の本の左側に位置しています。紫色の本は灰色の本の右側にあります。\n選択肢:\n(A) 緑色の本が最も左側にある\n(B) オレンジ色の本が最も左側にある\n(C) 灰色の本が最も左側にある\n(D) 黄色の本が最も左側にある\n(E) 紫色の本が最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます――フクロウ、オナガフクロウ、コマドリ、カラス、ワタリガラスです。オナガフクロウはオナガフクロウの左側にあります。ワタリガラスは右側から2番目の位置にあります。コマドリはワタリガラスの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) フクロウが最も右側に位置する\n(B) オナガフクロウが最も右側に位置する\n(C) コマドリが最も右側に位置する\n(D) カラスが最も右側に位置する\n(E) ワタリガラスが最も右側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、ダン、ミア、エリ、メル――がいました。エイミーはメルよりも上位でフィニッシュしました。ミアが1位でフィニッシュしました。エイミーはエリよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが3位でフィニッシュした\n(B) ダンが3位でフィニッシュした\n(C) ミアが3位でフィニッシュした\n(D) エリが3位でフィニッシュした\n(E) メルが3位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：フクロウ、ハチドリ、カラス、タカ、コマドリです。タカはフクロウの右側に位置しています。ハチドリはタカの右側に位置しています。カラスは右側から2番目の位置にあります。コマドリは左側から2番目の位置にあります。\n選択肢:\n(A) フクロウは左側から2番目の位置にある\n(B) ハチドリは左側から2番目の位置にある\n(C) カラスは左側から2番目の位置にある\n(D) タカは左側から2番目の位置にある\n(E) コマドリは左側から2番目の位置にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：コマドリ、ウズラ、フクロウ、カラス、タカです。タカは左から3番目の位置にあります。タカはカラスの右側に位置しています。ウズラはカラスの左側に位置しています。コマドリはフクロウの右側に位置しています。\n選択肢:\n(A) コマドリが最も左側にいる\n(B) ウズラが最も左側にいる\n(C) フクロウが最も左側にいる\n(D) カラスが最も左側にいる\n(E) タカが最も左側にいる", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ハッチバック、リムジン、セダン、バス、トラクターです。トラクターはハッチバックよりも新しいモデルです。バスは5台の中で2番目に古い車両です。ハッチバックはセダンよりも新しいモデルです。リムジンは最も新しい車両です。\n選択肢:\n(A) ハッチバックは2番目に古いモデルである\n(B) リムジンは2番目に古いモデルである\n(C) セダンは2番目に古いモデルである\n(D) バスは2番目に古いモデルである\n(E) トラクターは2番目に古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ショウジョウコウカンチョウ、コマドリ、アオカケス、ウズラ、ワタリガラスです。コマドリはワタリガラスの右側に位置しています。ショウジョウコウカンチョウは最も左側にあります。ワタリガラスはアオカケスの右側に位置しています。アオカケスは左から3番目の位置にあります。\n選択肢:\n(A) ショウジョウコウカンチョウが最も左側にある\n(B) コマドリが最も左側にある\n(C) アオカケスが最も左側にある\n(D) ウズラが最も左側にある\n(E) ワタリガラスが最も左側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両が展示されています：セダン、オープンカー、ステーションワゴン、バス、オートバイです。セダンは5台中2番目に新しいモデルです。ステーションワゴンはオープンカーよりも新しいモデルです。セダンはオートバイよりも古いモデルです。バスは最も古いモデルです。\n選択肢:\n(A) セダンが最も新しいモデルである\n(B) オープンカーが最も新しいモデルである\n(C) ステーションワゴンが最も新しいモデルである\n(D) バスが最も新しいモデルである\n(E) オートバイが最も新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：緑色の本、青色の本、白色の本、紫色の本、黄色の本です。青色の本は黄色の本の右側にあります。白色の本は黄色の本の左側にあります。青色の本は右側から2冊目です。紫色の本は左側から2冊目です。\n選択肢:\n(A) 緑色の本は左側から3冊目である\n(B) 青色の本は左側から3冊目である\n(C) 白色の本は左側から3冊目である\n(D) 紫色の本は左側から3冊目である\n(E) 黄色の本は左側から3冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：鶉、フクロウ、ワタリガラス、ハヤブサ、コマドリです。フクロウが最も左側にあります。コマドリはワタリガラスの左側にあります。鶉が最も右側にあります。ワタリガラスは左から3番目の位置にあります。\n選択肢:\n(A) 鶉が最も左側にある\n(B) フクロウが最も左側にある\n(C) ワタリガラスが最も左側にある\n(D) ハヤブサが最も左側にある\n(E) コマドリが最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：灰色の本、赤い本、紫色の本、青い本、黒い本です。赤い本は灰色の本の右側にあります。黒い本は青い本の左側にあります。青い本は灰色の本の左側にあります。紫色の本は右側から2冊目に位置しています。\n選択肢:\n(A) 灰色の本が一番右側にある\n(B) 赤い本が一番右側にある\n(C) 紫色の本が一番右側にある\n(D) 青い本が一番右側にある\n(E) 黒い本が一番右側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：茶色の本、黄色の本、オレンジ色の本、緑色の本、灰色の本です。緑色の本は灰色の本の左側にあります。茶色の本は左から3冊目です。灰色の本は右から2冊目です。黄色の本は緑色の本の左側にあります。\n選択肢:\n(A) 茶色の本は右から2冊目である\n(B) 黄色の本は右から2冊目である\n(C) オレンジ色の本は右から2冊目である\n(D) 緑色の本は右から2冊目である\n(E) 灰色の本は右から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラクター、ステーションワゴン、ミニバン、セダン、ハッチバックです。ミニバンはセダンよりも古い年式です。トラクターはハッチバックよりも古い年式です。ミニバンは最も新しい年式の3番目です。ステーションワゴンは最も新しい年式の2番目です。\n選択肢:\n(A) トラクターが最も古い\n(B) ステーションワゴンが最も古い\n(C) ミニバンが最も古い\n(D) セダンが最も古い\n(E) ハッチバックが最も古い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：フクロウ、コマドリ、アオカケス、タカ、ハチドリです。フクロウは右側から2番目の位置にあります。コマドリは左側から2番目の位置にあります。コマドリはアオカケスの右側に位置しています。ハチドリはタカの右側にいます。\n選択肢:\n(A) フクロウは右側から2番目の位置にある\n(B) コマドリは右側から2番目の位置にある\n(C) アオカケスは右側から2番目の位置にある\n(D) タカは右側から2番目の位置にある\n(E) ハチドリは右側から2番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：セダン、オープンカー、ステーションワゴン、バス、オートバイです。セダンは5台中2番目に新しいモデルです。ステーションワゴンはオープンカーよりも新しいモデルです。セダンはオートバイよりも古いモデルです。バスは最も古いモデルです。\n選択肢:\n(A) セダンが最も古いモデルである\n(B) オープンカーが最も古いモデルである\n(C) ステーションワゴンが最も古いモデルである\n(D) バスが最も古いモデルである\n(E) オートバイが最も古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――リンゴ、マンゴー、オレンジ、プラム、ナシ――を販売しています。オレンジはマンゴーよりも高価です。プラムが最も安価です。リンゴはマンゴーよりも安価です。ナシはオレンジよりも高価です。\n選択肢:\n(A) リンゴは2番目に安価な果物である\n(B) マンゴーは2番目に安価な果物である\n(C) オレンジは2番目に安価な果物である\n(D) プラムは2番目に安価な果物である\n(E) ナシは2番目に安価な果物である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：茶色の本、黄色の本、オレンジ色の本、緑色の本、灰色の本です。緑色の本は灰色の本の左側にあります。茶色の本は左から3冊目です。灰色の本は右から2冊目です。黄色の本は緑色の本の左側にあります。\n選択肢:\n(A) 茶色の本が一番右側にある\n(B) 黄色の本が一番右側にある\n(C) オレンジ色の本が一番右側にある\n(D) 緑色の本が一番右側にある\n(E) 灰色の本が一番右側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――オレンジ、リンゴ、桃、カンタロープメロン、ビワ――を販売しています。ビワはカンタロープメロンよりも安価です。カンタロープメロンはリンゴよりも安価です。オレンジは最も高価です。リンゴは価格が3番目に高い種類です。\n選択肢:\n(A) オレンジは2番目に安価な果物である\n(B) リンゴは2番目に安価な果物である\n(C) 桃は2番目に安価な果物である\n(D) カンタロープメロンは2番目に安価な果物である\n(E) ビワは2番目に安価な果物である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、イブ、メル、ミア、ロブ――がいました。イブが最下位でフィニッシュしました。ロブはメルよりも上位でフィニッシュしました。エイミーはロブよりも上位でフィニッシュしました。ミアは3位でフィニッシュしました。\n選択肢:\n(A) エイミーが3位でフィニッシュした\n(B) イブが3位でフィニッシュした\n(C) メルが3位でフィニッシュした\n(D) ミアが3位でフィニッシュした\n(E) ロブが3位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、オープンカー、セダン、ステーションワゴン、バス、リムジンの5台の車両が展示されています。セダンはステーションワゴンよりも新しいモデルです。リムジンが最も新しいモデルです。バスは2番目に新しいモデルです。オープンカーは2番目に古いモデルです。\n選択肢:\n(A) オープンカーが最も新しいモデルである\n(B) セダンが最も新しいモデルである\n(C) ステーションワゴンが最も新しいモデルである\n(D) バスが最も新しいモデルである\n(E) リムジンが最も新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――マンゴー、梨、カンタロープメロン、スイカ、ビワ――を販売しています。マンゴーはビワよりも高価です。カンタロープメロンはマンゴーよりも高価です。スイカはカンタロープメロンよりも高価です。梨は最も安価な果物です。\n選択肢:\n(A) マンゴーは価格が3番目に高い\n(B) 梨は価格が3番目に高い\n(C) カンタロープメロンは価格が3番目に高い\n(D) スイカは価格が3番目に高い\n(E) ビワは価格が3番目に高い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、梨、カンタロープメロン、スイカ、ビワ――を販売しています。マンゴーはビワよりも高価です。カンタロープメロンはマンゴーよりも高価です。スイカはカンタロープメロンよりも高価です。梨は最も安価な果物です。\n選択肢:\n(A) マンゴーは2番目に安価な果物である\n(B) 梨は2番目に安価な果物である\n(C) カンタロープメロンは2番目に安価な果物である\n(D) スイカは2番目に安価な果物である\n(E) ビワは2番目に安価な果物である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：フクロウ、コマドリ、アオカケス、タカ、ハチドリです。フクロウは右側から2番目の位置にあります。コマドリは左側から2番目の位置にあります。コマドリはアオカケスの右側に位置しています。ハチドリはタカの右側にいます。\n選択肢:\n(A) フクロウは左側から3番目の位置にある\n(B) コマドリは左側から3番目の位置にある\n(C) アオカケスは左側から3番目の位置にある\n(D) タカは左側から3番目の位置にある\n(E) ハチドリは左側から3番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：オープンカー、セダン、トラクター、ミニバン、リムジンです。トラクターはミニバンよりも新しいモデルです。トラクターはリムジンよりも古いモデルです。オープンカーはセダンよりも古いモデルです。オープンカーは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) オープンカーが最も古いモデルである\n(B) セダンが最も古いモデルである\n(C) トラクターが最も古いモデルである\n(D) ミニバンが最も古いモデルである\n(E) リムジンが最も古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――メル、ダン、エイミー、ジョー、イブ――がいました。エイミーはダンよりも下位でフィニッシュしました。メルが1位でフィニッシュしました。ジョーはダンよりも上位でフィニッシュしました。イブが最下位でフィニッシュしました。\n選択肢:\n(A) メルが2位でフィニッシュした\n(B) ダンが2位でフィニッシュした\n(C) エイミーが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) イブが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：鶉、ハチドリ、アオカケス、鷹、コマドリです。コマドリは左から2番目の位置にあります。鶉は最も左側の位置にあります。ハチドリは鶉の左側にあります。鷹は左から3番目の位置にあります。\n選択肢:\n(A) 鶉は左から3番目の位置にある\n(B) ハチドリは左から3番目の位置にある\n(C) アオカケスは左から3番目の位置にある\n(D) 鷹は左から3番目の位置にある\n(E) コマドリは左から3番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、茶色の本、黄色い本、オレンジ色の本です。赤い本は茶色の本の左側に位置しています。黄色い本はオレンジ色の本の右側にあります。茶色の本は左から2冊目です。黄色い本は青い本の左側に位置しています。\n選択肢:\n(A) 青い本が左から2冊目である\n(B) 赤い本が左から2冊目である\n(C) 茶色の本が左から2冊目である\n(D) 黄色い本が左から2冊目である\n(E) オレンジ色の本が左から2冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：黄色の本、茶色の本、灰色の本、黒色の本、紫色の本です。黄色の本は紫色の本の右側にあります。黒色の本は紫色の本の左側にあります。黒色の本は左から3冊目です。茶色の本は最も左側にあります。\n選択肢:\n(A) 黄色の本は左から2冊目である\n(B) 茶色の本は左から2冊目である\n(C) 灰色の本は左から2冊目である\n(D) 黒色の本は左から2冊目である\n(E) 紫色の本は左から2冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、リンゴ、マンゴー、ナシ、カンタロープ――を販売しています。スイカはカンタロープよりも高価です。マンゴーはナシよりも安価です。リンゴは最も安価な2番目の価格です。スイカはマンゴーよりも安価です。\n選択肢:\n(A) スイカは価格が3番目に高い\n(B) リンゴは価格が3番目に高い\n(C) マンゴーは価格が3番目に高い\n(D) ナシは価格が3番目に高い\n(E) カンタロープは価格が3番目に高い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、メル、ロブ、ジョー、アダ――がいました。ジョーは2位でフィニッシュしました。ジョーはエイミーよりも下位でフィニッシュしました。メルは5位（最下位から2番目）でフィニッシュしました。アダが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが2位でフィニッシュした\n(B) メルが2位でフィニッシュした\n(C) ロブが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) アダが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラクター、ステーションワゴン、バス、オートバイ、ミニバンの5台の車両が展示されています。ミニバンはオートバイよりも古い年式です。バスは最も新しい車両です。トラクターは3番目に新しい車両です。ステーションワゴンは2番目に古い車両です。\n選択肢:\n(A) トラクターは3番目に新しい車両である\n(B) ステーションワゴンは3番目に新しい車両である\n(C) バスは3番目に新しい車両である\n(D) オートバイは3番目に新しい車両である\n(E) ミニバンは3番目に新しい車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――リンゴ、オレンジ、スイカ、ナシ、マンゴー――を販売しています。リンゴはオレンジよりも高価です。オレンジはマンゴーよりも高価です。リンゴは価格が3番目に高い果物です。ナシはスイカよりも高価です。\n選択肢:\n(A) リンゴが最も高価である\n(B) オレンジが最も高価である\n(C) スイカが最も高価である\n(D) ナシが最も高価である\n(E) マンゴーが最も高価である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、ステーションワゴン、セダン、トラクター、オートバイ、リムジンの5台の車両が展示されています。トラクターはオートバイよりも新しい年式です。オートバイはセダンよりも新しい年式です。リムジンが最も古い年式です。ステーションワゴンが最も新しい年式です。\n選択肢:\n(A) ステーションワゴンが最も新しい\n(B) セダンが最も新しい\n(C) トラクターが最も新しい\n(D) オートバイが最も新しい\n(E) リムジンが最も新しい", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、紫の本、灰色の本、白い本です。白い本は灰色の本の右側にあります。青い本は最も左側にあります。赤い本は灰色の本の左側にあります。赤い本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本が最も右側にある\n(B) 赤い本が最も右側にある\n(C) 紫の本が最も右側にある\n(D) 灰色の本が最も右側にある\n(E) 白い本が最も右側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――リンゴ、オレンジ、スイカ、ナシ、マンゴー――を販売しています。リンゴはオレンジよりも高価です。オレンジはマンゴーよりも高価です。リンゴは価格が3番目に高い果物です。ナシはスイカよりも高価です。\n選択肢:\n(A) リンゴは価格が2番目に高い\n(B) オレンジは価格が2番目に高い\n(C) スイカは価格が2番目に高い\n(D) ナシは価格が2番目に高い\n(E) マンゴーは価格が2番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：緑色の本、オレンジ色の本、茶色の本、黄色の本、青色の本です。オレンジ色の本は黄色の本の右側にあります。緑色の本は最も右側に位置しています。黄色の本は青色の本の右側にあります。オレンジ色の本は左から3冊目です。\n選択肢:\n(A) 緑色の本は左から2冊目である\n(B) オレンジ色の本は左から2冊目である\n(C) 茶色の本は左から2冊目である\n(D) 黄色の本は左から2冊目である\n(E) 青色の本は左から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黒い本、茶色の本、黄色い本、オレンジ色の本、赤い本です。黒い本は黄色い本の左側にあります。赤い本は左から3冊目です。茶色の本は左から2冊目です。黄色い本はオレンジ色の本の左側にあります。\n選択肢:\n(A) 黒い本は左から3冊目である\n(B) 茶色の本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) オレンジ色の本は左から3冊目である\n(E) 赤い本は左から3冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：ショウジョウコウカンチョウ、コマドリ、アオカケス、ウズラ、ワタリガラスです。コマドリはワタリガラスの右側に位置しています。ショウジョウコウカンチョウは最も左側にあります。ワタリガラスはアオカケスの右側に位置しています。アオカケスは左から3番目の位置にあります。\n選択肢:\n(A) ショウジョウコウカンチョウが最も右側に位置する\n(B) コマドリが最も右側に位置する\n(C) アオカケスが最も右側に位置する\n(D) ウズラが最も右側に位置する\n(E) ワタリガラスが最も右側に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、アナ、エリ、ミア、エイミー――がいました。エイミーはエリよりも上位でフィニッシュしました。アナはエイミーよりも上位でフィニッシュしました。ミアはエリよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが3位でフィニッシュした\n(B) アナが3位でフィニッシュした\n(C) エリが3位でフィニッシュした\n(D) ミアが3位でフィニッシュした\n(E) エイミーが3位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、アダ、ダン、ジョー、メル――がいました。アダはメルよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。\n選択肢:\n(A) ロブが3位でフィニッシュした\n(B) アダが3位でフィニッシュした\n(C) ダンが3位でフィニッシュした\n(D) ジョーが3位でフィニッシュした\n(E) メルが3位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：ショウジョウコウカンチョウ、コマドリ、アオカケス、ウズラ、ワタリガラスです。コマドリはワタリガラスの右側に位置しています。ショウジョウコウカンチョウは最も左側にあります。ワタリガラスはアオカケスの右側に位置しています。アオカケスは左から3番目の位置にあります。\n選択肢:\n(A) ショウジョウコウカンチョウが左から3番目に位置する\n(B) コマドリが左から3番目に位置する\n(C) アオカケスが左から3番目に位置する\n(D) ウズラが左から3番目に位置する\n(E) ワタリガラスが左から3番目に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、黒い本、緑色の本です。紫色の本は左から3冊目に位置しています。黄色い本は黒い本の左側に配置されています。緑色の本は紫色の本の左側に位置しています。青い本は緑色の本の左側に配置されています。\n選択肢:\n(A) 青い本が最も左側にある\n(B) 紫色の本が最も左側にある\n(C) 黄色い本が最も左側にある\n(D) 黒い本が最も左側にある\n(E) 緑色の本が最も左側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ハヤブサ、ワタリガラス、ショウジョウコウカンチョウ、タカ、カラスです。ショウジョウコウカンチョウは右側から2番目の位置にあります。タカはハヤブサの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。カラスは最も右側に位置しています。\n選択肢:\n(A) ハヤブサが最も左側にある\n(B) ワタリガラスが最も左側にある\n(C) ショウジョウコウカンチョウが最も左側にある\n(D) タカが最も左側にある\n(E) カラスが最も左側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――オレンジ、カンタロープメロン、桃、ビワ、キウイ――を販売しています。桃はオレンジよりも高価です。カンタロープメロンは桃よりも高価です。キウイは最も高価な3番目の果物です。ビワは最も安価な2番目の果物です。\n選択肢:\n(A) オレンジが最も安価である\n(B) カンタロープメロンが最も安価である\n(C) 桃が最も安価である\n(D) ビワが最も安価である\n(E) キウイが最も安価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両――ミニバン、ハッチバック、バス、オープンカー、オートバイ――が展示されています。ハッチバックはオープンカーよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。バスはオートバイよりも古いモデルです。ミニバンが最も新しいモデルです。\n選択肢:\n(A) ミニバンが最も古いモデルである\n(B) ハッチバックが最も古いモデルである\n(C) バスが最も古いモデルである\n(D) オープンカーが最も古いモデルである\n(E) オートバイが最も古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ワタリガラス、フクロウ、ショウジョウコウカンチョウ、ハチドリ、コマドリです。ショウジョウコウカンチョウは最も右側に位置しています。ワタリガラスはフクロウの左側にいます。コマドリはハチドリの右側にいます。ハチドリは左から3番目の位置にあります。\n選択肢:\n(A) ワタリガラスが最も左側に位置する\n(B) フクロウが最も左側に位置する\n(C) ショウジョウコウカンチョウが最も左側に位置する\n(D) ハチドリが最も左側に位置する\n(E) コマドリが最も左側に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、ロブ、アナ、エリ、マイア――がいました。エリはマイアよりも下位でフィニッシュしました。イブが1位でフィニッシュしました。アナはエリよりも下位でフィニッシュしました。ロブが2位でフィニッシュしました。\n選択肢:\n(A) イブが1位でフィニッシュした\n(B) ロブが1位でフィニッシュした\n(C) アナが1位でフィニッシュした\n(D) エリが1位でフィニッシュした\n(E) マイアが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラック、ステーションワゴン、オートバイ、リムジン、ハッチバックの5台の車両が展示されています。このうちオートバイは最も新しい車両から2番目に古いものです。トラックはリムジンよりも新しい車両です。オートバイはステーションワゴンよりも古い車両です。リムジンはハッチバックよりも新しい車両です。\n選択肢:\n(A) トラックは最も新しい車両から3番目に古いものである\n(B) ステーションワゴンは最も新しい車両から3番目に古いものである\n(C) オートバイは最も新しい車両から3番目に古いものである\n(D) リムジンは最も新しい車両から3番目に古いものである\n(E) ハッチバックは最も新しい車両から3番目に古いものである", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、アナ、エイミー、ミャ、イブ――がいました。ジョーが最下位でフィニッシュしました。アナが2位でフィニッシュしました。ミャが最下位から2番目でフィニッシュしました。イブはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) アナが3位でフィニッシュした\n(C) エイミーが3位でフィニッシュした\n(D) ミャが3位でフィニッシュした\n(E) イブが3位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、リムジン、セダン、バス、ハッチバック、オートバイの5台の車両が展示されています。ハッチバックはセダンよりも古い年代の車両です。ハッチバックは5台の中で2番目に古い車両です。リムジンはバスよりも古い年代の車両です。バスはセダンよりも新しい年代の車両です。バスは5台の中で2番目に新しい車両です。\n選択肢:\n(A) リムジンが2番目に古い車両である\n(B) セダンが2番目に古い車両である\n(C) バスが2番目に新しい車両である\n(D) ハッチバックが2番目に古い車両である\n(E) オートバイが2番目に新しい車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、紫の本、灰色の本、白い本です。白い本は灰色の本の右側にあります。青い本は最も左側にあります。赤い本は灰色の本の左側にあります。赤い本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本が最も左側にある\n(B) 赤い本が最も左側にある\n(C) 紫の本が最も左側にある\n(D) 灰色の本が最も左側にある\n(E) 白い本が最も左側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラック、ステーションワゴン、オートバイ、オープンカー、ハッチバックです。オープンカーはトラックよりも新しいモデルです。ステーションワゴンはハッチバックよりも新しいモデルです。オープンカーはハッチバックよりも古いモデルです。ステーションワゴンは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) トラックは2番目に古いモデルである\n(B) ステーションワゴンは2番目に古いモデルである\n(C) オートバイは2番目に古いモデルである\n(D) オープンカーは2番目に古いモデルである\n(E) ハッチバックは2番目に古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、ハヤブサ、タカ、コマドリ、ウズラです。コマドリはハヤブサの右側に位置しています。ウズラはタカの左側に位置しています。コマドリは左から2番目の位置にあります。タカは右から2番目の位置にあります。\n選択肢:\n(A) カラスが左から2番目の位置にある\n(B) ハヤブサが左から2番目の位置にある\n(C) タカが左から2番目の位置にある\n(D) コマドリが左から2番目の位置にある\n(E) ウズラが左から2番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両が展示されています：ミニバン、ハッチバック、バス、オープンカー、オートバイです。ハッチバックはオープンカーよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。バスはオートバイよりも古いモデルです。ミニバンは最も新しいモデルです。\n選択肢:\n(A) ミニバンは2番目に古いモデルである\n(B) ハッチバックは2番目に古いモデルである\n(C) バスは2番目に古いモデルである\n(D) オープンカーは2番目に古いモデルである\n(E) オートバイは2番目に古いモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、ショウジョウコウカンチョウ、コマドリ、ハチドリ、カラスです。ハチドリはフクロウの左側にあります。ハチドリはショウジョウコウカンチョウの右側にあります。カラスはコマドリの左側にあります。フクロウはカラスの左側にあります。\n選択肢:\n(A) フクロウは右側から2番目に位置する\n(B) ショウジョウコウカンチョウは右側から2番目に位置する\n(C) コマドリは右側から2番目に位置する\n(D) ハチドリは右側から2番目に位置する\n(E) カラスは右側から2番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ステーションワゴン、トラクター、トラック、ハッチバック、ミニバンです。ステーションワゴンはトラクターよりも新しいモデルです。トラックはトラクターよりも古いモデルです。ミニバンはハッチバックよりも新しいモデルです。ハッチバックは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) ステーションワゴンは2番目に古いモデルである\n(B) トラクターは2番目に古いモデルである\n(C) トラックは2番目に古いモデルである\n(D) ハッチバックは2番目に新しいモデルである\n(E) ミニバンは2番目に新しいモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、青色の本、白色の本、紫色の本、黄色の本です。青色の本は黄色の本の右側にあります。白色の本は黄色の本の左側にあります。青色の本は右側から2冊目です。紫色の本は左側から2冊目です。\n選択肢:\n(A) 緑色の本は右側から2冊目である\n(B) 青色の本は右側から2冊目である\n(C) 白色の本は右側から2冊目である\n(D) 紫色の本は右側から2冊目である\n(E) 黄色の本は右側から2冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両――ミニバン、ハッチバック、バス、オープンカー、オートバイ――が展示されています。ハッチバックはオープンカーよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。バスはオートバイよりも古いモデルです。ミニバンが最も新しいモデルです。\n選択肢:\n(A) ミニバンは3番目に新しいモデルである\n(B) ハッチバックは3番目に新しいモデルである\n(C) バスは3番目に新しいモデルである\n(D) オープンカーは3番目に新しいモデルである\n(E) オートバイは3番目に新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黒い本、紫色の本、黄色い本、オレンジ色の本、赤い本です。黄色い本が最も右側に位置しています。黒い本はオレンジ色の本の左側に配置されています。オレンジ色の本は紫色の本の左側に位置しています。黒い本は左から2番目にあります。\n選択肢:\n(A) 黒い本が最も右側にある\n(B) 紫色の本が最も右側にある\n(C) 黄色い本が最も右側にある\n(D) オレンジ色の本が最も右側にある\n(E) 赤い本が最も右側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、コマドリ、ウズラ、アオカケス、ハヤブサです。コマドリはウズラの左側にあります。ハヤブサは左から3番目の位置です。カラスはハヤブサの左側にあります。アオカケスは最も左側の位置です。\n選択肢:\n(A) カラスは左から2番目の位置にある\n(B) コマドリは左から2番目の位置にある\n(C) ウズラは左から2番目の位置にある\n(D) アオカケスは左から2番目の位置にある\n(E) ハヤブサは左から2番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ステーションワゴン、セダン、トラクター、オートバイ、リムジンです。トラクターはオートバイよりも新しく、オートバイはセダンよりも新しく、リムジンが最も古い車両です。ステーションワゴンは最も新しい車両です。\n選択肢:\n(A) ステーションワゴンは2番目に古い車両である\n(B) セダンは2番目に古い車両である\n(C) トラクターは2番目に古い車両である\n(D) オートバイは2番目に古い車両である\n(E) リムジンは2番目に古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――ビワ、桃、梨、プラム、スイカ――を販売しています。スイカが最も高価です。桃はビワよりも高価です。プラムは2番目に安価です。梨は3番目に高価です。\n選択肢:\n(A) ビワが最も安価である\n(B) 桃が最も安価である\n(C) 梨が最も安価である\n(D) プラムが最も安価である\n(E) スイカが最も安価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――リンゴ、オレンジ、スイカ、ナシ、マンゴー――を販売しています。リンゴはオレンジよりも高価です。オレンジはマンゴーよりも高価です。リンゴは価格が3番目に高い果物です。ナシはスイカよりも高価です。\n選択肢:\n(A) リンゴは最も安価な2番目の果物である\n(B) オレンジは最も安価な2番目の果物である\n(C) スイカは最も安価な2番目の果物である\n(D) ナシは最も安価な2番目の果物である\n(E) マンゴーは最も安価な2番目の果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、フクロウ、コウヨウチョウ、ハチドリ、コマドリです。コウヨウチョウは最も右側に位置しています。カラスはフクロウの左側にいます。コマドリはハチドリの右側にいます。ハチドリは左から3番目の位置にあります。\n選択肢:\n(A) カラスは右側から2番目に位置する\n(B) フクロウは右側から2番目に位置する\n(C) コウヨウチョウは右側から2番目に位置する\n(D) ハチドリは右側から2番目に位置する\n(E) コマドリは右側から2番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：白い本、灰色の本、紫色の本、黄色い本、黒い本です。黄色い本は白い本の左側にあります。黒い本は黄色い本の左側にあります。紫色の本は最も右側に位置しています。白い本は灰色の本の左側にあります。\n選択肢:\n(A) 白い本は左から2冊目である\n(B) 灰色の本は左から2冊目である\n(C) 紫色の本は左から2冊目である\n(D) 黄色い本は左から2冊目である\n(E) 黒い本は左から2冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エイミー、アダ、ロブ、ジョー――がいました。エイミーは2番目に下位でフィニッシュしました。ロブはイブよりも下位でフィニッシュしました。アダはジョーよりも上位でフィニッシュしました。ジョーは2位でフィニッシュしました。\n選択肢:\n(A) イブが最下位でフィニッシュした\n(B) エイミーが最下位でフィニッシュした\n(C) アダが最下位でフィニッシュした\n(D) ロブが最下位でフィニッシュした\n(E) ジョーが最下位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黄色の本、茶色の本、灰色の本、黒色の本、紫色の本です。黄色の本は紫色の本の右側にあります。黒色の本は紫色の本の左側にあります。黒色の本は左から3冊目です。茶色の本は最も左側にあります。\n選択肢:\n(A) 黄色の本は右側から2冊目である\n(B) 茶色の本は右側から2冊目である\n(C) 灰色の本は右側から2冊目である\n(D) 黒色の本は右側から2冊目である\n(E) 紫色の本は右側から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、ミア、イブ、エイミー、アナ――がいました。イブはジョーよりも下位でフィニッシュしました。アナはエイミーよりも下位でフィニッシュしました。イブはエイミーよりも上位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが3位でフィニッシュした\n(B) ミアが3位でフィニッシュした\n(C) イブが3位でフィニッシュした\n(D) エイミーが3位でフィニッシュした\n(E) アナが3位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――ビワ、桃、梨、プラム、スイカ――を販売しています。スイカが最も高価です。桃はビワよりも高価です。プラムは2番目に安価な種類です。梨は3番目に高価な種類です。\n選択肢:\n(A) ビワが最も高価である\n(B) 桃が最も高価である\n(C) 梨が最も高価である\n(D) プラムが最も高価である\n(E) スイカが最も高価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、ロブ、アナ、エリ、マイア――がいました。エリはマイアよりも下位でフィニッシュしました。イブが1位でフィニッシュしました。アナはエリよりも下位でフィニッシュしました。ロブが2位でフィニッシュしました。\n選択肢:\n(A) イブが2位でフィニッシュした\n(B) ロブが2位でフィニッシュした\n(C) アナが2位でフィニッシュした\n(D) エリが2位でフィニッシュした\n(E) マイアが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、アナ、エリ、ミア、エイミー――がいました。エイミーはエリよりも上位でフィニッシュしました。アナはエイミーよりも上位でフィニッシュしました。ミアはエリよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが2位でフィニッシュした\n(B) アナが2位でフィニッシュした\n(C) エリが2位でフィニッシュした\n(D) ミアが2位でフィニッシュした\n(E) エイミーが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――キウイ、梨、桃、ビワ、リンゴ――を販売しています。ビワはキウイよりも高価です。梨は桃よりも高価です。リンゴはビワよりも高価です。リンゴは桃よりも安価です。\n選択肢:\n(A) キウイは2番目に高価な果物である\n(B) 梨は2番目に高価な果物である\n(C) 桃は2番目に高価な果物である\n(D) ビワは2番目に高価な果物である\n(E) リンゴは2番目に高価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、イブ、メル、ミア、ロブ――がいました。イブが最下位でフィニッシュしました。ロブはメルよりも上位でフィニッシュしました。エイミーはロブよりも上位でフィニッシュしました。ミアは3位でフィニッシュしました。\n選択肢:\n(A) エイミーが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) メルが2位でフィニッシュした\n(D) ミアが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます――フクロウ、オナガフクロウ、コマドリ、カラス、ワタリガラスです。オナガフクロウはオナガフクロウの左側にあります。ワタリガラスは右側から2番目の位置にあります。コマドリはワタリガラスの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) フクロウは右側から2番目の位置にある\n(B) オナガフクロウは右側から2番目の位置にある\n(C) コマドリは右側から2番目の位置にある\n(D) カラスは右側から2番目の位置にある\n(E) ワタリガラスは右側から2番目の位置にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：フクロウ、ハチドリ、カラス、タカ、コマドリです。タカはフクロウの右側に位置しています。ハチドリはタカの右側に位置しています。カラスは右側から2番目の位置にあります。コマドリは左側から2番目の位置にあります。\n選択肢:\n(A) フクロウは左側から3番目の位置にある\n(B) ハチドリは左側から3番目の位置にある\n(C) カラスは左側から3番目の位置にある\n(D) タカは左側から3番目の位置にある\n(E) コマドリは左側から3番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラック、ステーションワゴン、オートバイ、オープンカー、ハッチバックです。オープンカーはトラックよりも新しいモデルです。ステーションワゴンはハッチバックよりも新しいモデルです。オープンカーはハッチバックよりも古いモデルです。ステーションワゴンは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) トラックが最も古いモデルである\n(B) ステーションワゴンが最も古いモデルである\n(C) オートバイが最も古いモデルである\n(D) オープンカーが最も古いモデルである\n(E) ハッチバックが最も古いモデルである", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラック、ステーションワゴン、オートバイ、オープンカー、ハッチバックです。オープンカーはトラックよりも新しいモデルです。ステーションワゴンはハッチバックよりも新しいモデルです。オープンカーはハッチバックよりも古いモデルです。ステーションワゴンは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) トラックは5台の中で3番目に新しいモデルである\n(B) ステーションワゴンは5台の中で3番目に新しいモデルである\n(C) オートバイは5台の中で3番目に新しいモデルである\n(D) オープンカーは5台の中で3番目に新しいモデルである\n(E) ハッチバックは5台の中で3番目に新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：灰色の本、赤い本、紫色の本、青い本、黒い本です。赤い本は灰色の本の右側にあります。黒い本は青い本の左側にあります。青い本は灰色の本の左側にあります。紫色の本は右側から3冊目に位置しています。\n選択肢:\n(A) 灰色の本は左から3冊目である\n(B) 赤い本は左から3冊目である\n(C) 紫色の本は左から3冊目である\n(D) 青い本は左から3冊目である\n(E) 黒い本は左から3冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、赤い本、灰色の本です。黄色い本は灰色の本の右側にあります。紫色の本は灰色の本の左側にあります。赤い本は青い本の右側にあります。紫色の本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本は右から2冊目である\n(B) 紫色の本は右から2冊目である\n(C) 黄色い本は右から2冊目である\n(D) 赤い本は右から2冊目である\n(E) 灰色の本は右から2冊目である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――ビワ、桃、梨、プラム、スイカ――を販売しています。スイカが最も高価です。桃はビワよりも高価です。プラムは最も安価な2番目の価格です。梨は最も高価な3番目の価格です。\n選択肢:\n(A) ビワは最も安価な2番目の価格である\n(B) 桃は最も安価な2番目の価格である\n(C) 梨は最も安価な2番目の価格である\n(D) プラムは最も安価な2番目の価格である\n(E) スイカは最も安価な2番目の価格である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、アナ、エリ、ミア、エイミー――がいました。エイミーはエリよりも上位でフィニッシュしました。アナはエイミーよりも上位でフィニッシュしました。ミアはエリよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが2位でフィニッシュした\n(B) アナが2位でフィニッシュした\n(C) エリが2位でフィニッシュした\n(D) ミアが2位でフィニッシュした\n(E) エイミーが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黒い本、茶色の本、黄色い本、オレンジ色の本、赤い本です。黒い本は黄色い本の左側にあります。赤い本は左から3冊目です。茶色の本は左から2冊目です。黄色い本はオレンジ色の本の左側にあります。\n選択肢:\n(A) 黒い本は左から2冊目である\n(B) 茶色の本は左から2冊目である\n(C) 黄色い本は左から2冊目である\n(D) オレンジ色の本は左から2冊目である\n(E) 赤い本は左から2冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、エイミー、ジョー、イブ、ダン――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーは2位でフィニッシュしました。ジョーはイブよりも上位でフィニッシュしました。イブはダンよりも上位でフィニッシュしました。\n選択肢:\n(A) ロブが2位でフィニッシュした\n(B) エイミーが2位でフィニッシュした\n(C) ジョーが2位でフィニッシュした\n(D) イブが2位でフィニッシュした\n(E) ダンが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ステーションワゴン、トラクター、トラック、ハッチバック、ミニバンです。ステーションワゴンはトラクターよりも新しいモデルです。トラックはトラクターよりも古いモデルです。ミニバンはハッチバックよりも新しいモデルです。ハッチバックは5台の中で2番目に新しいモデルです。\n選択肢:\n(A) ステーションワゴンが最も古い\n(B) トラクターが最も古い\n(C) トラックが最も古い\n(D) ハッチバックが最も古い\n(E) ミニバンが最も古い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、リムジン、セダン、バス、ハッチバック、オートバイの5台の車両が展示されています。ハッチバックはセダンよりも古い年式です。ハッチバックは5台の中で2番目に古い車両です。リムジンはバスよりも古い年式です。バスはセダンよりも新しい年式です。バスは5台の中で2番目に新しい車両です。\n選択肢:\n(A) リムジンが2番目に新しい車両である\n(B) セダンが2番目に新しい車両である\n(C) バスが2番目に新しい車両である\n(D) ハッチバックが2番目に新しい車両である\n(E) オートバイが2番目に新しい車両である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――スイカ、プラム、リンゴ、桃、キウイ――を販売しています。リンゴは桃よりも安価です。プラムが最も安価です。キウイは2番目に安価です。スイカは桃よりも高価です。\n選択肢:\n(A) スイカは2番目に高価な果物である\n(B) プラムは2番目に高価な果物である\n(C) リンゴは2番目に高価な果物である\n(D) 桃は2番目に高価な果物である\n(E) キウイは2番目に高価な果物である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：アオカケス、ショウジョウコウカンチョウ、タカ、ハチドリ、ウズラです。ウズラはアオカケスの左側にあります。ショウジョウコウカンチョウは左から3番目です。ウズラは左から2番目です。アオカケスはハチドリの左側にあります。\n選択肢:\n(A) アオカケスは右側から2番目に位置する\n(B) ショウジョウコウカンチョウは右側から2番目に位置する\n(C) タカは右側から2番目に位置する\n(D) ハチドリは右側から2番目に位置する\n(E) ウズラは右側から2番目に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、キウイ、プラム、洋ナシ、スイカ――を販売しています。キウイはプラムよりも安価です。洋ナシは最も高価な3番目の果物です。キウイは2番目に安価な果物です。スイカは最も高価な果物です。\n選択肢:\n(A) マンゴーが最も安価である\n(B) キウイが最も安価である\n(C) プラムが最も安価である\n(D) 洋ナシが最も安価である\n(E) スイカが最も安価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：黒い本、紫色の本、黄色い本、オレンジ色の本、赤い本です。黄色い本が最も右側にあります。黒い本はオレンジ色の本の左側にあります。オレンジ色の本は紫色の本の左側にあります。黒い本は左から2冊目です。\n選択肢:\n(A) 黒い本は左から2冊目である\n(B) 紫色の本は左から2冊目である\n(C) 黄色い本は左から2冊目である\n(D) オレンジ色の本は左から2冊目である\n(E) 赤い本は左から2冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、カラス、ワタリガラス、コマドリ、コウカンチョウです。ワタリガラスはフクロウの右側に位置しています。ワタリガラスは左から2番目です。コマドリはカラスの左側に位置しています。コマドリは右から2番目です。\n選択肢:\n(A) フクロウが最も右側に位置する\n(B) カラスが最も右側に位置する\n(C) ワタリガラスが最も右側に位置する\n(D) コマドリが最も右側に位置する\n(E) コウカンチョウが最も右側に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます――フクロウ、ハチドリ、カラス、オナガフクロウ、コマドリです。オナガフクロウの右側にオナガフクロウがいます。ハチドリはオナガフクロウの右側に位置しています。カラスは右側から2番目です。コマドリは左側から2番目です。\n選択肢:\n(A) フクロウは右側から2番目に位置する\n(B) ハチドリは右側から2番目に位置する\n(C) カラスは右側から2番目に位置する\n(D) オナガフクロウは右側から2番目に位置する\n(E) コマドリは右側から2番目に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：アオカケス、ショウジョウコウカンチョウ、タカ、ハチドリ、ウズラです。ウズラはアオカケスの左側にあります。ショウジョウコウカンチョウは左から3番目です。ウズラは左から2番目です。アオカケスはハチドリの左側にあります。\n選択肢:\n(A) アオカケスが右側端に位置する\n(B) ショウジョウコウカンチョウが右側端に位置する\n(C) タカが右側端に位置する\n(D) ハチドリが右側端に位置する\n(E) ウズラが右側端に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、梨、カンタロープメロン、スイカ、ビワ――を販売しています。マンゴーはビワよりも高価です。カンタロープメロンはマンゴーよりも高価です。スイカはカンタロープメロンよりも高価です。梨は最も安価な果物です。\n選択肢:\n(A) マンゴーは2番目に高価な果物である\n(B) 梨は2番目に高価な果物である\n(C) カンタロープメロンは2番目に高価な果物である\n(D) スイカは2番目に高価な果物である\n(E) ビワは2番目に高価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、イブ、エリ、エイミー、ダン――がいました。ダンは2位でフィニッシュしました。エイミーはイブよりも下位でフィニッシュしました。ダンはイブよりも上位でフィニッシュしました。エイミーはエリよりも上位でフィニッシュしました。\n選択肢:\n(A) ロブが1位でフィニッシュした\n(B) イブが1位でフィニッシュした\n(C) エリが1位でフィニッシュした\n(D) エイミーが1位でフィニッシュした\n(E) ダンが1位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、ミア、イブ、エイミー、アナ――がいました。イブはジョーよりも下位でフィニッシュしました。アナはエイミーよりも下位でフィニッシュしました。イブはエイミーよりも上位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが最下位でフィニッシュした\n(B) ミアが最下位でフィニッシュした\n(C) イブが最下位でフィニッシュした\n(D) エイミーが最下位でフィニッシュした\n(E) アナが最下位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――オレンジ、リンゴ、桃、カンタロープメロン、ビワ――を販売しています。ビワはカンタロープメロンよりも安価です。カンタロープメロンはリンゴよりも安価です。オレンジは最も高価です。リンゴは3番目に高価な果物です。\n選択肢:\n(A) オレンジは2番目に高価な果物である\n(B) リンゴは2番目に高価な果物である\n(C) 桃は2番目に高価な果物である\n(D) カンタロープメロンは2番目に高価な果物である\n(E) ビワは2番目に高価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、アダ、ダン、ジョー、メル――がいました。アダはメルよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。\n選択肢:\n(A) ロブが2位でフィニッシュした\n(B) アダが2位でフィニッシュした\n(C) ダンが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) メルが2位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：タカ、ワタリガラス、ツグミ、ハチドリ、カラスです。ツグミが最も左側にあります。ワタリガラスは左から2番目です。タカは右から2番目です。カラスは左から3番目です。\n選択肢:\n(A) タカが最も左側にある\n(B) ワタリガラスが最も左側にある\n(C) ツグミが最も左側にある\n(D) ハチドリが最も左側にある\n(E) カラスが最も左側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――梨、マンゴー、キウイ、オレンジ、桃――を販売しています。桃はマンゴーよりも高価です。オレンジはキウイよりも高価です。梨が最も高価です。マンゴーはオレンジよりも高価です。\n選択肢:\n(A) 梨は3番目に高価な果物である\n(B) マンゴーは3番目に高価な果物である\n(C) キウイは3番目に高価な果物である\n(D) オレンジは3番目に高価な果物である\n(E) 桃は3番目に高価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エリ、ジョー、ロブ、ミア――がいました。ロブはミアよりも上位でフィニッシュしました。イブが1位でフィニッシュしました。ジョーはエリよりも上位でフィニッシュしました。ジョーはミアよりも下位でフィニッシュしました。\n選択肢:\n(A) イブが3位でフィニッシュした\n(B) エリが3位でフィニッシュした\n(C) ジョーが3位でフィニッシュした\n(D) ロブが3位でフィニッシュした\n(E) ミアが3位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会には、コンバーチブル、セダン、ステーションワゴン、バス、リムジンの5台の車両が展示されています。セダンはステーションワゴンよりも新しいモデルです。リムジンが最も新しいモデルです。バスは2番目に新しいモデルです。コンバーチブルは2番目に古いモデルです。\n選択肢:\n(A) コンバーチブルは2番目に新しいモデルである\n(B) セダンは2番目に新しいモデルである\n(C) ステーションワゴンは2番目に新しいモデルである\n(D) バスは2番目に新しいモデルである\n(E) リムジンは2番目に新しいモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――オレンジ、リンゴ、桃、カンタロープメロン、ビワ――を販売しています。ビワはカンタロープメロンよりも安価です。カンタロープメロンはリンゴよりも安価です。オレンジは最も高価です。リンゴは価格が3番目に高い種類です。\n選択肢:\n(A) オレンジが最も高価である\n(B) リンゴが最も高価である\n(C) 桃が最も高価である\n(D) カンタロープメロンが最も高価である\n(E) ビワが最も高価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両があります：オープンカー、バス、ミニバン、トラック、セダンです。オープンカーはトラックよりも新しいモデルです。ミニバンが最も新しいモデルです。バスは3番目に新しいモデルです。トラックはセダンよりも新しいモデルです。\n選択肢:\n(A) オープンカーは3番目に新しいモデルである\n(B) バスは3番目に新しいモデルである\n(C) ミニバンは3番目に新しいモデルである\n(D) トラックは3番目に新しいモデルである\n(E) セダンは3番目に新しいモデルである", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、赤い本、灰色の本です。黄色い本は灰色の本の右側にあります。紫色の本は灰色の本の左側にあります。赤い本は青い本の右側にあります。紫色の本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本は左から3冊目である\n(B) 紫色の本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) 赤い本は左から3冊目である\n(E) 灰色の本は左から3冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、キウイ、プラム、洋ナシ、スイカ――を販売しています。キウイはプラムよりも安価です。洋ナシは最も高価な3番目の果物です。キウイは2番目に安価な果物です。スイカは最も高価な果物です。\n選択肢:\n(A) マンゴーは2番目に安価な果物である\n(B) キウイは2番目に安価な果物である\n(C) プラムは2番目に安価な果物である\n(D) 洋ナシは2番目に安価な果物である\n(E) スイカは2番目に安価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、青色の本、茶色の本、灰色の本、赤色の本です。緑色の本は茶色の本の左側にあります。灰色の本は青色の本の左側にあります。緑色の本は青色の本の右側にあります。赤色の本は最も左側にあります。\n選択肢:\n(A) 緑色の本が最も左側にある\n(B) 青色の本が最も左側にある\n(C) 茶色の本が最も左側にある\n(D) 灰色の本が最も左側にある\n(E) 赤色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、ハチドリ、カラス、オナガフクロウ、コマドリです。オナガフクロウの右側にオナガフクロウがいます。ハチドリはオナガフクロウの右側に位置しています。カラスは右側から2番目です。コマドリは左側から2番目です。\n選択肢:\n(A) フクロウが最も左側に位置する\n(B) ハチドリが最も左側に位置する\n(C) カラスが最も左側に位置する\n(D) オナガフクロウが最も左側に位置する\n(E) コマドリが最も左側に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、アナ、エイミー、マイア、イブ――がいました。ジョーが最下位でフィニッシュしました。アナが2位でフィニッシュしました。マイアが4位でフィニッシュしました。イブはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) ジョーが4位でフィニッシュした\n(B) アナが4位でフィニッシュした\n(C) エイミーが4位でフィニッシュした\n(D) マイアが4位でフィニッシュした\n(E) イブが4位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、ダン、ミア、エリ、メル――がいました。エイミーはメルよりも上位でフィニッシュしました。ミアが1位でフィニッシュしました。エイミーはエリよりも下位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが2位でフィニッシュした\n(B) ダンが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) エリが2位でフィニッシュした\n(E) メルが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、ロブ、エイミー、ダン、ジョー――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーはアナよりも下位でフィニッシュしました。ジョーはエイミーよりも上位でフィニッシュしました。ダンはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが2位でフィニッシュした\n(B) ロブが2位でフィニッシュした\n(C) エイミーが2位でフィニッシュした\n(D) ダンが2位でフィニッシュした\n(E) ジョーが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラック、オートバイ、リムジン、ステーションワゴン、セダンです。リムジンはトラックよりも古い年式です。セダンはオートバイよりも新しい年式です。ステーションワゴンが最も古い年式です。リムジンはセダンよりも新しい年式です。\n選択肢:\n(A) トラックは2番目に新しい年式である\n(B) オートバイは2番目に新しい年式である\n(C) リムジンは2番目に新しい年式である\n(D) ステーションワゴンは2番目に新しい年式である\n(E) セダンは2番目に新しい年式である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラクター、ステーションワゴン、ミニバン、セダン、ハッチバックの5台の車両が展示されています。ミニバンはセダンよりも古い年式です。トラクターはハッチバックよりも古い年式です。ミニバンは最も新しい年式の3番目です。ステーションワゴンは最も新しい年式の2番目です。\n選択肢:\n(A) トラクターが最も新しい年式である\n(B) ステーションワゴンが最も新しい年式である\n(C) ミニバンが最も新しい年式である\n(D) セダンが最も新しい年式である\n(E) ハッチバックが最も新しい年式である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：タカ、ワタリガラス、ツグミ、ハチドリ、カラスです。ツグミが最も左側にあります。ワタリガラスは左から2番目です。タカは右から2番目です。カラスは左から3番目です。\n選択肢:\n(A) タカが最も右側に位置する\n(B) ワタリガラスが最も右側に位置する\n(C) ツグミが最も右側に位置する\n(D) ハチドリが最も右側に位置する\n(E) カラスが最も右側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、エイミー、ダン、ミア、イブ――がいました。アナはミアよりも下位でフィニッシュしました。ダンはエイミーよりも上位でフィニッシュしました。ミアは2番目に下位でフィニッシュしました。イブはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが2番目に下位でフィニッシュした\n(B) エイミーが2番目に下位でフィニッシュした\n(C) ダンが2番目に下位でフィニッシュした\n(D) ミアが2番目に下位でフィニッシュした\n(E) イブが2番目に下位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両――バス、トラック、オートバイ、セダン、ハッチバック――が展示されています。セダンは最も古い車両の次に古い車両です。ハッチバックはオートバイよりも新しい車両です。オートバイはセダンよりも新しい車両です。ハッチバックはトラックよりも古い車両です。\n選択肢:\n(A) バスは3番目に新しい車両である\n(B) トラックは3番目に新しい車両である\n(C) オートバイは3番目に新しい車両である\n(D) セダンは3番目に新しい車両である\n(E) ハッチバックは3番目に新しい車両である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会には、トラクター、ステーションワゴン、バス、オートバイ、ミニバンの5台の車両が展示されています。ミニバンはオートバイよりも古い年式です。バスは最も新しい車両です。トラクターは3番目に新しい車両です。ステーションワゴンは2番目に古い車両です。\n選択肢:\n(A) トラクターは2番目に古い車両である\n(B) ステーションワゴンは2番目に古い車両である\n(C) バスは2番目に古い車両である\n(D) オートバイは2番目に古い車両である\n(E) ミニバンは2番目に古い車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：アオカケス、コマドリ、ショウジョウコウカンチョウ、タカ、ハヤブサです。アオカケスが最も右側に位置しています。コマドリはハヤブサの右側にいます。ショウジョウコウカンチョウはタカの左側に位置しています。ハヤブサはタカの右側にいます。\n選択肢:\n(A) アオカケスが最も左側に位置する\n(B) コマドリが最も左側に位置する\n(C) ショウジョウコウカンチョウが最も左側に位置する\n(D) タカが最も左側に位置する\n(E) ハヤブサが最も左側に位置する", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、エイミー、ダン、マイア、イブ――がいました。アナはマイアよりも下位でフィニッシュしました。ダンはエイミーよりも上位でフィニッシュしました。マイアは2位でフィニッシュしました。イブはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが2位でフィニッシュした\n(B) エイミーが2位でフィニッシュした\n(C) ダンが2位でフィニッシュした\n(D) マイアが2位でフィニッシュした\n(E) イブが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――オレンジ、カンタロープメロン、桃、ビワ、キウイ――を販売しています。桃はオレンジよりも高価です。カンタロープメロンは桃よりも高価です。キウイは最も高価な3番目の果物です。ビワは最も安価な2番目の果物です。\n選択肢:\n(A) オレンジは最も安価な2番目の果物である\n(B) カンタロープメロンは最も安価な2番目の果物である\n(C) 桃は最も安価な2番目の果物である\n(D) ビワは最も安価な2番目の果物である\n(E) キウイは最も安価な2番目の果物である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、茶色の本、黄色い本、オレンジ色の本です。赤い本は茶色の本の左側にあります。黄色い本はオレンジ色の本の右側にあります。茶色の本は左から2冊目です。黄色い本は青い本の左側にあります。\n選択肢:\n(A) 青い本が一番右側にある\n(B) 赤い本が一番右側にある\n(C) 茶色の本が一番右側にある\n(D) 黄色い本が一番右側にある\n(E) オレンジ色の本が一番右側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黄色の本、灰色の本、赤色の本、黒色の本、白色の本です。灰色の本は黄色の本の左側にあります。白色の本は赤色の本の左側にあります。黒色の本は赤色の本の右側にあります。黒色の本は灰色の本の左側にあります。\n選択肢:\n(A) 黄色の本が最も左側にある\n(B) 灰色の本が最も左側にある\n(C) 赤色の本が最も左側にある\n(D) 黒色の本が最も左側にある\n(E) 白色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黒い本、茶色の本、黄色い本、オレンジ色の本、赤い本です。黒い本は黄色い本の左側にあります。赤い本は左から3冊目です。茶色の本は左から2冊目です。黄色い本はオレンジ色の本の左側にあります。\n選択肢:\n(A) 黒い本が最も左側にある\n(B) 茶色の本が最も左側にある\n(C) 黄色い本が最も左側にある\n(D) オレンジ色の本が最も左側にある\n(E) 赤い本が最も左側にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、イブ、エリ、エイミー、ダン――がいました。ダンは2位でフィニッシュしました。エイミーはイブよりも下位でフィニッシュしました。ダンはイブよりも上位でフィニッシュしました。エイミーはエリよりも上位でフィニッシュしました。\n選択肢:\n(A) ロブが最下位でフィニッシュした\n(B) イブが最下位でフィニッシュした\n(C) エリが最下位でフィニッシュした\n(D) エイミーが最下位でフィニッシュした\n(E) ダンが最下位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：緑色の本、青色の本、白色の本、紫色の本、黄色の本です。青色の本は黄色の本の右側にあります。白色の本は黄色の本の左側にあります。青色の本は右側から2冊目です。紫色の本は左側から2冊目です。\n選択肢:\n(A) 緑色の本が一番右にある\n(B) 青色の本が一番右にある\n(C) 白色の本が一番右にある\n(D) 紫色の本が一番右にある\n(E) 黄色の本が一番右にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ミニバン、ハッチバック、バス、オープンカー、オートバイです。ハッチバックはオープンカーよりも新しいモデルです。バスはハッチバックよりも新しいモデルです。バスはオートバイよりも古いモデルです。ミニバンが最も新しいモデルです。\n選択肢:\n(A) ミニバンは2番目に新しいモデルである\n(B) ハッチバックは2番目に新しいモデルである\n(C) バスは2番目に新しいモデルである\n(D) オープンカーは2番目に新しいモデルである\n(E) オートバイは2番目に新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、ビワ、梨、プラム、リンゴ――を販売しています。梨は最も安価な2番目の価格です。ビワは梨よりも高価です。プラムは最も高価な2番目の価格です。スイカは最も高価な果物です。\n選択肢:\n(A) スイカが最も高価な果物である\n(B) ビワが最も高価な果物である\n(C) 梨が最も高価な果物である\n(D) プラムが最も高価な果物である\n(E) リンゴが最も高価な果物である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、エイミー、イブ、ミア、アナ――がいました。ミアはロブよりも下位でフィニッシュしました。アナはイブよりも下位でフィニッシュしました。エイミーは2位でフィニッシュしました。イブはミアよりも下位でフィニッシュしました。\n選択肢:\n(A) ロブが3位でフィニッシュした\n(B) エイミーが3位でフィニッシュした\n(C) イブが3位でフィニッシュした\n(D) ミアが3位でフィニッシュした\n(E) アナが3位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：フクロウ、カラス、ワタリガラス、コマドリ、コウヨウチョウです。ワタリガラスはフクロウの右側に位置しています。ワタリガラスは左から2番目です。コマドリはカラスの左側に位置しています。コマドリは右から2番目です。\n選択肢:\n(A) フクロウは右から2番目に位置する\n(B) カラスは右から2番目に位置する\n(C) ワタリガラスは右から2番目に位置する\n(D) コマドリは右から2番目に位置する\n(E) コウヨウチョウは右から2番目に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――メル、ダン、エイミー、ジョー、イブ――がいました。エイミーはダンよりも下位でフィニッシュしました。メルが1位でフィニッシュしました。ジョーはダンよりも上位でフィニッシュしました。イブが最下位でフィニッシュしました。\n選択肢:\n(A) メルが3位でフィニッシュした\n(B) ダンが3位でフィニッシュした\n(C) エイミーが3位でフィニッシュした\n(D) ジョーが3位でフィニッシュした\n(E) イブが3位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――スイカ、プラム、リンゴ、桃、キウイ――を販売しています。リンゴは桃よりも安価です。プラムが最も安価です。キウイは2番目に安価です。スイカは桃よりも高価です。\n選択肢:\n(A) スイカは価格が3番目に高い\n(B) プラムは価格が3番目に高い\n(C) リンゴは価格が3番目に高い\n(D) 桃は価格が3番目に高い\n(E) キウイは価格が3番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、リンゴ、キウイ、カンタロープメロン、マンゴー――を販売しています。カンタロープメロンは価格が2番目に安い果物です。マンゴーはスイカよりも高価です。キウイはリンゴよりも安価です。キウイはマンゴーよりも高価です。\n選択肢:\n(A) スイカが最も高価な果物である\n(B) リンゴが最も高価な果物である\n(C) キウイが最も高価な果物である\n(D) カンタロープメロンが最も高価な果物である\n(E) マンゴーが最も高価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：黒い本、紫色の本、黄色い本、オレンジ色の本、赤い本です。黄色い本が最も右側にあります。黒い本はオレンジ色の本の左側にあります。オレンジ色の本は紫色の本の左側にあります。黒い本は左から3冊目です。\n選択肢:\n(A) 黒い本は左から3冊目である\n(B) 紫色の本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) オレンジ色の本は左から3冊目である\n(E) 赤い本は左から3冊目である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、黒い本、緑色の本です。紫色の本は左から3冊目に位置しています。黄色い本は黒い本の左側に配置されています。緑色の本は紫色の本の左側に位置しています。青い本は緑色の本の左側に配置されています。\n選択肢:\n(A) 青い本が一番右側にある\n(B) 紫色の本が一番右側にある\n(C) 黄色い本が一番右側にある\n(D) 黒い本が一番右側にある\n(E) 緑色の本が一番右側にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、オレンジ、ビワ、プラム、キウイ――を販売しています。プラムはキウイよりも安価です。プラムはスイカよりも高価です。ビワはキウイよりも高価です。オレンジは最も高価な果物です。\n選択肢:\n(A) スイカは2番目に高価な果物である\n(B) オレンジは2番目に高価な果物である\n(C) ビワは2番目に高価な果物である\n(D) プラムは2番目に高価な果物である\n(E) キウイは2番目に高価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、黒い本、緑色の本です。紫色の本は左から3冊目に位置しています。黄色い本は黒い本の左側に配置されています。緑色の本は紫色の本の左側に位置しています。青い本は緑色の本の左側に配置されています。\n選択肢:\n(A) 青い本は左から3冊目である\n(B) 紫色の本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) 黒い本は左から3冊目である\n(E) 緑色の本は左から3冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます――フクロウ、オナガフクロウ、コマドリ、カラス、ワタリガラスです。オナガフクロウはオナガフクロウの左側にあります。ワタリガラスは右側から2番目の位置にあります。コマドリはワタリガラスの左側にあります。フクロウは左側から2番目の位置にあります。\n選択肢:\n(A) フクロウは左側から2番目の位置にある\n(B) オナガフクロウは左側から2番目の位置にある\n(C) コマドリは左側から2番目の位置にある\n(D) カラスは左側から2番目の位置にある\n(E) ワタリガラスは左側から2番目の位置にある", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。クラシックカー展示会において、5台の車両が展示されています：トラック、オートバイ、リムジン、ステーションワゴン、セダンです。リムジンはトラックよりも古い年式です。セダンはオートバイよりも新しい年式です。ステーションワゴンが最も古い年式です。リムジンはセダンよりも新しい年式です。\n選択肢:\n(A) トラックが最も古い\n(B) オートバイが最も古い\n(C) リムジンが最も古い\n(D) ステーションワゴンが最も古い\n(E) セダンが最も古い", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、ロブ、エイミー、ダン、ジョー――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーはアナよりも下位でフィニッシュしました。ジョーはエイミーよりも上位でフィニッシュしました。ダンはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが2位でフィニッシュした\n(B) ロブが2位でフィニッシュした\n(C) エイミーが2位でフィニッシュした\n(D) ダンが2位でフィニッシュした\n(E) ジョーが2位でフィニッシュした", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両があります：オープンカー、バス、ミニバン、トラック、セダンです。オープンカーはトラックよりも新しいモデルです。ミニバンが最も新しいモデルです。バスは3番目に新しいモデルです。トラックはセダンよりも新しいモデルです。\n選択肢:\n(A) オープンカーは2番目に古いモデルである\n(B) バスは2番目に古いモデルである\n(C) ミニバンは2番目に古いモデルである\n(D) トラックは2番目に古いモデルである\n(E) セダンは2番目に古いモデルである", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――ビワ、梨、スイカ、キウイ、プラム――を販売しています。ビワは価格が3番目に高い果物です。ビワはスイカよりも高価です。プラムはスイカよりも安価です。キウイは梨よりも高価です。\n選択肢:\n(A) ビワは価格が3番目に高い\n(B) 梨は価格が3番目に高い\n(C) スイカは価格が3番目に高い\n(D) キウイは価格が3番目に高い\n(E) プラムは価格が3番目に高い", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：コマドリ、ウズラ、フクロウ、カラス、オナガフクロウです。オナガフクロウは左から3番目の位置にあります。オナガフクロウはカラスの右側に位置しています。ウズラはカラスの左側に位置しています。コマドリはフクロウの右側に位置しています。\n選択肢:\n(A) コマドリが最も右側に位置する\n(B) ウズラが最も右側に位置する\n(C) フクロウが最も右側に位置する\n(D) カラスが最も右側に位置する\n(E) オナガフクロウが最も右側に位置する", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エイミー、アダ、ロブ、ジョー――がいました。エイミーは2番目に下位でフィニッシュしました。ロブはイブよりも下位でフィニッシュしました。アダはジョーよりも上位でフィニッシュしました。ジョーは3番目にフィニッシュしました。\n選択肢:\n(A) イブが3位でフィニッシュした\n(B) エイミーが3位でフィニッシュした\n(C) アダが3位でフィニッシュした\n(D) ロブが3位でフィニッシュした\n(E) ジョーが3位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：灰色の本、赤い本、黄色い本、青い本、オレンジ色の本です。灰色の本は黄色い本の右側にあります。オレンジ色の本は赤い本の右側にあります。青い本は最も右側に位置しています。灰色の本は赤い本の左側に位置しています。\n選択肢:\n(A) 灰色の本は左から3冊目である\n(B) 赤い本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) 青い本は左から3冊目である\n(E) オレンジ色の本は左から3冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：白い本、オレンジ色の本、黄色い本、青い本、赤い本です。黄色い本は白い本の左側にあります。赤い本は青い本の右側にあります。黄色い本はオレンジ色の本の右側にあります。青い本は白い本の右側にあります。\n選択肢:\n(A) 白い本が最も左側にある\n(B) オレンジ色の本が最も左側にある\n(C) 黄色い本が最も左側にある\n(D) 青い本が最も左側にある\n(E) 赤い本が最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：アオカケス、コマドリ、ショウジョウコウカンチョウ、タカ、ハヤブサです。アオカケスが最も右側に位置しています。コマドリはハヤブサの右側にいます。ショウジョウコウカンチョウはタカの左側に位置しています。ハヤブサはタカの右側にいます。\n選択肢:\n(A) アオカケスは左から3番目に位置する\n(B) コマドリは左から3番目に位置する\n(C) ショウジョウコウカンチョウは左から3番目に位置する\n(D) タカは左から3番目に位置する\n(E) ハヤブサは左から3番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、リンゴ、キウイ、カンタロープメロン、マンゴー――を販売しています。カンタロープメロンは価格が2番目に安い果物です。マンゴーはスイカよりも高価です。キウイはリンゴよりも安価です。キウイはマンゴーよりも高価です。\n選択肢:\n(A) スイカは価格が3番目に高い\n(B) リンゴは価格が3番目に高い\n(C) キウイは価格が3番目に高い\n(D) カンタロープメロンは価格が3番目に高い\n(E) マンゴーは価格が3番目に高い", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、ミア、イブ、エイミー、アナ――がいました。イブはジョーよりも下位でフィニッシュしました。アナはエイミーよりも下位でフィニッシュしました。イブはエイミーよりも上位でフィニッシュしました。ミアはジョーよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) ミアが2位でフィニッシュした\n(C) イブが2位でフィニッシュした\n(D) エイミーが2位でフィニッシュした\n(E) アナが2位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、エイミー、ジョー、イブ、ダン――がいました。ロブはダンよりも下位でフィニッシュしました。ジョーは2位でフィニッシュしました。ジョーはイブよりも上位でフィニッシュしました。イブはダンよりも上位でフィニッシュしました。\n選択肢:\n(A) ロブが最下位でフィニッシュした\n(B) エイミーが最下位でフィニッシュした\n(C) ジョーが最下位でフィニッシュした\n(D) イブが最下位でフィニッシュした\n(E) ダンが最下位でフィニッシュした", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ハッチバック、バス、オープンカー、トラクター、ミニバンです。トラクターはバスよりも古い車両です。ミニバンはバスよりも新しい車両です。ハッチバックは5台の中で2番目に新しい車両です。ミニバンはオープンカーよりも古い車両です。\n選択肢:\n(A) ハッチバックが最も古い車両である\n(B) バスが最も古い車両である\n(C) オープンカーが最も古い車両である\n(D) トラクターが最も古い車両である\n(E) ミニバンが最も古い車両である", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――マンゴー、カンタロープメロン、プラム、オレンジ、スイカ――を販売しています。オレンジはスイカよりも高価です。スイカは価格が2番目に安い部類に入ります。プラムはカンタロープメロンよりも安価です。プラムは価格が2番目に高い部類に入ります。\n選択肢:\n(A) マンゴーは価格が3番目に高い\n(B) カンタロープメロンは価格が3番目に高い\n(C) プラムは価格が3番目に高い\n(D) オレンジは価格が3番目に高い\n(E) スイカは価格が3番目に高い", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ジョー、イブ、ミア、ロブ、ダン――がいました。ジョーはダンよりも下位でフィニッシュしました。ミアが1位でフィニッシュしました。ダンはロブよりも下位でフィニッシュしました。イブはロブよりも上位でフィニッシュしました。\n選択肢:\n(A) ジョーが2位でフィニッシュした\n(B) イブが2位でフィニッシュした\n(C) ミアが2位でフィニッシュした\n(D) ロブが2位でフィニッシュした\n(E) ダンが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋では5種類の果物――マンゴー、カンタロープメロン、プラム、オレンジ、スイカ――を販売しています。オレンジはスイカよりも高価です。スイカは価格が2番目に安い部類に入ります。プラムはカンタロープメロンよりも安価です。プラムは価格が2番目に高い部類に入ります。\n選択肢:\n(A) マンゴーが最も高価である\n(B) カンタロープメロンが最も高価である\n(C) プラムが最も高価である\n(D) オレンジが最も高価である\n(E) スイカが最も高価である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。枝の上には5羽の鳥がいます：ショウジョウコウカンチョウ、タカ、ハチドリ、ワタリガラス、フクロウです。ワタリガラスはハチドリの左側にあります。タカはフクロウの左側にあります。ショウジョウコウカンチョウはタカの左側にあります。ワタリガラスは右側から2番目の位置にあります。\n選択肢:\n(A) ショウジョウコウカンチョウが右側から2番目の位置にある\n(B) タカが右側から2番目の位置にある\n(C) ハチドリが右側から2番目の位置にある\n(D) ワタリガラスが右側から2番目の位置にある\n(E) フクロウが右側から2番目の位置にある", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。棚には5冊の本が並んでいます：青い本、紫色の本、黄色い本、赤い本、灰色の本です。黄色い本は灰色の本の右側にあります。紫色の本は灰色の本の左側にあります。赤い本は青い本の右側にあります。紫色の本は左から3冊目に位置しています。\n選択肢:\n(A) 青い本が一番右側にある\n(B) 紫色の本が一番右側にある\n(C) 黄色い本が一番右側にある\n(D) 赤い本が一番右側にある\n(E) 灰色の本が一番右側にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アダ、エリ、エイミー、ジョー、メル――がいました。アダはエリよりも上位でフィニッシュしました。エイミーはメルよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。メルはエリよりも下位でフィニッシュしました。\n選択肢:\n(A) アダが2位でフィニッシュした\n(B) エリが2位でフィニッシュした\n(C) エイミーが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) メルが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：アオカケス、ワタリガラス、カラス、ハヤブサ、ミフウズラです。カラスはミフウズラの左側にあります。ハヤブサは最も左側の位置にあります。アオカケスはミフウズラの右側に位置しています。ワタリガラスは左から2番目の位置にあります。\n選択肢:\n(A) アオカケスは右側から2番目の位置にある\n(B) ワタリガラスは右側から2番目の位置にある\n(C) カラスは右側から2番目の位置にある\n(D) ハヤブサは右側から2番目の位置にある\n(E) ミフウズラは右側から2番目の位置にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラック、ステーションワゴン、オートバイ、リムジン、ハッチバックです。このうちオートバイは2番目に新しいモデルです。トラックはリムジンよりも新しいモデルです。オートバイはステーションワゴンよりも古いモデルです。リムジンはハッチバックよりも新しいモデルです。\n選択肢:\n(A) トラックが最も古いモデルである\n(B) ステーションワゴンが最も古いモデルである\n(C) オートバイが最も古いモデルである\n(D) リムジンが最も古いモデルである\n(E) ハッチバックが最も古いモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両――バス、トラック、オートバイ、セダン、ハッチバック――が展示されています。セダンは最も古い車両の次に古い車両です。ハッチバックはオートバイよりも新しい車両です。オートバイはセダンよりも新しい車両です。ハッチバックはトラックよりも古い車両です。\n選択肢:\n(A) バスが最も新しい車両である\n(B) トラックが最も新しい車両である\n(C) オートバイが最も新しい車両である\n(D) セダンが最も新しい車両である\n(E) ハッチバックが最も新しい車両である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――リンゴ、ビワ、カンタロープメロン、スイカ、キウイ――を販売しています。スイカはビワよりも高価です。スイカはキウイよりも安価です。ビワはリンゴよりも高価です。カンタロープメロンが最も安価です。\n選択肢:\n(A) リンゴは3番目に高価な果物である\n(B) ビワは3番目に高価な果物である\n(C) カンタロープメロンは3番目に高価な果物である\n(D) スイカは3番目に高価な果物である\n(E) キウイは3番目に高価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、イブ、メル、ミア、ロブ――がいました。イブが最下位でフィニッシュしました。ロブはメルよりも上位でフィニッシュしました。エイミーはロブよりも上位でフィニッシュしました。ミアは3位でフィニッシュしました。\n選択肢:\n(A) エイミーが2番目に下位でフィニッシュした\n(B) イブが2番目に下位でフィニッシュした\n(C) メルが2番目に下位でフィニッシュした\n(D) ミアが2番目に下位でフィニッシュした\n(E) ロブが2番目に下位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――桃、スイカ、梨、リンゴ、カンタロープメロン――を販売しています。スイカは価格が2番目に安い果物です。リンゴは最も安い果物です。桃は最も高価な果物です。梨はカンタロープメロンよりも安い価格です。\n選択肢:\n(A) 桃は価格が2番目に安い\n(B) スイカは価格が2番目に安い\n(C) 梨は価格が2番目に安い\n(D) リンゴは価格が2番目に安い\n(E) カンタロープメロンは価格が2番目に安い", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：トラクター、トラック、バス、ミニバン、オープンカーです。バスはトラクターよりも新しいモデルです。オープンカーはトラクターよりも古いモデルです。トラックは2番目に新しいモデルです。ミニバンはオープンカーよりも古いモデルです。\n選択肢:\n(A) トラクターは2番目に古いモデルである\n(B) トラックは2番目に新しいモデルである\n(C) バスは2番目に新しいモデルである\n(D) ミニバンは2番目に古いモデルである\n(E) オープンカーは2番目に新しいモデルである", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エイミー、アダ、ロブ、ジョー――がいました。エイミーは2番目に下位でフィニッシュしました。ロブはイブよりも下位でフィニッシュしました。アダはジョーよりも上位でフィニッシュしました。ジョーは2番目に上位でフィニッシュしました。\n選択肢:\n(A) イブが2位でフィニッシュした\n(B) エイミーが2位でフィニッシュした\n(C) アダが2位でフィニッシュした\n(D) ロブが2位でフィニッシュした\n(E) ジョーが2位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、キウイ、プラム、梨、スイカ――を販売しています。キウイはプラムよりも安価です。梨は最も高価な3番目の果物です。キウイは2番目に安価な果物です。スイカは最も高価な果物です。\n選択肢:\n(A) マンゴーは2番目に高価な果物である\n(B) キウイは2番目に高価な果物である\n(C) プラムは2番目に高価な果物である\n(D) 梨は2番目に高価な果物である\n(E) スイカは2番目に高価な果物である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――リンゴ、ビワ、カンタロープメロン、スイカ、キウイ――を販売しています。スイカはビワよりも高価です。スイカはキウイよりも安価です。ビワはリンゴよりも高価です。カンタロープメロンが最も安価です。\n選択肢:\n(A) リンゴが最も高価である\n(B) ビワが最も高価である\n(C) カンタロープメロンが最も高価である\n(D) スイカが最も高価である\n(E) キウイが最も高価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、オレンジ色の本、茶色の本、黄色の本、青色の本です。オレンジ色の本は黄色の本の右側にあります。緑色の本は最も右側に位置しています。黄色の本は青色の本の右側にあります。オレンジ色の本は左から3冊目です。\n選択肢:\n(A) 緑色の本は左から3冊目である\n(B) オレンジ色の本は左から3冊目である\n(C) 茶色の本は左から3冊目である\n(D) 黄色の本は左から3冊目である\n(E) 青色の本は左から3冊目である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、メル、アナ、エリ、ロブ――がいました。ロブはメルよりも上位でフィニッシュしました。メルは2位でフィニッシュしました。アナはエリよりも上位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが1位でフィニッシュした\n(B) メルが1位でフィニッシュした\n(C) アナが1位でフィニッシュした\n(D) エリが1位でフィニッシュした\n(E) ロブが1位でフィニッシュした", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――オレンジ、リンゴ、桃、カンタロープメロン、ビワ――を販売しています。ビワはカンタロープメロンよりも安価です。カンタロープメロンはリンゴよりも安価です。オレンジは最も高価です。リンゴは価格が3番目に高い種類です。\n選択肢:\n(A) オレンジが最も安価である\n(B) リンゴが最も安価である\n(C) 桃が最も安価である\n(D) カンタロープメロンが最も安価である\n(E) ビワが最も安価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：青い本、赤い本、紫の本、灰色の本、白い本です。白い本は灰色の本の右側にあります。青い本は最も左側にあります。赤い本は灰色の本の左側にあります。赤い本は左から3冊目です。\n選択肢:\n(A) 青い本は左から2冊目である\n(B) 赤い本は左から2冊目である\n(C) 紫の本は左から2冊目である\n(D) 灰色の本は左から2冊目である\n(E) 白い本は左から2冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：貨物トラック、ステーションワゴン、オートバイ、リムジン、ハッチバックです。このうちオートバイは2番目に新しいモデルです。トラックはリムジンよりも新しいモデルです。オートバイはステーションワゴンよりも古いモデルです。リムジンはハッチバックよりも新しいモデルです。\n選択肢:\n(A) トラックが2番目に新しいモデルである\n(B) ステーションワゴンが2番目に新しいモデルである\n(C) オートバイが2番目に新しいモデルである\n(D) リムジンが2番目に新しいモデルである\n(E) ハッチバックが2番目に新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ハヤブサ、ワタリガラス、ショウジョウコウカンチョウ、タカ、カラスです。ショウジョウコウカンチョウは右側から2番目の位置にあります。タカはハヤブサの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。カラスは最も右側に位置しています。\n選択肢:\n(A) ハヤブサは右側から2番目の位置にある\n(B) ワタリガラスは右側から2番目の位置にある\n(C) ショウジョウコウカンチョウは右側から2番目の位置にある\n(D) タカは右側から2番目の位置にある\n(E) カラスは右側から2番目の位置にある", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――マンゴー、キウイ、スイカ、オレンジ、リンゴ――を販売しています。オレンジが最も安価です。キウイはマンゴーよりも高価です。スイカはリンゴよりも高価です。スイカはキウイよりも安価です。\n選択肢:\n(A) マンゴーは2番目に高価な果物である\n(B) キウイは2番目に高価な果物である\n(C) スイカは2番目に高価な果物である\n(D) オレンジは2番目に高価な果物である\n(E) リンゴは2番目に高価な果物である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：緑色の本、オレンジ色の本、茶色の本、黄色の本、青色の本です。オレンジ色の本は黄色の本の右側にあります。緑色の本は最も右側に位置しています。黄色の本は青色の本の右側にあります。オレンジ色の本は左から3番目の位置にあります。\n選択肢:\n(A) 緑色の本が最も左側にある\n(B) オレンジ色の本が最も左側にある\n(C) 茶色の本が最も左側にある\n(D) 黄色の本が最も左側にある\n(E) 青色の本が最も左側にある", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：ミニバン、リムジン、セダン、トラクター、ハッチバックです。トラクターは5台中2番目に新しいモデルです。リムジンはハッチバックよりも新しいモデルです。リムジンはセダンよりも古いモデルです。ミニバンはセダンよりも新しいモデルです。\n選択肢:\n(A) ミニバンは5台中3番目に新しいモデルである\n(B) リムジンは5台中3番目に新しいモデルである\n(C) セダンは5台中3番目に新しいモデルである\n(D) トラクターは5台中3番目に新しいモデルである\n(E) ハッチバックは5台中3番目に新しいモデルである", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：コマドリ、フクロウ、ウズラ、ハチドリ、カラスです。カラスはコマドリの右側に位置しています。ウズラは最も左側にいます。ハチドリはフクロウの右側にいます。カラスは左から3番目の位置にあります。\n選択肢:\n(A) コマドリは左から3番目の位置にいる\n(B) フクロウは左から3番目の位置にいる\n(C) ウズラは左から3番目の位置にいる\n(D) ハチドリは左から3番目の位置にいる\n(E) カラスは左から3番目の位置にいる", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――リンゴ、マンゴー、オレンジ、プラム、ナシ――を販売しています。オレンジはマンゴーよりも高価です。プラムは最も安価です。リンゴはマンゴーよりも安価です。ナシはオレンジよりも高価です。\n選択肢:\n(A) リンゴが最も高価である\n(B) マンゴーが最も高価である\n(C) オレンジが最も高価である\n(D) プラムが最も高価である\n(E) ナシが最も高価である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、オレンジ、ビワ、プラム、キウイ――を販売しています。プラムはキウイよりも安価です。プラムはスイカよりも高価です。ビワはキウイよりも高価です。オレンジが最も高価です。\n選択肢:\n(A) スイカが最も高価である\n(B) オレンジが最も高価である\n(C) ビワが最も高価である\n(D) プラムが最も高価である\n(E) キウイが最も高価である", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――カンタロープメロン、キウイ、オレンジ、マンゴー、桃――を販売しています。キウイはマンゴーよりも安価です。桃はオレンジよりも安価です。オレンジは価格が2番目に高い種類です。マンゴーは価格が2番目に安い種類です。\n選択肢:\n(A) カンタロープメロンが最も高価である\n(B) キウイが最も高価である\n(C) オレンジが最も高価である\n(D) マンゴーが最も高価である\n(E) 桃が最も高価である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ダン、メル、アナ、エリ、ロブ――がいました。ロブはメルよりも上位でフィニッシュしました。メルは2位でフィニッシュしました。アナはエリよりも上位でフィニッシュしました。ダンが最下位でフィニッシュしました。\n選択肢:\n(A) ダンが2位でフィニッシュした\n(B) メルが2位でフィニッシュした\n(C) アナが2位でフィニッシュした\n(D) エリが2位でフィニッシュした\n(E) ロブが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――オレンジ、カンタロープメロン、桃、ビワ、キウイ――を販売しています。桃はオレンジよりも高価です。カンタロープメロンは桃よりも高価です。キウイは価格が3番目に高い果物です。ビワは価格が2番目に安い果物です。\n選択肢:\n(A) オレンジは価格が2番目に高い\n(B) カンタロープメロンは価格が2番目に高い\n(C) 桃は価格が2番目に高い\n(D) ビワは価格が2番目に高い\n(E) キウイは価格が2番目に高い", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：カラス、コマドリ、ウズラ、アオカケス、ハヤブサです。コマドリはウズラの左側にあります。ハヤブサは左から3番目の位置です。カラスはハヤブサの左側にあります。アオカケスは最も左側の位置にあります。\n選択肢:\n(A) カラスが最も左側に位置する\n(B) コマドリが最も左側に位置する\n(C) ウズラが最も左側に位置する\n(D) アオカケスが最も左側に位置する\n(E) ハヤブサが最も左側に位置する", "target": "(D)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。アンティークカー展示会において、5台の車両が展示されています：セダン、オープンカー、ステーションワゴン、バス、オートバイです。セダンは2番目に新しいモデルです。ステーションワゴンはオープンカーよりも新しいモデルです。セダンはオートバイよりも古いモデルです。バスは最も古いモデルです。\n選択肢:\n(A) セダンは2番目に新しいモデルである\n(B) オープンカーは2番目に新しいモデルである\n(C) ステーションワゴンは2番目に新しいモデルである\n(D) バスは2番目に新しいモデルである\n(E) オートバイは2番目に新しいモデルである", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：茶色の本、黄色の本、オレンジ色の本、緑色の本、灰色の本です。緑色の本は灰色の本の左側にあります。茶色の本は左から3冊目です。灰色の本は右から2冊目です。黄色の本は緑色の本の左側にあります。\n選択肢:\n(A) 茶色の本が最も左側にある\n(B) 黄色の本が最も左側にある\n(C) オレンジ色の本が最も左側にある\n(D) 緑色の本が最も左側にある\n(E) 灰色の本が最も左側にある", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。果物屋台では5種類の果物――リンゴ、マンゴー、オレンジ、プラム、ナシ――を販売しています。オレンジはマンゴーよりも高価です。プラムは最も安価です。リンゴはマンゴーよりも安価です。ナシはオレンジよりも高価です。\n選択肢:\n(A) リンゴは価格が3番目に高い\n(B) マンゴーは価格が3番目に高い\n(C) オレンジは価格が3番目に高い\n(D) プラムは価格が3番目に高い\n(E) ナシは価格が3番目に高い", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：コマドリ、フクロウ、ウズラ、ハチドリ、カラスです。カラスはコマドリの右側に位置しています。ウズラは最も左側にいます。ハチドリはフクロウの右側にいます。カラスは左から3番目の位置にあります。\n選択肢:\n(A) コマドリは右側から2番目に位置する\n(B) フクロウは右側から2番目に位置する\n(C) ウズラは右側から2番目に位置する\n(D) ハチドリは右側から2番目に位置する\n(E) カラスは右側から2番目に位置する", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――イブ、エイミー、アダ、ロブ、ジョー――がいました。エイミーは2番目に下位でフィニッシュしました。ロブはイブよりも下位でフィニッシュしました。アダはジョーよりも上位でフィニッシュしました。ジョーは2位でフィニッシュしました。\n選択肢:\n(A) イブが1位でフィニッシュした\n(B) エイミーが1位でフィニッシュした\n(C) アダが1位でフィニッシュした\n(D) ロブが1位でフィニッシュした\n(E) ジョーが1位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋では5種類の果物――キウイ、梨、桃、ビワ、リンゴ――を販売しています。ビワはキウイよりも高価です。梨は桃よりも高価です。リンゴはビワよりも高価です。リンゴは桃よりも安価です。\n選択肢:\n(A) キウイは価格が3番目に高い\n(B) 梨は価格が3番目に高い\n(C) 桃は価格が3番目に高い\n(D) ビワは価格が3番目に高い\n(E) リンゴは価格が3番目に高い", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：黄色の本、緑色の本、灰色の本、青色の本、オレンジ色の本です。灰色の本は緑色の本の左側にあります。灰色の本は右側から2冊目です。黄色の本はオレンジ色の本の右側にあります。青色の本は左側から2冊目です。\n選択肢:\n(A) 黄色の本は右側から2冊目である\n(B) 緑色の本は右側から2冊目である\n(C) 灰色の本は右側から2冊目である\n(D) 青色の本は右側から2冊目である\n(E) オレンジ色の本は右側から2冊目である", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：ハヤブサ、ワタリガラス、フコウカンチョウ、タカ、カラスです。フコウカンチョウは右側から2番目の位置にあります。タカはハヤブサの右側に位置しています。ワタリガラスは左側から2番目の位置にあります。カラスは最も右側に位置しています。\n選択肢:\n(A) ハヤブサが最も右側に位置する\n(B) ワタリガラスが最も右側に位置する\n(C) フコウカンチョウが最も右側に位置する\n(D) タカが最も右側に位置する\n(E) カラスが最も右側に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――ロブ、アダ、ダン、ジョー、メル――がいました。アダはメルよりも上位でフィニッシュしました。メルはダンよりも上位でフィニッシュしました。ジョーはダンよりも下位でフィニッシュしました。アダは2位でフィニッシュしました。\n選択肢:\n(A) ロブが2位でフィニッシュした\n(B) アダが2位でフィニッシュした\n(C) ダンが2位でフィニッシュした\n(D) ジョーが2位でフィニッシュした\n(E) メルが2位でフィニッシュした", "target": "(B)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――エイミー、メル、ロブ、ジョー、アダ――がいました。ジョーは2位でフィニッシュしました。ジョーはエイミーよりも下位でフィニッシュしました。メルは5位（最下位から2番目）でフィニッシュしました。アダが最下位でフィニッシュしました。\n選択肢:\n(A) エイミーが3位でフィニッシュした\n(B) メルが3位でフィニッシュした\n(C) ロブが3位でフィニッシュした\n(D) ジョーが3位でフィニッシュした\n(E) アダが3位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。ゴルフ大会において、5人のゴルファー――アナ、エイミー、ダン、ミア、イブ――がいました。アナはミアよりも下位でフィニッシュしました。ダンはエイミーよりも上位でフィニッシュしました。ミアは2番目に下位でフィニッシュしました。イブはエイミーよりも下位でフィニッシュしました。\n選択肢:\n(A) アナが1位でフィニッシュした\n(B) エイミーが1位でフィニッシュした\n(C) ダンが1位でフィニッシュした\n(D) ミアが1位でフィニッシュした\n(E) イブが1位でフィニッシュした", "target": "(C)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に一貫しています。棚には5冊の本が並んでいます：白い本、オレンジ色の本、黄色い本、青い本、赤い本です。黄色い本は白い本の左側にあります。赤い本は青い本の右側にあります。黄色い本はオレンジ色の本の右側にあります。青い本は白い本の右側にあります。\n選択肢:\n(A) 白い本は左から3冊目である\n(B) オレンジ色の本は左から3冊目である\n(C) 黄色い本は左から3冊目である\n(D) 青い本は左から3冊目である\n(E) 赤い本は左から3冊目である", "target": "(A)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。果物屋台では5種類の果物――スイカ、オレンジ、ビワ、プラム、キウイ――を販売しています。プラムはキウイよりも安価です。プラムはスイカよりも高価です。ビワはキウイよりも高価です。オレンジは最も高価な果物です。\n選択肢:\n(A) スイカは3番目に高価な果物である\n(B) オレンジは3番目に高価な果物である\n(C) ビワは3番目に高価な果物である\n(D) プラムは3番目に高価な果物である\n(E) キウイは3番目に高価な果物である", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：タカ、ワタリガラス、コマドリ、ハチドリ、カラスです。コマドリが最も左側にあります。ワタリガラスは左から2番目です。タカは右から2番目です。カラスは左から3番目です。\n選択肢:\n(A) タカは左から3番目に位置する\n(B) ワタリガラスは左から3番目に位置する\n(C) コマドリは左から3番目に位置する\n(D) ハチドリは左から3番目に位置する\n(E) カラスは左から3番目に位置する", "target": "(E)"}
{"input": "以下の各段落では、固定された順序で配置された5つの物体のセットについて説明しています。各段落内の記述は論理的に矛盾していません。枝の上には5羽の鳥がいます：タカ、ワタリガラス、コマドリ、ハチドリ、カラスです。コマドリが最も左側にあります。ワタリガラスは左から2番目です。タカは右から2番目です。カラスは左から3番目です。\n選択肢:\n(A) タカは左から2番目に位置する\n(B) ワタリガラスは左から2番目に位置する\n(C) コマドリは左から2番目に位置する\n(D) ハチドリは左から2番目に位置する\n(E) カラスは左から2番目に位置する", "target": "(B)"}
