{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前を向いて進みます。1歩後ろに下がります。左に9歩進みます。2歩後ろに下がります。前に6歩進みます。前に4歩進みます。後ろに4歩下がります。右に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。左に10歩進みます。前方に10歩進みます。前方に7歩進みます。前方に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。10歩進みます。4歩進みます。1歩進みます。10歩進みます。右に曲がります。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。右に1歩進みます。左に3歩進みます。右に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。10歩後ろに進みます。7歩後ろに進みます。右に8歩進みます。右に6歩進みます。左に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。向きを変えます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に6歩進みます。1歩前進します。左に10歩進みます。8歩前進します。9歩後退します。右に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。6歩前進します。7歩後退します。7歩後退します。8歩前進します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。4歩進みます。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。8歩後ろに進みます。9歩前に進みます。4歩前に進みます。左に2歩進みます。4歩前に進みます。6歩前に進みます。10歩後ろに進みます。右に8歩進みます。左に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。5歩進みます。5歩進みます。10歩進みます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。6歩進みます。8歩進みます。5歩進みます。6歩進みます。2歩進みます。1歩進みます。2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。向きを変えます。3歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。5歩後ろに進みます。2歩左に曲がります。5歩右に曲がります。3歩左に曲がります。5歩後ろに進みます。10歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。左に3歩進みます。右に10歩進みます。左に7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。右に曲がります。向きを変えます。左に曲がります。4歩進みます。左に曲がります。向きを変えます。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に9歩進みます。後方に1歩下がります。後方に4歩下がります。さらに後方に4歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。向きを変えます。5歩進みます。右に曲がります。右に曲がります。1歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。6歩進みます。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。左に曲がります。9歩進みます。7歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。6歩後ろに進みます。6歩前に進みます。6歩右に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 4歩進みます。2歩進みます。向きを変えます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩前進します。左に10歩進みます。4歩前進します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。右に曲がります。右に曲がります。6歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。2歩後退します。8歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 9歩進みます。6歩進みます。9歩進みます。6歩進みます。2歩進みます。左に曲がります。6歩進みます。向きを変えます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。向きを変えます。4歩進みます。6歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に8歩進みます。後方に5歩下がります。左方向に5歩進みます。前方に5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。5歩進みます。向きを変えます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。5歩前進します。7歩後退します。10歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。7歩進みます。10歩進みます。1歩進みます。左に曲がります。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。4歩前進します。右に5歩進みます。左に7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。左に曲がります。左に曲がります。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。5歩進みます。8歩進みます。右に曲がります。右に曲がります。5歩進みます。向きを変えます。2歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。8歩進みます。右に曲がります。右に曲がります。1歩進みます。7歩進みます。6歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。7歩前進します。4歩後退します。さらに4歩後退します。5歩前進します。7歩前進します。10歩後退します。さらに1歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。前方に9歩進みます。左に7歩進みます。後方に5歩下がります。右に4歩進みます。右に3歩進みます。後方に4歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に6歩進みます。右に5歩進みます。左に7歩進みます。左に3歩進みます。左に7歩進みます。右に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。5歩進みます。向きを変えます。向きを変えます。向きを変えます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。2歩前進します。2歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に8歩進みます。右に6歩進みます。右に10歩進みます。左に2歩進みます。左に5歩進みます。左に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。10歩進みます。10歩進みます。1歩進みます。7歩進みます。5歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。左に7歩進みます。後ろに2歩下がります。さらに7歩後ろに進みます。もう一度7歩後ろに進みます。前方に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。8歩進みます。7歩進みます。向きを変えます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。7歩前進します。7歩後退します。10歩後退します。10歩前進します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。9歩進みます。向きを変えます。9歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。9歩進みます。10歩進みます。左に曲がります。10歩進みます。右に曲がります。向きを変えます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。向きを変えます。1歩進みます。10歩進みます。向きを変えます。7歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に2歩進みます。右に4歩進みます。左に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。右に7歩進みます。前方に1歩進みます。左に3歩進みます。左に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。7歩進みます。向きを変えます。8歩進みます。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に2歩進みます。右に2歩進みます。左に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前を向いて進みます。左に6歩進みます。前に7歩進みます。左に8歩進みます。左に7歩進みます。前に6歩進みます。前に1歩進みます。前に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 9歩進みます。5歩進みます。2歩進みます。10歩進みます。右に曲がります。10歩進みます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。3歩進みます。向きを変えます。3歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に9歩進みます。後ろに4歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 9歩進みます。左に曲がります。左に曲がります。5歩進みます。4歩進みます。左に曲がります。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 4歩進みます。2歩進みます。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。1歩進みます。8歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に5歩進みます。左に5歩進みます。右に10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。2歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に10歩進みます。右方向に10歩進みます。後方に10歩下がります。前方に3歩進みます。前方に7歩進みます。左方向に9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に7歩進みます。左に8歩進みます。左に1歩進みます。左に9歩進みます。前に10歩進みます。前に5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に1歩進みます。左に9歩進みます。右に9歩進みます。後ろに1歩下がります。右に3歩進みます。後ろに6歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。4歩進みます。向きを変えます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。7歩前進します。3歩後退します。4歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。向きを変えます。10歩進みます。右に曲がります。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に1歩進みます。右に4歩進みます。左に5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。左に曲がります。左に曲がります。向きを変えます。5歩進みます。向きを変えます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に10歩進みます。後方に4歩下がります。前方に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。8歩後ろに進みます。2歩後ろに進みます。10歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に6歩進みます。後方に2歩進みます。後方に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。5歩進みます。2歩進みます。向きを変えます。8歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。4歩前進します。2歩後退します。10歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に9歩進みます。前に7歩進みます。右に9歩進みます。左に7歩進みます。後ろに7歩進みます。右に8歩進みます。左に10歩進みます。後ろに1歩進みます。前に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。9歩後ろに進みます。2歩前に進みます。1歩後ろに戻ります。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。5歩進みます。1歩進みます。6歩進みます。左に曲がります。7歩進みます。2歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩後ろに下がります。右に5歩進みます。左に3歩進みます。1歩後ろに下がります。5歩後ろに下がります。前に4歩進みます。前に3歩進みます。左に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に5歩進みます。後ろに8歩下がります。右に1歩進みます。後ろに7歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。10歩前進します。4歩前進します。7歩後退します。7歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。左に曲がります。1歩進みます。2歩進みます。向きを変えます。向きを変えます。向きを変えます。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に8歩進みます。右に9歩進みます。前方に2歩進みます。後方に10歩進みます。左に9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。1歩進みます。左に曲がります。左に曲がります。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。向きを変えます。右に曲がります。左に曲がります。2歩進みます。向きを変えます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩後ろに下がります。5歩前に進みます。10歩後ろに下がります。9歩前に進みます。7歩右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩前進します。10歩前進します。6歩後退します。7歩後退します。左に1歩進みます。右に10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に10歩進みます。前に4歩進みます。左に1歩進みます。後ろに4歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に3歩進みます。右に5歩進みます。後ろに2歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。右に曲がります。8歩進みます。4歩進みます。右に曲がります。右に曲がります。10歩進みます。1歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。もう一度向きを変えます。7歩進みます。6歩進みます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。10歩前進します。右に8歩進みます。右に8歩進みます。左に9歩進みます。右に6歩進みます。2歩前進します。9歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。9歩進みます。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。左に6歩進みます。後ろに3歩下がります。左に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。向きを変えます。10歩進みます。2歩進みます。向きを変えます。5歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。左に曲がります。10歩進みます。6歩進みます。左に曲がります。3歩進みます。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。8歩進みます。8歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。右に曲がります。右に曲がります。7歩進みます。向きを変えます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に9歩進みます。右に6歩進みます。後ろに10歩下がります。左に9歩進みます。左に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。6歩進みます。6歩進みます。左に曲がります。8歩進みます。1歩進みます。3歩進みます。7歩進みます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。6歩後ろに進みます。2歩後ろに進みます。1歩前に進みます。6歩前に進みます。3歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。向きを変えます。7歩進みます。左に曲がります。向きを変えます。向きを変えます。向きを変えます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。右に曲がります。7歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に4歩進みます。右に7歩進みます。左に1歩進みます。左に4歩進みます。左に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。7歩進みます。左に曲がります。左に曲がります。9歩進みます。2歩進みます。左に曲がります。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。左に曲がります。4歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。左に曲がります。6歩進みます。向きを変えます。2歩進みます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。2歩進みます。向きを変えます。4歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に5歩進みます。左に7歩進みます。右に8歩進みます。左に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。8歩進みます。2歩進みます。右に曲がります。8歩進みます。左に曲がります。6歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。8歩進みます。左に曲がります。3歩進みます。1歩進みます。6歩進みます。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。左に曲がります。6歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に5歩進みます。左に4歩進みます。左に1歩進みます。左に2歩進みます。右に2歩進みます。左に3歩進みます。前に5歩進みます。後ろに3歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。9歩進みます。向きを変えます。5歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に10歩進みます。右に10歩進みます。後ろに7歩進みます。前に7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に10歩進みます。右に7歩進みます。右に4歩進みます。左に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。2歩進みます。右に曲がります。右に曲がります。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。7歩後退します。6歩前進します。6歩後退します。7歩前進します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。左に曲がります。左に曲がります。1歩進みます。5歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。4歩後ろに進みます。8歩前に進みます。10歩後ろに進みます。2歩前に進みます。4歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。3歩前進します。3歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。6歩進みます。5歩進みます。向きを変えます。5歩進みます。3歩進みます。4歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に4歩進みます。右に5歩進みます。左に9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。左に曲がります。向きを変えます。1歩進みます。6歩進みます。左に曲がります。左に曲がります。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。5歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に9歩進みます。左に10歩進みます。後ろに10歩下がります。後ろに3歩下がります。後ろに5歩下がります。前に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。2歩進みます。8歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。6歩後ろに進みます。左に8歩進みます。右に3歩進みます。前に7歩進みます。右に3歩進みます。右に9歩進みます。1歩後ろに進みます。左に7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。5歩進みます。9歩進みます。7歩進みます。向きを変えます。1歩進みます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。7歩後ろに進みます。1歩前に進みます。1歩後ろに戻ります。5歩前に進みます。6歩後ろに進みます。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に8歩進みます。前に5歩進みます。前に10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。2歩進みます。3歩進みます。向きを変えます。4歩進みます。向きを変えます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に1歩進みます。前に2歩進みます。右に2歩進みます。右に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。2歩前進します。2歩後退します。4歩右方向に進みます。7歩右方向に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。4歩進みます。向きを変えます。10歩進みます。8歩進みます。向きを変えます。2歩進みます。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。10歩前進します。3歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。左に9歩進みます。前方に4歩進みます。前方に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に2歩進みます。後ろに4歩下がります。右に10歩進みます。左に2歩進みます。左に3歩進みます。右に7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。右に曲がります。6歩進みます。10歩進みます。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に1歩進みます。4歩前進します。8歩前進します。6歩後退します。左に1歩進みます。右に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に9歩進みます。右に5歩進みます。左に2歩進みます。右に2歩進みます。前に6歩進みます。後ろに10歩進みます。前に1歩進みます。左に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に8歩進みます。右に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。10歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に5歩進みます。左に7歩進みます。左に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。5歩進みます。10歩進みます。4歩進みます。4歩進みます。1歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。右に曲がります。5歩進みます。4歩進みます。向きを変えます。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。向きを変えます。左に曲がります。7歩進みます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。向きを変えます。2歩進みます。6歩進みます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に8歩進みます。右に9歩進みます。右に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。5歩進みます。1歩進みます。左に曲がります。左に曲がります。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。向きを変えます。9歩進みます。7歩進みます。6歩進みます。左に曲がります。2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。8歩進みます。10歩進みます。向きを変えます。もう一度向きを変えます。5歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 9歩進みます。左に曲がります。左に曲がります。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。3歩前進します。9歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。5歩前進します。7歩後退します。4歩右に進みます。10歩後退します。4歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に10歩進みます。前方に3歩進みます。右に8歩進みます。右に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に8歩進みます。左に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩後ろに下がります。左に4歩進みます。左に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に5歩進みます。後方に8歩下がります。前方に4歩進みます。右に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。向きを変えます。4歩進みます。1歩進みます。左に曲がります。向きを変えます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。向きを変えます。1歩進みます。9歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。向きを変えます。7歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。5歩後退します。8歩前進します。7歩前進します。5歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩前進します。左に4歩進みます。左に6歩進みます。右に10歩進みます。後ろに7歩下がります。左に5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。7歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。左に曲がります。6歩進みます。3歩進みます。向きを変えます。1歩進みます。3歩進みます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。向きを変えます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。1歩進みます。8歩進みます。4歩進みます。右に曲がります。右に曲がります。4歩進みます。左に曲がります。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 4歩進みます。5歩進みます。9歩進みます。3歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。1歩進みます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に8歩進みます。右に2歩進みます。右に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。10歩進みます。向きを変えます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に10歩進みます。後ろに8歩下がります。1歩下がります。さらに8歩下がります。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。7歩後ろに進みます。4歩左に曲がります。7歩左に進みます。7歩右に進みます。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。左に曲がります。向きを変えます。9歩進みます。8歩進みます。右に曲がります。向きを変えます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。2歩進みます。右に曲がります。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。10歩進みます。向きを変えます。6歩進みます。左に曲がります。右に曲がります。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。4歩進みます。3歩進みます。10歩進みます。左に曲がります。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。8歩後ろに進みます。8歩前に進みます。10歩前に進みます。8歩後ろに戻ります。8歩右に進みます。6歩後ろに進みます。7歩前に進みます。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。向きを変えます。4歩進みます。5歩進みます。左に曲がります。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。2歩進みます。2歩進みます。左に曲がります。5歩進みます。8歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。左に10歩進みます。右に7歩進みます。後ろに4歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。4歩進みます。7歩進みます。1歩進みます。2歩進みます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。6歩前進します。右に10歩進みます。右に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。向きを変えます。7歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に4歩進みます。左に5歩進みます。前方に6歩進みます。後方に8歩進みます。後方に5歩進みます。後方に1歩進みます。後方に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。3歩進みます。向きを変えます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。10歩進みます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。9歩進みます。2歩進みます。5歩進みます。右に曲がります。さらに右に曲がります。5歩進みます。10歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。5歩進みます。6歩進みます。4歩進みます。1歩進みます。向きを変えます。6歩進みます。10歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に8歩進みます。左に9歩進みます。右に8歩進みます。左に8歩進みます。右に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前を向いてください。9歩後ろに進みます。9歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 2歩進みます。3歩進みます。向きを変えます。4歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。10歩後ろに進みます。9歩後ろに進みます。9歩後ろに進みます。9歩左に進みます。10歩右に進みます。3歩右に進みます。3歩前に進みます。9歩右に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。右に曲がります。左に曲がります。5歩進みます。10歩進みます。7歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に10歩進みます。右に10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。8歩進みます。向きを変えます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。前方に10歩進みます。左に8歩進みます。後方に3歩下がります。右に7歩進みます。前方に2歩進みます。前方に4歩進みます。前方に10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。4歩前進します。右に9歩進みます。右に6歩進みます。右に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。5歩進みます。向きを変えます。3歩進みます。5歩進みます。右に曲がります。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。2歩後ろに下がります。5歩後ろに下がります。右に5歩進みます。右に9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。左に9歩進みます。前に10歩進みます。右に9歩進みます。後ろに10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 4歩進みます。向きを変えます。4歩進みます。向きを変えます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。4歩進みます。向きを変えます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。1歩進みます。7歩進みます。左に曲がります。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。左に曲がります。左に曲がります。9歩進みます。3歩進みます。3歩進みます。向きを変えます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。右に曲がります。7歩進みます。向きを変えます。7歩進みます。右に曲がります。左に曲がります。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 8歩進みます。9歩進みます。右に曲がります。右に曲がります。8歩進みます。9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 6歩進みます。向きを変えます。8歩進みます。2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に1歩進みます。前方に4歩進みます。前方に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。9歩進みます。向きを変えます。2歩進みます。7歩進みます。3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。1歩後ろに下がります。1歩後ろに下がります。1歩後ろに下がります。3歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。6歩後ろに進みます。右に8歩進みます。1歩後ろに戻ります。左に5歩進みます。左に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に9歩進みます。左に10歩進みます。左に3歩進みます。左に1歩進みます。後ろに3歩下がります。左に6歩進みます。前に3歩進みます。右に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。左に4歩進みます。前に3歩進みます。右に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に3歩進みます。後ろに1歩下がります。左に6歩進みます。前に1歩進みます。右に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。右に曲がります。向きを変えます。左に曲がります。4歩進みます。10歩進みます。8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。向きを変えます。9歩進みます。10歩進みます。向きを変えます。3歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。9歩進みます。向きを変えます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。1歩進みます。2歩進みます。9歩進みます。7歩進みます。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。1歩進みます。7歩進みます。1歩進みます。5歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 1歩進みます。1歩進みます。3歩進みます。左に曲がります。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。3歩進みます。2歩進みます。向きを変えます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。7歩進みます。向きを変えます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に7歩進みます。右に2歩進みます。後ろに5歩下がります。左に8歩進みます。前に7歩進みます。右に7歩進みます。前に9歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。7歩後ろに進みます。9歩左に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。4歩進みます。向きを変えます。4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に6歩進みます。右に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 右に曲がります。5歩進みます。向きを変えます。5歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。2歩後ろに下がります。3歩後ろに下がります。さらに3歩後ろに下がります。8歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 3歩進みます。10歩進みます。4歩進みます。1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 9歩進みます。向きを変えます。9歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に10歩進みます。後ろに7歩下がります。左に3歩進みます。後ろに8歩下がります。後ろに3歩下がります。右に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 7歩進みます。向きを変えます。もう一度向きを変えます。もう一度向きを変えます。1歩進みます。6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。5歩後ろに進みます。4歩後ろに進みます。9歩前に進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に5歩進みます。後ろに1歩下がります。右に4歩進みます。後ろに1歩下がります。左に8歩進みます。左に6歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。3歩前進します。3歩後退します。さらに3歩後退します。左に7歩進みます。右に7歩進みます。さらに8歩後退します。4歩後退します。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 向きを変えます。2歩進みます。8歩進みます。向きを変えます。10歩進みます。向きを変えます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。前方に6歩進みます。前方に4歩進みます。後方に9歩下がります。後方に1歩下がります。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 5歩進みます。5歩進みます。7歩進みます。10歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。6歩後ろに進みます。7歩左に進みます。4歩後ろに進みます。8歩後ろに進みます。3歩左に進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。2歩後退します。4歩後退します。6歩前進します。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 10歩進みます。向きを変えます。右に曲がります。左に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。左に7歩進みます。右に8歩進みます。後ろに10歩下がります。左に4歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に5歩進みます。後ろに4歩下がります。左に8歩進みます。左に5歩進みます。後ろに6歩下がります。前に9歩進みます。右に5歩進みます。前に1歩進みます。右に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。右に6歩進みます。1歩前進します。右に4歩進みます。左に4歩進みます。左に8歩進みます。2歩前進します。9歩前進します。左に3歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 左に曲がります。9歩進みます。3歩進みます。右に曲がります。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。右に6歩進みます。左に9歩進みます。左に5歩進みます。右に8歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "Yes"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向いてください。左に4歩進みます。後ろに5歩下がります。前に2歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に正面を向いてください。10歩後ろに進みます。8歩後ろに進みます。10歩前に進みます。7歩後ろに進みます。1歩前に進みます。右に7歩進みます。左に1歩進みます。右に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
{"input": "これらの指示に従った場合、出発点に戻りますか？ 常に前方を向きます。7歩後ろに進みます。右に10歩進みます。4歩前に進みます。左に1歩進みます。\n選択肢:\n- はい\n- いいえ", "target": "No"}
