{"input": "以下の文は妥当でしょうか？「エリアス・リンドホルムがブザービーターを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョン・カールソンが第3ピリオドで得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マルセロがスルーパスに反応して得点した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「デショーン・ワトソンがイースタン・カンファレンス決勝でゴールテンディングの反則を取られた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ムーキー・ベッツがネットの後ろを滑った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョン・タヴァレスがスタンレーカップでシンビンを受けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ダビド・シルバがスローインを行った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ブライス・ハーパーがバックショルダーフェードを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カルレス・プジョルがディフェンダーに対してマラドーナのような技を披露した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ロビン・レーナーが必死のロングシュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カーソン・ウェンツが氷上に立った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「クワドォー・アサモアがそのプレーで反則を取られた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジャック・フラハーティがナショナルリーグチャンピオンシップシリーズで一塁へ歩いた」（※「歩いた」は野球用語で「四球で進塁した」の意）", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジェイソン・テイタムがディフェンダーを股抜きした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ドギー・ハミルトンがブザービーターを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フレデリク・アンデルセンがスタンレー・カップのブルーラインを越えた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フレディ・フリーマンはボールが通過するのを見送った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アダム・シーレンが延長戦で得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トム・ブレイディがファーストダウンを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジョルジョ・キエッリーニがFAカップでハンドを犯した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「タイリーク・ヒルがスクリーンパスをキャッチした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フレデリク・アンデルセンがスリーポイントシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アダム・シーレンが出塁した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェラール・ピケがコーナーキックを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「カイラー・ヤマモトが欧州チャンピオンズカップでスライディングタックルを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「コービン・バーンズが間接フリーキックを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ラメロ・ボールがウェスタン・カンファレンス決勝でハーフコートショットを放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ヨナス・バランチュナスがブザービーターを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ザック・ラヴィーンがパックをシュートした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ナゼム・カドリがNBAファイナルでチャージングを記録した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「デロン・ライトが第4ダウンでギャンブルを試みた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マルコム・ブログドンがシュートをバンクショットで決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マイケル・コンフォルトが3秒ルール違反を犯した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヤクブ・ヴラナがサヨナラホームランを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トム・ウィルソンがペナルティーキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アレクサンダー・バルコヴがパスを出した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マリック・ビーズリーが3秒ルール違反を犯した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ドレイモンド・グリーンがタッチダウンを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「T.Y.ヒルトンがAFCディビジョナルラウンドでタッチダウンパスを投げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ロバート・ウッズがファーストダウンを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジュリアン・エデルマンがボールを落とした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ネイマールがスタンレー・カップでバックハンドシュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョナサン・マルケスがスタンレー・カップのパワープレーで得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フレッド・ヴァンブリートがチャンピオンズリーグ決勝でフリーキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「サンティ・カソルラがスクリーンプレーを指示した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「エディンソン・カバーニがスクリーンパスをキャッチした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「DJチャークがNFCディビジョナルラウンドでバックショルダーフェードを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ペトル・チェフが3ポイントシュートを外した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マイケル・ポーター・ジュニアがスクリーンプレーを指示した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ロベルト・レヴァンドフスキがタッチダウンパスを投げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フィリップ・リバースがヘイルメリーパスを成功させた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ドリュー・ブリーズが第4ダウンでギャンブルを試みた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ケビン・デュラントがサヨナラホームランを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「サンティ・カソルラがチャンピオンズリーグ決勝でレッドカードを受けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ライアン・タネヒルが三塁打を打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「グレイバー・トーレスが安打を記録した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クワイ・レナードがターンアラウンド・ジャンパーを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ブランディン・クックスが第4ダウンでギャンブルを試みた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クリント・カペラがエンドゾーンに入った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ハビエル・サネッティがナショナルリーグチャンピオンシップシリーズで投球を見送った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ウェイン・ルーニーがスーパーボウルでタッチダウンパスを投げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「タイラー・ボイドがNFCディビジョナルラウンドでスクリーンパスを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マルアン・フェライニが延長戦で得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジョアン・モウティーニョが三塁でアウトになった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヴァンサン・コンパニが3秒ルール違反を犯した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トゥッカ・ラスクがパワープレイを阻止した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フアン・ソトがスリーポイントラインの外側からシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョーダン・ビニングトンが第3ピリオドで得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マルコム・ブログドンがイースタン・カンファレンス決勝で制限区域内にドライブした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ディディエ・ドログバがエンドゾーンに入った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マイク・ホフマンがウェスタン・カンファレンス決勝でハーフコートシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ペドロが三者連続三振を奪った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フェルナンド・タティス・ジュニアがレッドカードを受けた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「エヴァンダー・ケインがAFCディビジョンラウンドでスラントパスを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「イーゴリ・シェステリンがヘイルメリーパスを成功させた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ゲリット・コールが欧州カップ戦でハンドボールを犯した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フィリップ・リヴァースが制限区域に進入した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ノーマン・パウエルがブロックファウルを犯した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ナゼム・カドリが自宅で不在だった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「スターリング・シェパードがファーストダウンを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マリオ・ゴメスがリバースレイアップを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アンドレス・イニエスタがワンツープレーを行った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ドリュー・ブリーズがそのプレーで反則を取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ラミレスがヘディングシュートで得点を決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ルイス・ロベルトは二塁でアウトになった」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マシュー・スタッフォードがヘイルメリーパスを放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「T・Y・ヒルトンがそのプレーでフラッグを掲げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「コートランド・サットンが三塁打を打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マーク・ストーンはスタンレー・カップの試合でシンビンを受けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「デヨンテ・マレーがサイドステップ・スリーを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マイク・トラウトがユーロステップでゴールに迫った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョシュ・アレンがスクリーンパスを成功させた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ヤヤ・トゥーレがフリーキックを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ショーン・クーチュリエがディフェンダーに対してマラドーナ式のプレーを見せた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ミッチェル・マルナーがディフェンダーを股抜きした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カルビン・リドリーがネットの後ろを滑った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ウォーカー・ビューラーがシンビンを宣告された」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カルロス・テベスが逆方向にスケートをした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ベン・シモンズがゴールテンディングの反則を取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マービン・ジョーンズがパックのコントロールを失った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ブラッド・ハンドがホイールルートを打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アレクサンダー・バルコフが3ポイントシュートを外した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョシュ・アレンがスクリーンパスをキャッチした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「コナー・マクデイビッドがNFCディビジョナルラウンドでタッチダウンパスを投げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アマリ・クーパーがペナルティーキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マリオ・バロテッリがチャンピオンズリーグ決勝で左足シュートを放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ウィリアンがパワープレーを阻止した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ケンドリック・ナンがチャージを受けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クーパー・カップがスタンレー・カップ第3ピリオドで得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ショーン・クーチュリエがスタンレー・カップでパスを成功させた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「スターリング・シェパードがサヨナラホームランを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヘスス・ルサルドがスラッシングの反則を取られた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「キーナン・アレンがNFCチャンピオンシップのプレーで反則を取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジャマール・マレーが4つ目のボールカウントで出塁した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トニ・クロースがワンツーパスを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ミッチェル・トゥルビスキーがスクリーンパスをキャッチした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「セルヒオ・ブスケツが塁に出た」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ドマンタス・サボニスがAFCチャンピオンシップで5ヤードを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「デアーロン・フォックスがバイシクルキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェームス・ハーデンが18フィートラインの外側からシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「パトリック・ケインがスタンレー・カップ戦でバックハンドショットを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マルコム・ブログドンがNBAチャンピオンシップでユーロステップを決めてゴール下まで攻め込んだ」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジェームズ・カリンチャクがブルーラインを越えた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョー・バロウが5ヤードを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「スティーブン・スタムコスがスラントパスを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョン・カールソンがスタンレー・カップの攻撃ゾーンに入った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「パトリス・バージェロンがファーストダウンを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ルーク・ボイトは一塁でアウトになった」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ティモ・メイヤーがFAカップ戦でディフェンダーをヌックムした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マックス・シャーザーが一塁でセーフとなった」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「エデン・アザールがブザービーターを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ニール・ピオンクが6ヤードラインからシュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ニック・カステヤノスがウィリー走行を決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トム・ブレイディは当初セーフだった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「セルヒオ・ラモスはゴールを外さなかった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「キリ・トーマスはNFCチャンピオンシップゲームでバックフィールド内で方向転換した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「レオン・ドライザイトルがナショナルリーグ優勝決定シリーズでセカンドゴロに倒れた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「バスティアン・シュヴァインシュタイガーが延長戦で得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アーロン・ノラがファーストダウンを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ケーテル・マルテがエンドゾーンに入った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トラビス・コネッシーがディフェンダーに対してマラドーナのような技を披露した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ピエール＝リュック・デュボアが後ろ向きに滑った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ライアン・オライリーがリストショットを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ミロ・ヘイスカネンがシンビンを宣告された」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アンヘル・ディ・マリアが延長戦で得点を挙げた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「サム・ダーノルドがスタンレー・カップでパワープレーから得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「グレイバー・トーレスがバイシクルキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「タイラー・グラスノーがペナルティキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「デバンテ・パーカーがアイシングの反則を取られた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェイソン・テイタムにゴールテンディングの反則が取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「カーソン・ウェンツがスクリーンパスをキャッチした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ブライス・ハーパーがボールをファンブルした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「キーナン・アレンがウェスタン・カンファレンス決勝でブザービーターを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マーセル・オズナがタッチダウンを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ブランドン・ウッドラフがイースタン・カンファレンス決勝でハードスクリーンを仕掛けた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヨナス・バランチュナスがブザービーターを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ナーレンズ・ノエルが自宅で不在だった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「パウローニョがFAカップで間接フリーキックを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クラース・ヤン・フンテラールがパックをシュートした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ダビド・パストルナクが後ろ向きにスケートをした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジョー・バロウがスーパーボウルでバックショルダーフェードパスをキャッチした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「セルヒオ・アグエロがディフェンダーに対してマラドーナ式のプレーを見せた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ゲリット・コールがハードスクリーンを仕掛けた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「C・J・マッカラムが6ヤードラインからシュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カイル・タッカーが左足シュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヤクブ・ヴラナが後ろ向きにスケートをした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「デショーン・ワトソンがそのプレーで反則を取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「タイラー・グラスノーは球が通過するのを見送った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フアン・ソトが4つ目のボールカウントで出塁した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アンソニー・デイビスがブザービーターを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「カリス・ラヴァートがリバースレイアップを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アンドレイ・スヴェチニコフがボール4番を取った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トレイ・ヤングがエンドゾーンに入った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ネイサン・マキノンがイースタン・カンファレンス決勝で3ポイントシュートを外した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「A・J・グリーンが第3ピリオドで得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「エリアス・リンドホルムがスナップを受けた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フレッド・ヴァンブリートがパスを出した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フレデリク・アンデルセンがファーストダウンを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ハビエル・マスチェラーノが左足でシュートを放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マイク・トラウトがサヨナラホームランを放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ピーター・アロンソがワールドシリーズで三塁打を放った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アンソニー・リゾがスタンレー・カップで逆向きに滑った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フランシスコ・リンドーアが4つ目のボールカウントで出塁した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クラース・ヤン・フンテラールが簡単なレイアップシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ステフォン・ディグスがスラントパスを成功させた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ディエゴ・フォルランがディフェンダーに対してマラドーナ風のプレーを見せた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジョージ・スプリンガーがブロックファウルを犯した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「アリエン・ロッベンがスタンレー・カップでブルーラインを越えた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ミッチェル・ロビンソンがシュートをエアボールした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ガブリエル・ランデスコグが必死のロングシュートを放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ヴァンサン・コンパニがバイシクルキックを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マシュー・バーザルがスクリーンプレーを指示した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カイラー・ヤマモトがバックショルダーフェードをキャッチした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「パトリス・バージェロンがバックハンドショットを打った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「コリン・セクストンがブザービーターを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ステファン・エル・シャーラウィは左足でシュートを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ニック・フォールズがパックのコントロールを失った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ライアン・ニュージェント＝ホプキンスがパワープレイを阻止した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「カイル・コナーがウェスタン・カンファレンス決勝でユーロステップを決めてゴールに迫った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ルカ・モドリッチがFAカップでスパイクの爪先を上げてプレーした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ダニエウ・アウヴェスがスナップを受けた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ラッセル・ウェストブルックがパワープレーで得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マーク・ストーンが三塁打を打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「テウヴォ・テラヴァイネンがパックをシュートした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジョン・ブラウンはNFCチャンピオンシップで4thダウンにギャンブルを仕掛けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「クワドォー・アサモアがイースタン・カンファレンス決勝でショットクロックを破った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カイル・タッカーが一塁ベースを踏んだ」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ネイマールがチャンピオンズリーグ準決勝でディフェンダーに対してマラドーナ級のプレーを見せた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ムーキー・ベッツがサイドステップ・スリーを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ソニー・グレイは二塁でアウトになった」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「フアン・ソトがダブルステップオーバーを行った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フアン・マタがチャンピオンズリーグ決勝でバイシクルキックを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ディラン・ラーキンが4つ目のボールカウントで出塁した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ブランドン・ロウが左足でシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「カリス・ラヴァートがリバースダンクを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「エマニュエル・サンダースが安打を放った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ロバート・ウッズがパワープレイを阻止した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジョナサン・マルケスが5ホール連続でホールインワンを達成した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「トリスタン・ジャリーがダンクシュートを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ウェイン・ルーニーがピッチが通り過ぎるのを眺めていた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マイケル・トーマスがスナップを受けた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「デショーン・ワトソンがコーナーキックを蹴った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ムーキー・ベッツがパワープレーで得点を挙げた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トゥッカ・ラスクが二塁打を打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「トニ・クロースがチャンピオンズリーグ準決勝でスローインを行った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マイク・ウィリアムズがスーパーボウルでボールをファンブルした」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「アレン・ロビンソンが5ヤードを獲得した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マリオ・ゴメスがリバースレイアップを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「フアン・マタがスクリーンパスをキャッチした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェイミソン・クローダーがそのプレーで反則を取られた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「マイク・ウィリアムズがFAカップでバイシクルキックを決めた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ペトル・チェフは当初安全だった」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェイソン・テイタムがNBAチャンピオンシップでサイドステップスリーポイントシュートを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「トーマス・ミュラーが三塁打を打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジェームズ・カリンチャクがフルカウントで投球した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジェリー・ジューディがパワープレイを阻止した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ステフィン・カリーがリバースレイアップを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ミカル・ブリッジズがウィンドミルダンクを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ライアン・フィッツパトリックがタッチダウンを決めた」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ジェイレン・ブラウンが3秒ルール違反を犯した」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「前田健太がスクリーンパスをキャッチした」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「クリス・ゴッドウィンがスタンレーカップでブルーラインを越えた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ジャスティン・ハバートがディフェンダーに対してマラドーナ式のプレーを見せた」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「ブレイク・スネルが単打を打った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ダリアス・スレイトンがAFCチャンピオンシップでアウトオブバウンズとなった」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ニクラス・バックストロームがシンビンを宣告された」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ペペがファーストダウンを獲得した」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「前田健太がアメリカンリーグ優勝決定シリーズで一塁への送球を行った」", "target": "yes"}
{"input": "以下の文は妥当でしょうか？「ライアン・オライリーがホイールルートを打った」", "target": "no"}
{"input": "以下の文は妥当でしょうか？「マーセル・オズナが併殺打を喫した」", "target": "yes"}
