{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『ロリータ』を手に入れます。\n学期が進むにつれて、彼らは新しい本を中心に交換を始めます。まずクレアとボブが本を交換します。次にボブとアリスが本を交換します。最後にクレアとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『ロリータ』", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『オデュッセイア』、クレアは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『オデュッセイア』\n(C) 『キャッチ=22』", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『キャッチ=22』、クレアは『ユリシーズ』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にクレアとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『キャッチ=22』\n(C) 『ユリシーズ』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはローラと、クレアはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わるとき、アリスのパートナーは\n選択肢:\n(A) ヘルガ\n(B) ローラ\n(C) オフィーリア", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『オデュッセイア』、クレアは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にボブとアリスが本を交換します。最後にクレアとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『オデュッセイア』\n(C) 『ロリータ』", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『グレート・ギャツビー』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『グレート・ギャツビー』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはメリッサと、クレアはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) イジー\n(B) メリッサ\n(C) ローラ", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『オデュッセイア』、クレアは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にアリスとクレアが本を交換します。最後にボブとクレアが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『オデュッセイア』\n(C) 『ロリータ』", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは赤色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 赤色のボール\n(C) 白色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは茶色のボール、クレアは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にボブとアリスがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 茶色のボール\n(C) 緑色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブはオレンジ色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にボブとアリスがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) オレンジ色のボール\n(C) 白色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはロドリゴと、クレアはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) カール\n(B) ロドリゴ\n(C) ヘルガ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは黒色のボール、クレアは白色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 黒色のボール\n(C) 白色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはオレンジ色のボール、ボブは紫色のプレゼント、クレアは赤色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 紫色のプレゼント\n(C) 赤色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは赤色のボール、クレアは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にクレアとアリスがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 赤色のボール\n(C) 黄色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはジェイミーと、クレアはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にアリスとボブがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) オフィーリア\n(B) ジェイミー\n(C) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ウィンガー、クレアはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にアリスとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ウィンガー\n(C) センターミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは右ウイング、クレアはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にボブとクレアがポジションを交換します。最後にアリスとボブがポジションを交換します。試合終了時、アリスが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) 右ウイング\n(C) ベンチウォーマー", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『ユリシーズ』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にボブとクレアが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはローラと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) オフィーリア\n(B) ローラ\n(C) イジー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは中央ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 中央ミッドフィールダー\n(C) フォワード", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはパトリックと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ヘルガ\n(B) パトリック\n(C) サム", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは黄色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 黄色のボール\n(C) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『グレート・ギャツビー』、クレアは『ユリシーズ』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にクレアとボブが本を交換します。最後にボブとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『グレート・ギャツビー』\n(C) 『ユリシーズ』", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にボブとアリスが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『指輪物語』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは白色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは白色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 白色のプレゼント\n(C) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『グレート・ギャツビー』、クレアは『ユリシーズ』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にクレアとボブが本を交換します。最後にボブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『グレート・ギャツビー』\n(C) 『ユリシーズ』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはロドリゴと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) カール\n(B) ロドリゴ\n(C) パトリック", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーはそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブはオレンジ色のボール、クレアは緑色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) オレンジ色のボール\n(C) 緑色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはパトリックと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ジェイミー\n(B) パトリック\n(C) メリッサ", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはサムと、クレアはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) サム\n(C) ローラ", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブはピンク色のボール、クレアは黒色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) ピンク色のボール\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『フランケンシュタイン』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にアリスとボブが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『フランケンシュタイン』\n(C) 『オデュッセイア』", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは紫色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとクレアがボールを交換します。次にボブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 紫色のボール\n(C) 青色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは黄色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 黄色のボール\n(C) 白色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスはオレンジ色のボール、ボブは紫色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 紫色のプレゼント\n(C) 青色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは茶色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはパトリックと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ローラ\n(B) パトリック\n(C) メリッサ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアは緑色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) 緑色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフルバック、ボブはゴールキーパー、クレアは右ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にアリスとボブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) フルバック\n(B) ゴールキーパー\n(C) 右ウィンガー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブはベンチウォーマー、クレアは左ウィングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) ベンチウォーマー\n(C) 左ウィング", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは緑色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 緑色のボール\n(C) 青色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『グレート・ギャツビー』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黒色のボール、ボブは紫色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 紫色のプレゼント\n(C) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブは青色のプレゼント、クレアはピンク色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) 青色のプレゼント\n(C) ピンク色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『オデュッセイア』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとボブが本を交換します。最後にアリスとクレアが再び本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『オデュッセイア』\n(C) 『グレート・ギャツビー』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交代します。次にアリスとクレアがポジションを交代します。最後にボブとアリスがポジションを交代します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) 左ミッドフィールダー\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブは黒色のボール、クレアは紫色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 黒色のボール\n(C) 紫色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『フランケンシュタイン』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとボブが本を交換します。最後にクレアとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『フランケンシュタイン』\n(C) 『グレート・ギャツビー』", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 青色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは青色のボール、クレアは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にクレアとアリスがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 青色のボール\n(C) 紫色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『キャッチ=22』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にクレアとアリスが本を交換します。最後にアリスとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『キャッチ=22』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはカールと、クレアはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にアリスとボブがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) サム\n(B) カール\n(C) ヘルガ", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはベンチウォーマー、クレアはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ベンチウォーマー\n(C) センターミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは青色のボール、クレアはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 青色のボール\n(C) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『フランケンシュタイン』、クレアは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にアリスとクレアが本を交換します。最後にクレアとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『フランケンシュタイン』\n(C) 『ロリータ』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交代します。次にアリスとクレアがポジションを交代します。最後にボブとアリスがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『ロリータ』、ボブは『キャッチ=22』、クレアは『グレート・ギャツビー』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にボブとアリスが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『キャッチ=22』\n(C) 『グレート・ギャツビー』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはローラと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) サム\n(B) ローラ\n(C) カール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブはセンターミッドフィールダー、クレアはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にアリスとボブが再びポジションを交換します。試合終了時、クレアがプレーしているのは\n選択肢:\n(A) 左ミッドフィールダー\n(B) センターミッドフィールダー\n(C) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアはサイドバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交代します。次にアリスとボブがポジションを交代します。最後にボブとクレアがポジションを交代します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) サイドバック", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはフルバック、クレアは右ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にアリスとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) フルバック\n(C) 右ウィンガー", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブはオレンジ色のボール、クレアは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にボブとクレアがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) オレンジ色のボール\n(C) 緑色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは青色のボール、クレアは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 青色のボール\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは茶色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 茶色のプレゼント\n(C) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは青色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 青色のプレゼント\n(C) 茶色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは右ウィング、クレアはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) チアリーダー\n(B) 右ウィング\n(C) フルバック", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは茶色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはカールと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) メリッサ\n(B) カール\n(C) パトリック", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは紫色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとクレアがボールを交換します。次にボブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 紫色のボール\n(C) 青色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは黒色のボール、クレアは紫色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 黒色のボール\n(C) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは黄色のプレゼント、クレアはオレンジ色のボールです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 黄色のプレゼント\n(C) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黒色のボール、ボブはオレンジ色のボール、クレアは白色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) オレンジ色のボール\n(C) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『オデュッセイア』、ボブは『指輪物語』、クレアは『バスカヴィル家の犬』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にクレアとボブが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『指輪物語』\n(C) 『バスカヴィル家の犬』", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは茶色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『ロリータ』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にボブとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『ロリータ』\n(C) 『グレート・ギャツビー』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはオフィーリアと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ヘルガ\n(B) オフィーリア\n(C) サム", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはフルバック、クレアは右ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にアリスとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) フルバック\n(C) 右ウィンガー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは左ミッドフィールダー、クレアは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にクレアとボブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 左ミッドフィールダー\n(C) 左ウィンガー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはカールと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) パトリック\n(B) カール\n(C) イジー", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にクレアとアリスがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 白色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとアリスが本を交換します。最後にクレアとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) フォワード", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『オデュッセイア』、クレアは『ユリシーズ』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にクレアとボブが本を交換します。最後にボブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『オデュッセイア』\n(C) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーはそれぞれ異なる色のプレゼントを持っています：アリスは黒色のボール、ボブは緑色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは黒色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にクレアとアリスがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 黒色のボール\n(C) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはセンターミッドフィールダー、ボブはベンチウォーマー、クレアはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にアリスとボブがポジションを交換します。最後にアリスとクレアが再びポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) ベンチウォーマー\n(C) フルバック", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフルバック、ボブはゴールキーパー、クレアは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) フルバック\n(B) ゴールキーパー\n(C) 左ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブは左ミッドフィールダー、クレアはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとアリスがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) 左ミッドフィールダー\n(C) センターミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは黄色のプレゼント、ボブは白色のプレゼント、クレアは紫色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 白色のプレゼント\n(C) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはロドリゴと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にアリスとボブがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) オフィーリア\n(B) ロドリゴ\n(C) カール", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『キャッチ=22』、クレアは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にボブとクレアが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『キャッチ=22』\n(C) 『白鯨』", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとボブが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『グレート・ギャツビー』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブは青色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 青色のプレゼント\n(C) 茶色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にボブとアリスが再び本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『オデュッセイア』", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは緑色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 緑色のボール\n(C) 白色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはヘルガと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) サム\n(B) ヘルガ\n(C) カール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはパトリックと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ジェイミー\n(B) パトリック\n(C) メリッサ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブは青色のプレゼント、クレアは黄色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) 青色のプレゼント\n(C) 黄色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは白色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にボブとクレアがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 白色のボール\n(C) 青色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはサムと、クレアはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ヘルガ\n(B) サム\n(C) ジェイミー", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは白色のボール、クレアは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 白色のボール\n(C) 紫色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスはオレンジ色のボール、ボブは紫色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 紫色のプレゼント\n(C) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは白色のボール、クレアは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 白色のボール\n(C) 赤色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは黄色のプレゼント、ボブは緑色のプレゼント、クレアは紫色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 緑色のプレゼント\n(C) 紫色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『キャッチ=22』、クレアは『ユリシーズ』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にクレアとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『キャッチ=22』\n(C) 『ユリシーズ』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ミッドフィールダー、ボブはゴールキーパー、クレアは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交代します。次にボブとクレアがポジションを交代します。最後にアリスとクレアがポジションを交代します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) ゴールキーパー\n(C) 左ウィンガー", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『フランケンシュタイン』、クレアは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にボブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『フランケンシュタイン』\n(C) 『真珠』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黒色のボール、クレアは青色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黒色のボール\n(C) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスは黒色のボール、ボブは紫色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 紫色のプレゼント\n(C) 青色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスは黒色のボール、ボブは紫色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 紫色のプレゼント\n(C) 青色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは黒色のボール、クレアは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にクレアとアリスがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 黒色のボール\n(C) 紫色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) フォワード", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはイジーと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にアリスとボブがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) パトリック\n(B) イジー\n(C) カール", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは赤色のボール、クレアは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にクレアとボブがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 赤色のボール\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『ロリータ』、クレアは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『ロリータ』\n(C) 『バスカヴィル家の犬』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブはゴールキーパー、クレアは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交代します。次にクレアとアリスがポジションを交代します。最後にアリスとボブがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) ゴールキーパー\n(C) 右ウイング", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) メリッサ\n(B) サム\n(C) カール", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは赤色のボール、クレアは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 赤色のボール\n(C) 緑色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ミッドフィールダー、ボブはゴールキーパー、クレアは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) ゴールキーパー\n(C) 左ウィンガー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはセンターミッドフィールダー、ボブは右ミッドフィールダー、クレアは右ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にアリスとボブがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ミッドフィールダー\n(C) 右ウィンガー", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとアリスが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは白色のプレゼント、クレアは紫色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 白色のプレゼント\n(C) 紫色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブはフルバック、クレアは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にボブとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) フルバック\n(C) 左ウィンガー", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『キャッチ=22』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にクレアとアリスが本を交換します。最後にアリスとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『キャッチ=22』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスはピンク色のボール、ボブは青色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 青色のプレゼント\n(C) 茶色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『バスカヴィル家の犬』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にアリスとボブが本を交換します。最後にクレアとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『バスカヴィル家の犬』\n(C) 『指輪物語』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアはオレンジ色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは黒色のボール、ボブは白色のプレゼント、クレアはピンク色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 白色のプレゼント\n(C) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブは白色のプレゼント、クレアはオレンジ色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 白色のプレゼント\n(C) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはジェイミーと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) オフィーリア\n(B) ジェイミー\n(C) メリッサ", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『指輪物語』、クレアは『真珠』を購入します。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『指輪物語』\n(C) 『真珠』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはジェイミーと、クレアはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) イジー\n(B) ジェイミー\n(C) ロドリゴ", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは青色のボール、クレアは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 青色のボール\n(C) 茶色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『オデュッセイア』、クレアは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとボブが本を交換します。最後にアリスとクレアが再び本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『オデュッセイア』\n(C) 『グレート・ギャツビー』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブはフォワード、クレアはサイドバックです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずボブとアリスがポジションを交代します。次にアリスとクレアがポジションを交代します。最後にクレアとボブがポジションを交代します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) フォワード\n(C) サイドバック", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブはセンターミッドフィールダー、クレアはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にアリスとボブがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) センターミッドフィールダー\n(C) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは白色のボール、ボブは紫色のボール、クレアはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にボブとクレアがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 白色のボール\n(B) 紫色のボール\n(C) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) サム", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは黄色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 黄色のボール\n(C) 白色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは茶色のプレゼント、クレアは黄色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のプレゼント\n(C) 黄色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは茶色のプレゼント、クレアは白色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 茶色のプレゼント\n(C) 白色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはディフェンダー、ボブはサポーター、クレアは左ウィングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交代します。次にボブとアリスがポジションを交代します。最後にボブとクレアがポジションを交代します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ディフェンダー\n(B) サポーター\n(C) 左ウィング", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『ロリータ』、クレアは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『ロリータ』\n(C) 『バスカヴィル家の犬』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブはピンク色のボール、クレアは黒色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) ピンク色のボール\n(C) 黒色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはベンチウォーマー、クレアはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交代します。次にアリスとクレアがポジションを交代します。最後にクレアとボブがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ベンチウォーマー\n(C) センターミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは黄色のプレゼント、ボブは緑色のプレゼント、クレアは紫色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 緑色のプレゼント\n(C) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブはピンク色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にクレアとアリスがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) ピンク色のボール\n(C) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはイジーと、クレアはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にアリスとボブがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) パトリック\n(B) イジー\n(C) カール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは右ウィング、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) 右ウィング\n(C) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『オデュッセイア』、クレアは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にクレアとボブが本を交換します。最後にボブとアリスが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『オデュッセイア』\n(C) 『ユリシーズ』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは右ウィンガー、クレアはフルバックを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交代します。次にボブとクレアがポジションを交代します。最後にクレアとアリスがポジションを交代します。試合終了時、アリスが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) 右ウィンガー\n(C) フルバック", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとアリスが本を交換します。最後にクレアとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは緑色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 緑色のボール\n(C) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブは右ミッドフィールダー、クレアはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) 右ミッドフィールダー\n(C) フルバック", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ウィンガー、クレアは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にアリスとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ウィンガー\n(C) 左ミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブはオレンジ色のボール、クレアは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) オレンジ色のボール\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは赤色のボール、クレアは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとクレアがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 赤色のボール\n(C) 緑色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは茶色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとクレアがボールを交換します。次にボブとクレアがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のボール\n(C) 白色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは赤色のボール、クレアはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 赤色のボール\n(C) ピンク色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『真珠』、クレアは『オデュッセイア』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にボブとアリスが本を交換します。最後にアリスとクレアが再び本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『真珠』\n(C) 『オデュッセイア』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) メリッサ\n(B) ローラ\n(C) イジー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) イジー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブはベンチウォーマー、クレアはストライカーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) ベンチウォーマー\n(C) ストライカー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは右ウィンガー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、アリスが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) 右ウィンガー\n(C) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にボブとアリスが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『指輪物語』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアは黒色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ウィンガー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にボブとアリスがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウィンガー\n(C) ゴールキーパー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは中央ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 中央ミッドフィールダー\n(C) フォワード", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはロドリゴと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わるとき、アリスのパートナーは\n選択肢:\n(A) オフィーリア\n(B) ロドリゴ\n(C) パトリック", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは黄色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 黄色のボール\n(C) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは左ウィング、クレアはベンチウォーマーです。\n試合が進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交代します。次にアリスとボブがポジションを交代します。最後にクレアとアリスがポジションを交代します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 左ウィング\n(C) ベンチウォーマー", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にクレアとアリスがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 白色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『グレート・ギャツビー』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとボブが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『グレート・ギャツビー』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) メリッサ\n(B) ローラ\n(C) パトリック", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは白色のプレゼント、クレアは黒色のボールです。\nイベントが進むにつれ、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 白色のプレゼント\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『真珠』、クレアは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『真珠』\n(C) 『フランケンシュタイン』", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『真珠』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にクレアとアリスが本を交換します。最後にボブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『真珠』\n(C) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはジェイミーと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) サム\n(B) ジェイミー\n(C) メリッサ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはジェイミーと、クレアはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わるとき、クレアのパートナーは\n選択肢:\n(A) イジー\n(B) ジェイミー\n(C) ロドリゴ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはジェイミーと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) サム\n(B) ジェイミー\n(C) メリッサ", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『指輪物語』、クレアは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にボブとクレアが本を交換します。最後にアリスとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『指輪物語』\n(C) 『真珠』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ウィンガー、クレアは右ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にアリスとボブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ウィンガー\n(C) 右ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは緑色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 緑色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交代します。次にアリスとボブがポジションを交代します。最後にボブとクレアがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) フルバック", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『白鯨』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にアリスとクレアが本を交換します。最後にクレアとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『白鯨』\n(C) 『オデュッセイア』", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは黒色のボール、クレアは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとクレアがボールを交換します。次にクレアとボブがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 黒色のボール\n(C) 茶色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『フランケンシュタイン』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『フランケンシュタイン』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは紫色のプレゼント、クレアは緑色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 紫色のプレゼント\n(C) 緑色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは青色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 青色のプレゼント\n(C) 茶色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『フランケンシュタイン』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『フランケンシュタイン』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはパトリックと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ヘルガ\n(B) パトリック\n(C) イジー\nと踊っています。", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはパトリックと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ヘルガ\n(B) パトリック\n(C) サム", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) ローラ", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは黒色のボール、クレアは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にクレアとアリスがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 黒色のボール\n(C) 紫色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブは黄色のプレゼント、クレアはオレンジ色のボールです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にアリスとクレアがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 黄色のプレゼント\n(C) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、クレアがプレーしているのは\n選択肢:\n(A) フォワード\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは赤色のプレゼント、ボブは青色のプレゼント、クレアは黄色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 青色のプレゼント\n(C) 黄色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わるとき、クレアのパートナーは\n選択肢:\n(A) メリッサ\n(B) ローラ\n(C) イジー", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黒色のボール、ボブは緑色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にアリスとボブがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) フォワード", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ウィンガー、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にボブとアリスがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウィンガー\n(C) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブはオレンジ色のボール、クレアは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとボブがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) オレンジ色のボール\n(C) 黒色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはストライカー、ボブは右ウィンガー、クレアは右ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ストライカー\n(B) 右ウィンガー\n(C) 右ミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはパトリックと、クレアはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) イジー\n(B) パトリック\n(C) オフィーリア", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは赤色のプレゼント、クレアは白色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 赤色のプレゼント\n(C) 白色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは黄色のボール、クレアはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 黄色のボール\n(C) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは茶色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 茶色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブはピンク色のボール、クレアは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にアリスとボブがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) ピンク色のボール\n(C) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) サム", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはパトリックと、クレアはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) イジー\n(B) パトリック\n(C) オフィーリア", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『オデュッセイア』を手に入れます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にボブとクレアが本を交換します。最後にボブとアリスが再び本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『オデュッセイア』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはディフェンダー、ボブはチアリーダー、クレアは左ウィングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にボブとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、ボブが担当しているのは\n選択肢:\n(A) ディフェンダー\n(B) チアリーダー\n(C) 左ウィング", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを1つずつ持っています：アリスはオレンジ色のボール、ボブは紫色のプレゼント、クレアは赤色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 紫色のプレゼント\n(C) 赤色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは白色のボール、クレアは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 白色のボール\n(C) 赤色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアは緑色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) 緑色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは黒色のボール、クレアはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にボブとアリスがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 黒色のボール\n(C) ピンク色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはカールと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) パトリック\n(B) カール\n(C) イジー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) ローラ", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはサムと、クレアはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ジェイミー\n(B) サム\n(C) イジー", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは白色のプレゼント、ボブは青色のプレゼント、クレアはピンク色のボールです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、クレアが持っているのは\n選択肢:\n(A) 白色のプレゼント\n(B) 青色のプレゼント\n(C) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黒色のボール、ボブは緑色のプレゼント、クレアは茶色のプレゼントです。\nイベントが進むにつれて、参加者たちはペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは赤色のプレゼント、ボブは青色のプレゼント、クレアは黄色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 青色のプレゼント\n(C) 黄色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各プレイヤーは異なる色のプレゼントを持っています：アリスはオレンジ色のボール、ボブは緑色のプレゼント、クレアは赤色のプレゼントです。\nイベントが進むにつれて、プレイヤーたちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 緑色のプレゼント\n(C) 赤色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは中央ミッドフィールダー、クレアはフォワードです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずアリスとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 中央ミッドフィールダー\n(C) フォワード", "target": "(B)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは紫色のボール、クレアは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にクレアとボブがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 紫色のボール\n(C) 青色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはカールと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) メリッサ\n(B) カール\n(C) パトリック", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『真珠』、クレアは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にクレアとアリスが本を交換します。最後にボブとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『真珠』\n(C) 『オデュッセイア』", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『キャッチ=22』、クレアは『白鯨』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとクレアが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『キャッチ=22』\n(C) 『白鯨』", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはオフィーリアと、クレアはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ヘルガ\n(B) オフィーリア\n(C) サム", "target": "(C)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはパトリックと、クレアはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ローラ\n(B) パトリック\n(C) メリッサ", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ミッドフィールダー、クレアはゴールキーパーです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。最後にボブとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ミッドフィールダー\n(C) ゴールキーパー", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ミッドフィールダー、ボブはゴールキーパー、クレアは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとアリスがポジションを交換します。次にボブとクレアがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) ゴールキーパー\n(C) 左ウィンガー", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きのため時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『オデュッセイア』、クレアは『ロリータ』を手に入れます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にアリスとクレアが本を交換します。最後にボブとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『オデュッセイア』\n(C) 『ロリータ』", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブはフルバック、クレアはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、アリスが担当しているのは\n選択肢:\n(A) ベンチウォーマー\n(B) フルバック\n(C) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレアの3人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは黒色のボール、クレアはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にボブとアリスがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 黒色のボール\n(C) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはロドリゴと、クレアはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にクレアとボブがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ローラ\n(B) ロドリゴ\n(C) パトリック", "target": "(A)"}
{"input": "アリス、ボブ、クレアは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『白鯨』、クレアは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にボブとクレアが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『白鯨』\n(C) 『指輪物語』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは茶色のプレゼント、クレアは青色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 茶色のプレゼント\n(C) 青色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレアは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『グレート・ギャツビー』を選びます。\n学期が進むにつれて、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとアリスが本を交換します。最後にボブとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『グレート・ギャツビー』", "target": "(A)"}
{"input": "アリス、ボブ、クレアはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンスが終わるとき、アリスのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) ローラ", "target": "(B)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブはチアリーダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にクレアとボブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) チアリーダー\n(C) フォワード", "target": "(A)"}
{"input": "アリス、ボブ、クレアはサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ウィンガー、ボブはチアリーダー、クレアはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にクレアとボブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) チアリーダー\n(C) フォワード", "target": "(B)"}
