{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーチームのメンバーです。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブは右ウィング、クレアは左ウィング、デイブはベンチウォーマー、イヴはゴールキーパー、フレッドはセンターミッドフィールダー、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてフレッドとボブがポジションを交換します。その後デイブとフレッドがポジションを交換し、さらにフレッドとボブが交換します。最後にボブとイヴがポジションを交換し、最終的にクレアとアリスが交換します。試合終了時、ガートルードが担当しているのは\n選択肢:\n(A) フォワード\n(B) 右ウィング\n(C) 左ウィング\n(D) ベンチウォーマー\n(E) ゴールキーパー\n(F) センターミッドフィールダー\n(G) チアリーダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黄色のボール、クレアは茶色のボール、デイブは白色のボール、イヴは黒色のボール、フレッドは赤色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にクレアとデイブがボールを交換します。続いてフレッドとガートルードがボールを交換します。その後イヴとクレアがボールを交換します。さらにイヴとフレッドがボールを交換します。次にアリスとデイブがボールを交換します。最後にイヴとクレアがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黄色のボール\n(C) 茶色のボール\n(D) 白色のボール\n(E) 黒色のボール\n(F) 赤色のボール\n(G) 紫色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはオフィーリアと、クレアはパトリックと、デイブはジェイミーと、イヴはローラと、フレッドはヘルガと、ガートルードはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとフレッドがパートナーを交代します。次にガートルードとイヴがパートナーを交代します。続いてガートルードとアリスがパートナーを交代します。その後ボブとアリスがパートナーを交代します。さらにデイブとフレッドがパートナーを交代します。次にイヴとアリスがパートナーを交代します。最後にイヴとクレアがパートナーを交代します。ダンス終了時、ガートルードは\n選択肢:\n(A) メリッサ\n(B) オフィーリア\n(C) パトリック\n(D) ジェイミー\n(E) ローラ\n(F) ヘルガ\n(G) イジー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはメリッサと、クレアはジェイミーと、デイブはサムと、イヴはパトリックと、フレッドはロドリゴと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてイヴとボブがパートナーを交代します。その後クレアとボブがパートナーを交代します。さらにフレッドとイヴがパートナーを交代します。最後にガートルードとデイブがパートナーを交代します。ダンスが終了する時点で、デイブは\n選択肢:\n(A) オフィーリア\n(B) メリッサ\n(C) ジェイミー\n(D) サム\n(E) パトリック\n(F) ロドリゴ\n(G) カール\nと踊っています。", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『真珠』、イヴは『バスカヴィル家の犬』、フレッドは『指輪物語』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとガートルードが本を交換します。次にクレアとボブが本を交換します。続いてアリスとデイブが本を交換します。その後フレッドとクレアが本を交換します。さらにデイブとフレッドが本を交換します。次にボブとクレアが本を交換します。最後にイヴとフレッドが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『真珠』\n(E) 『バスカヴィル家の犬』\n(F) 『指輪物語』\n(G) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはヘルガと、デイブはカールと、イヴはサムと、フレッドはイジーと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとイヴがパートナーを交代します。次にデイブとフレッドがパートナーを交代します。続いてイヴとクレアがパートナーを交代します。その後デイブとガートルードがパートナーを交代します。さらにデイブとボブがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にイヴとガートルードがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ローラ\n(B) メリッサ\n(C) ヘルガ\n(D) カール\n(E) サム\n(F) イジー\n(G) パトリック", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはパトリックと、クレアはカールと、デイブはロドリゴと、イヴはイジーと、フレッドはヘルガと、ガートルードはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にガートルードとアリスがパートナーを交代します。続いてボブとアリスがパートナーを交代します。その後イヴとガートルードがパートナーを交代します。さらにフレッドとクレアがパートナーを交代し、続いてフレッドとボブがパートナーを交代します。最後にデイブとフレッドがパートナーを交代します。ダンスが終了する時点で、フレッドのパートナーは\n選択肢:\n(A) オフィーリア\n(B) パトリック\n(C) カール\n(D) ロドリゴ\n(E) イジー\n(F) ヘルガ\n(G) ジェイミー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは緑色のボール、クレアはピンク色のボール、デイブは赤色のボール、イヴは青色のボール、フレッドは白色のボール、ガートルードは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にイヴとフレッドがボールを交換します。続いてイヴとデイブが再びボールを交換します。その後イヴとアリスがボールを交換します。続いてボブとアリスがボールを交換します。最後にガートルードとクレアがボールを交換します。最終的にゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 緑色のボール\n(C) ピンク色のボール\n(D) 赤色のボール\n(E) 青色のボール\n(F) 白色のボール\n(G) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは赤色のプレゼント、クレアは白色のプレゼント、デイブは青色のプレゼント、イヴは黄色のプレゼント、フレッドは黒色のボール、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてガートルードとクレアがプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。さらにアリスとイヴがプレゼントを交換します。次にガートルードとクレアがプレゼントを交換します。最後にフレッドとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 赤色のプレゼント\n(C) 白色のプレゼント\n(D) 青色のプレゼント\n(E) 黄色のプレゼント\n(F) 黒色のボール\n(G) 紫色のプレゼント", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはパトリックと、デイブはサムと、イヴはイジーと、フレッドはヘルガと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとガートルードがパートナーを交代します。次にクレアとフレッドがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後アリスとボブがパートナーを交代します。さらにガートルードとイヴがパートナーを交代します。次にデイブとガートルードがパートナーを交代します。最後にアリスとデイブがパートナーを交代します。ダンスが終了する時点で、デイブは\n選択肢:\n(A) メリッサ\n(B) ローラ\n(C) パトリック\n(D) サム\n(E) イジー\n(F) ヘルガ\n(G) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ミッドフィールダー、ボブはフルバック、クレアはセンターミッドフィールダー、デイブは左ミッドフィールダー、イヴはフォワード、フレッドはチアリーダー、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとボブがポジションを交換します。次にイヴとアリスがポジションを交換します。続いてガートルードとデイブがポジションを交換します。その後デイブとフレッドがポジションを交換します。さらにクレアとイヴがポジションを交換し、最後にフレッドとガートルードがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) フルバック\n(C) センターミッドフィールダー\n(D) 左ミッドフィールダー\n(E) フォワード\n(F) チアリーダー\n(G) ゴールキーパー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはカールと、クレアはメリッサと、デイブはイジーと、イヴはジェイミーと、フレッドはパトリックと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとクレアがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてデイブとイヴがパートナーを交代します。その後ガートルードとフレッドがパートナーを交代します。さらにアリスとボブがパートナーを交代します。そしてアリスとフレッドがパートナーを交代します。最後にフレッドとクレアがパートナーを交代します。ダンスが終了する時点で、アリスは\n選択肢:\n(A) ヘルガ\n(B) カール\n(C) メリッサ\n(D) イジー\n(E) ジェイミー\n(F) パトリック\n(G) ロドリゴ", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはゴールキーパー、クレアはセンターミッドフィールダー、デイブは右ミッドフィールダー、イヴはフルバック、フレッドは左ミッドフィールダー、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとイヴがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてイヴとクレアがポジションを交換します。その後フレッドとイヴがポジションを交換します。さらにクレアとガートルードがポジションを交換し、続いてクレアとデイブがポジションを交換します。最後にフレッドとボブがポジションを交換します。試合終了時、ガートルードが担当しているポジションは\n選択肢:\n(A) 左ウィング\n(B) ゴールキーパー\n(C) センターミッドフィールダー\n(D) 右ミッドフィールダー\n(E) フルバック\n(F) 左ミッドフィールダー\n(G) チアリーダー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブは右ミッドフィールダー、クレアはフォワード、デイブはサイドバック、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとボブがポジションを交代します。次にフレッドとクレアがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後イヴとデイブがポジションを交換します。さらにクレアとアリスがポジションを交換します。その後デイブとボブがポジションを交換します。最後にガートルードとアリスがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) 右ミッドフィールダー\n(C) フォワード\n(D) サイドバック\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) 右ウイング", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『指輪物語』、クレアは『ユリシーズ』、デイブは『オデュッセイア』、イヴは『フランケンシュタイン』、フレッドは『バスカヴィル家の犬』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にデイブとフレッドが本を交換します。続いてアリスとイヴが本を交換します。その後クレアとデイブが本を交換し、次にフレッドとクレアが交換します。さらにクレアとガートルードが本を交換し、最後にフレッドとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『指輪物語』\n(C) 『ユリシーズ』\n(D) 『オデュッセイア』\n(E) 『フランケンシュタイン』\n(F) 『バスカヴィル家の犬』\n(G) 『白鯨』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは赤色のボール、クレアは茶色のボール、デイブは紫色のボール、イヴは黒色のボール、フレッドはピンク色のボール、ガートルードは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとアリスがボールを交換します。次にクレアとガートルードがボールを交換します。続いてボブとデイブがボールを交換します。その後イヴとアリスがボールを交換します。さらにクレアとボブがボールを交換します。次にデイブとイヴがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 赤色のボール\n(C) 茶色のボール\n(D) 紫色のボール\n(E) 黒色のボール\n(F) ピンク色のボール\n(G) 緑色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアは紫色のボール、デイブはピンク色のボール、イヴは白色のボール、フレッドは赤色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとクレアがボールを交換します。その後ボブとフレッドがボールを交換します。さらにフレッドとデイブがボールを交換します。次にイヴとアリスがボールを交換します。最後にデイブとガートルードがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) 紫色のボール\n(D) ピンク色のボール\n(E) 白色のボール\n(F) 赤色のボール\n(G) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはロドリゴと、クレアはジェイミーと、デイブはローラと、イヴはヘルガと、フレッドはメリッサと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後アリスとガートルードがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にフレッドとイヴがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) サム\n(B) ロドリゴ\n(C) ジェイミー\n(D) ローラ\n(E) ヘルガ\n(F) メリッサ\n(G) オフィーリア\nと踊っています。", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブはオレンジ色のボール、クレアは白色のボール、デイブはピンク色のボール、イヴは青色のボール、フレッドは黄色のボール、ガートルードは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとガートルードがボールを交換します。次にフレッドとボブがボールを交換します。続いてフレッドとクレアがボールを交換します。その後イヴとフレッドがボールを交換します。さらにフレッドとクレアがボールを交換します。その後、アリスとボブがボールを交換します。最後にデイブとガートルードがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) オレンジ色のボール\n(C) 白色のボール\n(D) ピンク色のボール\n(E) 青色のボール\n(F) 黄色のボール\n(G) 黒色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはイジーと、クレアはジェイミーと、デイブはメリッサと、イヴはローラと、フレッドはパトリックと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとイヴがパートナーを交代します。次にイヴとボブがパートナーを交代します。続いてガートルードとデイブがパートナーを交代します。その後イヴとクレアがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にフレッドとクレアがパートナーを交代します。ダンス終了時、フレッドのパートナーは\n選択肢:\n(A) カール\n(B) イジー\n(C) ジェイミー\n(D) メリッサ\n(E) ローラ\n(F) パトリック\n(G) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブは左ウィング、クレアはゴールキーパー、デイブは右ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードはストライカーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとクレアがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後再びフレッドとクレアがポジションを交換します。さらにアリスとボブがポジションを交換し、続いてデイブとボブがポジションを交換します。最後にフレッドとイヴがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) チアリーダー\n(B) 左ウィング\n(C) ゴールキーパー\n(D) 右ミッドフィールダー\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) ストライカー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはゴールキーパー、ボブはセンターミッドフィールダー、クレアはベンチウォーマー、デイブは左ウィング、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてデイブとボブがポジションを交換します。その後フレッドとガートルードがポジションを交換します。さらにボブとクレアがポジションを交換します。次にデイブとアリスがポジションを交換します。最後にクレアとイヴがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) センターミッドフィールダー\n(C) ベンチウォーマー\n(D) 左ウィング\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) 左ミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはチアリーダー、クレアはフルバック、デイブは右ウィング、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてガートルードとアリスがポジションを交換します。その後ボブとクレアがポジションを交換し、続いてアリスとボブが交換します。さらにイヴとフレッドがポジションを交換し、最後にアリスとフレッドが交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) チアリーダー\n(C) フルバック\n(D) 右ウィング\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) センターミッドフィールダー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは緑色のボール、クレアは白色のボール、デイブは赤色のボール、イヴは茶色のボール、フレッドは紫色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとイヴがボールを交換します。続いてフレッドとボブがボールを交換します。その後デイブとガートルードがボールを交換します。さらにフレッドとボブがボールを交換します。最後にガートルードとフレッドがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 緑色のボール\n(C) 白色のボール\n(D) 赤色のボール\n(E) 茶色のボール\n(F) 紫色のボール\n(G) オレンジ色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは黒色のボール、ボブはオレンジ色のボール、クレアは白色のプレゼント、デイブは緑色のプレゼント、イヴは青色のプレゼント、フレッドは赤色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとイヴがプレゼントを交換します。次にアリスとフレッドがプレゼントを交換します。続いてガートルードとデイブがプレゼントを交換します。その後フレッドとイヴがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてクレアとデイブがプレゼントを交換します。最後にデイブとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 黒色のボール\n(B) オレンジ色のボール\n(C) 白色のプレゼント\n(D) 緑色のプレゼント\n(E) 青色のプレゼント\n(F) 赤色のプレゼント\n(G) 黄色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはロドリゴと、クレアはジェイミーと、デイブはイジーと、イヴはサムと、フレッドはカールと、ガートルードはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとフレッドがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後アリスとフレッドがパートナーを交代します。さらにクレアとアリスがパートナーを交代します。次にボブとイヴがパートナーを交代します。最後にイヴとガートルードがパートナーを交代します。ダンス終了時、イヴのパートナーは\n選択肢:\n(A) ローラ\n(B) ロドリゴ\n(C) ジェイミー\n(D) イジー\n(E) サム\n(F) カール\n(G) ヘルガ", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『キャッチ=22』、クレアは『指輪物語』、デイブは『ユリシーズ』、イヴは『フランケンシュタイン』、フレッドは『真珠』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずフレッドとアリスが本を交換します。次にガートルードとイヴが本を交換します。続いてアリスとイヴが本を交換します。その後デイブとガートルードが本を交換します。さらにガートルードとクレアが本を交換します。その後アリスとクレアが本を交換します。最後にデイブとボブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『キャッチ=22』\n(C) 『指輪物語』\n(D) 『ユリシーズ』\n(E) 『フランケンシュタイン』\n(F) 『真珠』\n(G) 『オデュッセイア』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはチアリーダー、クレアは右ミッドフィールダー、デイブはセンターミッドフィールダー、イヴはゴールキーパー、フレッドはストライカー、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にアリスとイヴがポジションを交換します。続いてクレアとガートルードがポジションを交換します。その後フレッドとアリスがポジションを交換し、続いてボブとクレアが交換します。さらにデイブとイヴが交換し、最後にボブとアリスがポジションを交換します。試合終了時、フレッドがプレーしているのは\n選択肢:\n(A) 左ミッドフィールダー\n(B) チアリーダー\n(C) 右ミッドフィールダー\n(D) センターミッドフィールダー\n(E) ゴールキーパー\n(F) ストライカー\n(G) ベンチウォーマー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはヘルガと、クレアはサムと、デイブはメリッサと、イヴはジェイミーと、フレッドはロドリゴと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にガートルードとクレアがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにフレッドとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にイヴとクレアがパートナーを交代します。ダンスが終わる時点で、ガートルードは\n選択肢:\n(A) ローラ\n(B) ヘルガ\n(C) サム\n(D) メリッサ\n(E) ジェイミー\n(F) ロドリゴ\n(G) パトリック\nと踊っています。", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはジェイミーと、クレアはオフィーリアと、デイブはロドリゴと、イヴはパトリックと、フレッドはサムと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にフレッドとガートルードがパートナーを交代します。続いてイヴとボブがパートナーを交代します。さらにイヴとアリスがパートナーを交代します。その後デイブとボブがパートナーを交代し、続いてデイブとイヴがパートナーを交代します。最後にアリスとデイブがパートナーを交代します。ダンスが終了する時点で、ボブは\n選択肢:\n(A) イジー\n(B) ジェイミー\n(C) オフィーリア\n(D) ロドリゴ\n(E) パトリック\n(F) サム\n(G) ローラ\nと踊っています。", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『オデュッセイア』、イヴは『グレート・ギャツビー』、フレッドは『ロリータ』、ガートルードは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとアリスが本を交換します。続いてアリスとデイブが本を交換します。その後ガートルードとデイブが本を交換します。さらにアリスとボブが本を交換します。次にイヴとクレアが本を交換します。最後にアリスとフレッドが本を交換します。学期終了時、ガートルードが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『オデュッセイア』\n(E) 『グレート・ギャツビー』\n(F) 『ロリータ』\n(G) 『真珠』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはローラと、クレアはイジーと、デイブはロドリゴと、イヴはヘルガと、フレッドはサムと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてフレッドとガートルードがパートナーを交代します。その後、ガートルードとアリスがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。最後にアリスとデイブがパートナーを交代します。ダンスが終了する時点で、イヴは\n選択肢:\n(A) パトリック\n(B) ローラ\n(C) イジー\n(D) ロドリゴ\n(E) ヘルガ\n(F) サム\n(G) メリッサ\nと踊っています。", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブはフォワード、クレアは右ウイング、デイブはセンターミッドフィールダー、イヴはチアリーダー、フレッドは左ウイング、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとアリスがポジションを交換します。次にアリスとフレッドがポジションを交換します。続いてアリスとガートルードがポジションを交換します。その後ボブとイヴがポジションを交換し、続いてアリスとボブが交換します。さらにイヴとクレアが交換し、最後にアリスとデイブが交換します。試合終了時、ガートルードが担当しているのは\n選択肢:\n(A) ベンチウォーマー\n(B) フォワード\n(C) 右ウイング\n(D) センターミッドフィールダー\n(E) チアリーダー\n(F) 左ウイング\n(G) ゴールキーパー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは白色のボール、ボブは茶色のボール、クレアは青色のボール、デイブはピンク色のボール、イヴは紫色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとデイブがボールを交換します。次にガートルードとクレアがボールを交換します。続いてデイブとボブがボールを交換します。その後クレアとガートルードがボールを交換します。さらにアリスとフレッドがボールを交換します。次にボブとアリスがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 白色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) ピンク色のボール\n(E) 紫色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブはフルバック、クレアはセンターミッドフィールダー、デイブは左ミッドフィールダー、イヴはフォワード、フレッドはチアリーダー、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとボブがポジションを交換します。次にイヴとアリスがポジションを交換します。続いてガートルードとデイブがポジションを交換します。その後デイブとフレッドがポジションを交換します。さらにクレアとイヴがポジションを交換し、最後にフレッドとガートルードがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) フルバック\n(C) センターミッドフィールダー\n(D) 左ミッドフィールダー\n(E) フォワード\n(F) チアリーダー\n(G) ゴールキーパー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはヘルガと、クレアはオフィーリアと、デイブはローラと、イヴはメリッサと、フレッドはパトリックと、ガートルードはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとデイブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。続いてフレッドとデイブがパートナーを交代します。その後イヴとフレッドがパートナーを交代します。さらにクレアとフレッドがパートナーを交代します。次にアリスとイヴがパートナーを交代します。最後にガートルードとボブがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) サム\n(B) ヘルガ\n(C) オフィーリア\n(D) ローラ\n(E) メリッサ\n(F) パトリック\n(G) ジェイミー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブはフォワード、クレアは左ウィング、デイブはチアリーダー、イヴはフルバック、フレッドは右ウィング、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交代します。次にガートルードとボブがポジションを交代します。続いてイヴとアリスがポジションを交代します。その後クレアとフレッドがポジションを交代します。さらにガートルードとデイブがポジションを交代します。その後イヴとフレッドがポジションを交代します。最後にフレッドとボブがポジションを交代します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) フォワード\n(C) 左ウィング\n(D) チアリーダー\n(E) フルバック\n(F) 右ウィング\n(G) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは白色のボール、クレアは茶色のボール、デイブは青色のボール、イヴは黄色のボール、フレッドは黒色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとガートルードがボールを交換します。次にガートルードとボブがボールを交換します。続いてフレッドとクレアがボールを交換します。その後クレアとデイブがボールを交換します。さらにクレアとイヴがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとイヴがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 白色のボール\n(C) 茶色のボール\n(D) 青色のボール\n(E) 黄色のボール\n(F) 黒色のボール\n(G) 紫色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはパトリックと、デイブはサムと、イヴはイジーと、フレッドはヘルガと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとガートルードがパートナーを交代します。次にクレアとフレッドがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後アリスとボブがパートナーを交代します。さらにガートルードとイヴがパートナーを交代します。次にデイブとガートルードがパートナーを交代します。最後にアリスとデイブがパートナーを交代します。ダンスが終了する時点で、イヴは\n選択肢:\n(A) メリッサと\n(B) ローラと\n(C) パトリックと\n(D) サムと\n(E) イジーと\n(F) ヘルガと\n(G) ロドリゴと\n踊っています。", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはオフィーリアと、クレアはローラと、デイブはパトリックと、イヴはロドリゴと、フレッドはメリッサと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとデイブがパートナーを交代します。次にフレッドとイヴがパートナーを交代します。続いてアリスとガートルードがパートナーを交代します。その後デイブとボブがパートナーを交代します。さらにアリスとクレアがパートナーを交代します。そしてアリスとガートルードが再びパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終了する時点で、ガートルードは\n選択肢:\n(A) ジェイミー\n(B) オフィーリア\n(C) ローラ\n(D) パトリック\n(E) ロドリゴ\n(F) メリッサ\n(G) カール\nと踊っています。", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはメリッサと、クレアはジェイミーと、デイブはロドリゴと、イヴはサムと、フレッドはカールと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にクレアとガートルードがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後フレッドとイヴがパートナーを交代します。さらにデイブとフレッドがパートナーを交代します。次にクレアとフレッドがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンス終了時、アリスは\n選択肢:\n(A) イジー\n(B) メリッサ\n(C) ジェイミー\n(D) ロドリゴ\n(E) サム\n(F) カール\n(G) ローラ", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは紫色のプレゼント、クレアは白色のプレゼント、デイブは茶色のプレゼント、イヴは緑色のプレゼント、フレッドは青色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。続いてガートルードとアリスがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にフレッドとアリスがプレゼントを交換します。最後にフレッドとイヴがプレゼントを交換します。イベント終了時、ガートルードが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 紫色のプレゼント\n(C) 白色のプレゼント\n(D) 茶色のプレゼント\n(E) 緑色のプレゼント\n(F) 青色のプレゼント\n(G) 黄色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは赤色のプレゼント、クレアは青色のプレゼント、デイブは茶色のプレゼント、イヴは黄色のプレゼント、フレッドは白色のプレゼント、ガートルードは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。続いてアリスとガートルードがプレゼントを交換します。その後クレアとガートルードがプレゼントを交換します。さらにアリスとイヴがプレゼントを交換します。次にフレッドとデイブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 赤色のプレゼント\n(C) 青色のプレゼント\n(D) 茶色のプレゼント\n(E) 黄色のプレゼント\n(F) 白色のプレゼント\n(G) 黒色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは黄色のボール、クレアはピンク色のボール、デイブは黒色のボール、イヴは白色のボール、フレッドは茶色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとガートルードがボールを交換します。次にイヴとアリスがボールを交換します。続いてガートルードとクレアがボールを交換します。その後アリスとデイブがボールを交換します。さらにフレッドとデイブがボールを交換します。次にクレアとデイブがボールを交換します。最後にボブとイヴがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 黄色のボール\n(C) ピンク色のボール\n(D) 黒色のボール\n(E) 白色のボール\n(F) 茶色のボール\n(G) オレンジ色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは緑色のボール、クレアは茶色のボール、デイブはピンク色のボール、イヴはオレンジ色のボール、フレッドは黒色のボール、ガートルードは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとアリスがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとクレアがボールを交換します。その後クレアとイヴが再びボールを交換します。さらにイヴとフレッドがボールを交換します。次にボブとフレッドがボールを交換します。最後にデイブとイヴがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 緑色のボール\n(C) 茶色のボール\n(D) ピンク色のボール\n(E) オレンジ色のボール\n(F) 黒色のボール\n(G) 白色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはイジーと、デイブはロドリゴと、イヴはカールと、フレッドはローラと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとボブがパートナーを交代します。次にクレアとボブがパートナーを交代します。続いてイヴとボブがパートナーを交代します。その後ガートルードとボブがパートナーを交代します。さらにクレアとデイブがパートナーを交代します。そしてアリスとガートルードがパートナーを交代します。最後にボブとフレッドがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) メリッサ\n(B) サム\n(C) イジー\n(D) ロドリゴ\n(E) カール\n(F) ローラ\n(G) パトリック\nと踊っています。", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアは紫色のボール、デイブはピンク色のボール、イヴは白色のボール、フレッドは赤色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとクレアがボールを交換します。その後ボブとフレッドがボールを交換します。さらにフレッドとデイブがボールを交換します。次にイヴとアリスがボールを交換します。最後にデイブとガートルードがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) 紫色のボール\n(D) ピンク色のボール\n(E) 白色のボール\n(F) 赤色のボール\n(G) オレンジ色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『白鯨』、ボブは『ロリータ』、クレアは『ユリシーズ』、デイブは『指輪物語』、イヴは『バスカヴィル家の犬』、フレッドは『キャッチ=22』、ガートルードは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずフレッドとイヴが本を交換します。次にガートルードとアリスが本を交換します。続いてデイブとクレアが本を交換します。その後アリスとボブが本を交換し、さらにアリスとフレッドが本を交換します。その後イヴとデイブが本を交換し、最後にイヴとアリスが本を交換します。学期終了時、ガートルードが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『ロリータ』\n(C) 『ユリシーズ』\n(D) 『指輪物語』\n(E) 『バスカヴィル家の犬』\n(F) 『キャッチ=22』\n(G) 『フランケンシュタイン』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブは右ウィング、クレアは左ウィング、デイブはベンチウォーマー、イヴはゴールキーパー、フレッドはセンターミッドフィールダー、ガートルードはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてフレッドとボブがポジションを交換します。その後デイブとフレッドがポジションを交換し、さらにフレッドとボブが交換します。最後にボブとイヴがポジションを交換し、最終的にクレアとアリスが交換します。試合終了時、デイブがプレーしているのは\n選択肢:\n(A) フォワード\n(B) 右ウィング\n(C) 左ウィング\n(D) ベンチウォーマー\n(E) ゴールキーパー\n(F) センターミッドフィールダー\n(G) チアリーダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは白色のプレゼント、ボブはオレンジ色のボール、クレアは黒色のボール、デイブは黄色のプレゼント、イヴは緑色のプレゼント、フレッドは紫色のプレゼント、ガートルードはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとアリスがプレゼントを交換します。次にイヴとクレアがプレゼントを交換します。続いてデイブとボブがプレゼントを交換します。その後ガートルードとアリスがプレゼントを交換します。さらにイヴとボブがプレゼントを交換します。次にイヴとガートルードがプレゼントを交換します。最後にデイブとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) 黄色のプレゼント\n(E) 緑色のプレゼント\n(F) 紫色のプレゼント\n(G) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはロドリゴと、クレアはイジーと、デイブはメリッサと、イヴはローラと、フレッドはパトリックと、ガートルードはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にガートルードとフレッドがパートナーを交代します。続いてデイブとクレアがパートナーを交代します。その後ガートルードとアリスがパートナーを交代します。再びデイブとイヴがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にボブとガートルードがパートナーを交代します。ダンスが終わる時点で、イヴは\n選択肢:\n(A) オフィーリアと踊っている\n(B) ロドリゴと踊っている\n(C) イジーと踊っている\n(D) メリッサと踊っている\n(E) ローラと踊っている\n(F) パトリックと踊っている\n(G) ジェイミーと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスはオレンジ色のボール、ボブは茶色のプレゼント、クレアはピンク色のボール、デイブは青色のプレゼント、イヴは緑色のプレゼント、フレッドは黄色のプレゼント、ガートルードは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとガートルードがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。さらにフレッドとアリスがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。最後にボブとガートルードがプレゼントを交換します。イベント終了時、ガートルードが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 茶色のプレゼント\n(C) ピンク色のボール\n(D) 青色のプレゼント\n(E) 緑色のプレゼント\n(F) 黄色のプレゼント\n(G) 白色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブはオレンジ色のボール、クレアは茶色のプレゼント、デイブはピンク色のボール、イヴは黒色のボール、フレッドは緑色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。続いてアリスとガートルードがプレゼントを交換します。その後デイブとボブがプレゼントを交換します。さらにデイブとアリスがプレゼントを交換します。次にボブとガートルードがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) オレンジ色のボール\n(C) 茶色のプレゼント\n(D) ピンク色のボール\n(E) 黒色のボール\n(F) 緑色のプレゼント\n(G) 紫色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブはオレンジ色のボール、クレアは白色のボール、デイブはピンク色のボール、イヴは青色のボール、フレッドは黄色のボール、ガートルードは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとガートルードがボールを交換します。次にフレッドとボブがボールを交換します。続いてフレッドとクレアがボールを交換します。その後イヴとフレッドがボールを交換します。さらにフレッドとクレアがボールを交換します。その後、アリスとボブがボールを交換します。最後にデイブとガートルードがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) オレンジ色のボール\n(C) 白色のボール\n(D) ピンク色のボール\n(E) 青色のボール\n(F) 黄色のボール\n(G) 黒色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『グレート・ギャツビー』、クレアは『ロリータ』、デイブは『真珠』、イヴは『指輪物語』、フレッドは『フランケンシュタイン』、ガートルードは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にアリスとデイブが本を交換します。続いてガートルードとフレッドが本を交換します。その後ボブとアリスが本を交換し、次にアリスとイヴが本を交換します。さらにデイブとガートルードが本を交換し、最後にデイブとイヴが本を交換します。学期終了時、ガートルードが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『グレート・ギャツビー』\n(C) 『ロリータ』\n(D) 『真珠』\n(E) 『指輪物語』\n(F) 『フランケンシュタイン』\n(G) 『バスカヴィル家の犬』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブはゴールキーパー、クレアは左ウィング、デイブはベンチウォーマー、イヴはセンターミッドフィールダー、フレッドはサイドバック、ガートルードはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとフレッドがポジションを交代します。次にクレアとガートルードがポジションを交代します。続いてデイブとアリスがポジションを交代します。その後ボブとデイブがポジションを交代します。さらにボブとイヴがポジションを交代します。次にイヴとアリスがポジションを交代します。最後にガートルードとデイブがポジションを交代します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ゴールキーパー\n(C) 左ウィング\n(D) ベンチウォーマー\n(E) センターミッドフィールダー\n(F) サイドバック\n(G) チアリーダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブはオレンジ色のボール、クレアは白色のプレゼント、デイブは緑色のプレゼント、イヴは黄色のプレゼント、フレッドは茶色のプレゼント、ガートルードは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。続いてアリスとボブがプレゼントを交換します。その後アリスとガートルードがプレゼントを交換します。さらにクレアとボブがプレゼントを交換します。その後デイブとフレッドがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) オレンジ色のボール\n(C) 白色のプレゼント\n(D) 緑色のプレゼント\n(E) 黄色のプレゼント\n(F) 茶色のプレゼント\n(G) 赤色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは白色のプレゼント、クレアはオレンジ色のボール、デイブは青色のプレゼント、イヴは赤色のプレゼント、フレッドは黒色のボール、ガートルードはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとデイブがプレゼントを交換します。次にフレッドとガートルードがプレゼントを交換します。続いてフレッドとイヴがプレゼントを交換します。その後クレアとイヴがプレゼントを交換します。さらにクレアとフレッドがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 白色のプレゼント\n(C) オレンジ色のボール\n(D) 青色のプレゼント\n(E) 赤色のプレゼント\n(F) 黒色のボール\n(G) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは茶色のプレゼント、クレアはオレンジ色のボール、デイブは赤色のプレゼント、イヴは黒色のボール、フレッドは紫色のプレゼント、ガートルードは緑色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとガートルードがプレゼントを交換します。次にフレッドとガートルードがプレゼントを交換します。続いてガートルードとイヴがプレゼントを交換します。その後デイブとイヴがプレゼントを交換します。さらにデイブとアリスがプレゼントを交換します。その後イヴとアリスがプレゼントを交換します。最後にボブとデイブがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 茶色のプレゼント\n(C) オレンジ色のボール\n(D) 赤色のプレゼント\n(E) 黒色のボール\n(F) 紫色のプレゼント\n(G) 緑色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『白鯨』、ボブは『バスカヴィル家の犬』、クレアは『グレート・ギャツビー』、デイブは『オデュッセイア』、イヴは『ユリシーズ』、フレッドは『ロリータ』、ガートルードは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとフレッドが本を交換します。次にイヴとフレッドが本を交換します。続いてフレッドとボブが本を交換します。その後イヴとガートルードが本を交換します。さらにガートルードとクレアが本を交換します。次にクレアとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『バスカヴィル家の犬』\n(C) 『グレート・ギャツビー』\n(D) 『オデュッセイア』\n(E) 『ユリシーズ』\n(F) 『ロリータ』\n(G) 『真珠』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人が白象ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黄色のプレゼント、クレアは赤色のプレゼント、デイブは黒色のボール、イヴは白色のプレゼント、フレッドは茶色のプレゼント、ガートルードはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとフレッドがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてデイブとフレッドがプレゼントを交換します。その後イヴとアリスがプレゼントを交換します。さらにボブとアリスがプレゼントを交換します。次にイヴとガートルードがプレゼントを交換します。最後にフレッドとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黄色のプレゼント\n(C) 赤色のプレゼント\n(D) 黒色のボール\n(E) 白色のプレゼント\n(F) 茶色のプレゼント\n(G) オレンジ色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは右ウイング、クレアは右ミッドフィールダー、デイブはベンチウォーマー、イヴはチアリーダー、フレッドはゴールキーパー、ガートルードは左ウイングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとボブがポジションを交換します。次にボブとクレアがポジションを交換します。続いてアリスとイヴがポジションを交換します。その後デイブとクレアがポジションを交換します。さらにフレッドとアリスがポジションを交換します。その後ボブとフレッドがポジションを交換します。最後にアリスとガートルードがポジションを交換します。試合終了時、ガートルードが担当しているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ウイング\n(C) 右ミッドフィールダー\n(D) ベンチウォーマー\n(E) チアリーダー\n(F) ゴールキーパー\n(G) 左ウイング", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはロドリゴと、クレアはカールと、デイブはオフィーリアと、イヴはローラと、フレッドはジェイミーと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとイヴがパートナーを交代します。次にガートルードとクレアがパートナーを交代します。続いてフレッドとクレアがパートナーを交代します。その後デイブとアリスがパートナーを交代します。さらにデイブとフレッドがパートナーを交代します。そしてアリスとボブがパートナーを交代します。最後にフレッドとボブがパートナーを交代します。ダンスが終了する時点で、ガートルードは\n選択肢:\n(A) メリッサと踊っている\n(B) ロドリゴと踊っている\n(C) カールと踊っている\n(D) オフィーリアと踊っている\n(E) ローラと踊っている\n(F) ジェイミーと踊っている\n(G) パトリックと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブはピンク色のボール、クレアは茶色のボール、デイブは緑色のボール、イヴは黄色のボール、フレッドは赤色のボール、ガートルードは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとガートルードがボールを交換します。次にデイブとボブがボールを交換します。続いてイヴとガートルードがボールを交換します。その後ボブとアリスがボールを交換します。さらにイヴとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。最後にガートルードとフレッドがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) ピンク色のボール\n(C) 茶色のボール\n(D) 緑色のボール\n(E) 黄色のボール\n(F) 赤色のボール\n(G) 青色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアは紫色のボール、デイブはピンク色のボール、イヴは白色のボール、フレッドは赤色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとクレアがボールを交換します。その後ボブとフレッドがボールを交換します。さらにフレッドとデイブがボールを交換します。次にイヴとアリスがボールを交換します。最後にデイブとガートルードがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) 紫色のボール\n(D) ピンク色のボール\n(E) 白色のボール\n(F) 赤色のボール\n(G) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは青色のボール、クレアは赤色のボール、デイブは紫色のボール、イヴはピンク色のボール、フレッドは茶色のボール、ガートルードは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとガートルードがボールを交換します。次にフレッドとアリスがボールを交換します。続いてアリスとクレアがボールを交換します。その後ボブとデイブがボールを交換します。さらにフレッドとイヴがボールを交換します。次にガートルードとフレッドがボールを交換します。最後にガートルードとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 青色のボール\n(C) 赤色のボール\n(D) 紫色のボール\n(E) ピンク色のボール\n(F) 茶色のボール\n(G) 白色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスはオレンジ色のボール、ボブは茶色のプレゼント、クレアはピンク色のボール、デイブは青色のプレゼント、イヴは緑色のプレゼント、フレッドは黄色のプレゼント、ガートルードは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとガートルードがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。さらにフレッドとアリスがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。最後にボブとガートルードがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 茶色のプレゼント\n(C) ピンク色のボール\n(D) 青色のプレゼント\n(E) 緑色のプレゼント\n(F) 黄色のプレゼント\n(G) 白色のプレゼント", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはヘルガと、クレアはサムと、デイブはロドリゴと、イヴはメリッサと、フレッドはイジーと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずガートルードとフレッドがパートナーを交代します。次にガートルードとボブがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後イヴとデイブがパートナーを交代します。さらにボブとガートルードがパートナーを交代します。次にアリスとクレアがパートナーを交代します。最後にデイブとフレッドがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) カール\n(B) ヘルガ\n(C) サム\n(D) ロドリゴ\n(E) メリッサ\n(F) イジー\n(G) オフィーリア", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはジェイミーと、デイブはイジーと、イヴはローラと、フレッドはロドリゴと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずガートルードとアリスがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてボブとクレアがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにクレアとフレッドがパートナーを交代します。次にフレッドとアリスがパートナーを交代します。最後にガートルードとデイブがパートナーを交代します。ダンス終了時、ボブは\n選択肢:\n(A) メリッサと踊っている\n(B) サムと踊っている\n(C) ジェイミーと踊っている\n(D) イジーと踊っている\n(E) ローラと踊っている\n(F) ロドリゴと踊っている\n(G) オフィーリアと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはオフィーリアと、クレアはサムと、デイブはヘルガと、イヴはパトリックと、フレッドはジェイミーと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとボブがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてフレッドとイヴがパートナーを交代します。その後クレアとフレッドがパートナーを交代します。さらにガートルードとアリスがパートナーを交代します。そしてアリスとボブがパートナーを交代します。最後にデイブとフレッドがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) ローラ\n(B) オフィーリア\n(C) サム\n(D) ヘルガ\n(E) パトリック\n(F) ジェイミー\n(G) ロドリゴ", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはイジーと、クレアはオフィーリアと、デイブはメリッサと、イヴはパトリックと、フレッドはロドリゴと、ガートルードはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にイヴとガートルードがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後イヴとデイブがパートナーを交代します。さらにボブとアリスがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にボブとイヴがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ヘルガ\n(B) イジー\n(C) オフィーリア\n(D) メリッサ\n(E) パトリック\n(F) ロドリゴ\n(G) サム", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはベンチウォーマー、クレアは右ミッドフィールダー、デイブはチアリーダー、イヴは左ウィング、フレッドはゴールキーパー、ガートルードは右ウィングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとクレアがポジションを交換します。次にフレッドとデイブがポジションを交換します。続いてアリスとボブがポジションを交換します。その後ガートルードとイヴがポジションを交換します。さらにデイブとボブがポジションを交換し、続いてデイブとイヴが交換します。最後にデイブとアリスがポジションを交換します。試合終了時、ガートルードが担当しているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) ベンチウォーマー\n(C) 右ミッドフィールダー\n(D) チアリーダー\n(E) 左ウィング\n(F) ゴールキーパー\n(G) 右ウィング", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブは中央ミッドフィールダー、クレアはベンチウォーマー、デイブはチアリーダー、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとガートルードがポジションを交換します。次にデイブとフレッドがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後アリスとガートルードがポジションを交換します。さらにボブとイヴがポジションを交換します。次にデイブとアリスがポジションを交換します。最後にクレアとデイブがポジションを交換します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) 中央ミッドフィールダー\n(C) ベンチウォーマー\n(D) チアリーダー\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) 右ウイング", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『オデュッセイア』、クレアは『バスカヴィル家の犬』、デイブは『白鯨』、イヴは『フランケンシュタイン』、フレッドは『真珠』、ガートルードは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとガートルードが本を交換します。次にデイブとフレッドが本を交換します。続いてアリスとクレアが本を交換します。その後クレアとボブが本を交換します。さらにイヴとクレアが本を交換します。次にフレッドとアリスが本を交換します。最後にクレアとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『オデュッセイア』\n(C) 『バスカヴィル家の犬』\n(D) 『白鯨』\n(E) 『フランケンシュタイン』\n(F) 『真珠』\n(G) 『ロリータ』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはイジーと、クレアはメリッサと、デイブはローラと、イヴはロドリゴと、フレッドはヘルガと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にイヴとガートルードがパートナーを交代します。続いてクレアとガートルードがパートナーを交代します。その後ガートルードとボブがパートナーを交代します。さらにクレアとボブがパートナーを交代します。次にフレッドとガートルードがパートナーを交代します。最後にクレアとデイブがパートナーを交代します。ダンスが終了する時点で、ボブは\n選択肢:\n(A) カールと踊っています\n(B) イジーと踊っています\n(C) メリッサと踊っています\n(D) ローラと踊っています\n(E) ロドリゴと踊っています\n(F) ヘルガと踊っています\n(G) パトリックと踊っています", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアはオレンジ色のボール、デイブは赤色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にガートルードとイヴがボールを交換します。続いてボブとフレッドがボールを交換します。その後クレアとフレッドがボールを交換します。さらにアリスとクレアがボールを交換します。次にイヴとフレッドがボールを交換します。最後にイヴとデイブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール\n(D) 赤色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはロドリゴと、クレアはローラと、デイブはイジーと、イヴはサムと、フレッドはカールと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとフレッドがパートナーを交代します。次にクレアとアリスがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後ガートルードとアリスがパートナーを交代します。さらにクレアとボブがパートナーを交代します。次にデイブとフレッドがパートナーを交代します。最後にイヴとアリスがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) パトリック\n(B) ロドリゴ\n(C) ローラ\n(D) イジー\n(E) サム\n(F) カール\n(G) メリッサ", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブはオレンジ色のボール、クレアは黒色のボール、デイブは青色のプレゼント、イヴは赤色のプレゼント、フレッドは茶色のプレゼント、ガートルードはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にボブとガートルードがプレゼントを交換します。続いてアリスとクレアがプレゼントを交換します。その後デイブとフレッドがプレゼントを交換します。さらにアリスとフレッドがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。最後にアリスとイヴがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) 青色のプレゼント\n(E) 赤色のプレゼント\n(F) 茶色のプレゼント\n(G) ピンク色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはチアリーダー、クレアはフルバック、デイブは右ウィング、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてガートルードとアリスがポジションを交換します。その後ボブとクレアがポジションを交換し、続いてアリスとボブが交換します。さらにイヴとフレッドがポジションを交換し、最後にアリスとフレッドが交換します。試合終了時、フレッドがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) チアリーダー\n(C) フルバック\n(D) 右ウィング\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) センターミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは茶色のボール、クレアは青色のボール、デイブはピンク色のボール、イヴは黄色のボール、フレッドは白色のボール、ガートルードは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとイヴがボールを交換します。次にデイブとフレッドがボールを交換します。続いてアリスとガートルードがボールを交換します。その後フレッドとクレアがボールを交換します。さらにボブとフレッドがボールを交換します。次にガートルードとボブがボールを交換します。最後にガートルードとクレアがボールを交換します。ゲーム終了時、フレッドが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) ピンク色のボール\n(E) 黄色のボール\n(F) 白色のボール\n(G) 黒色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは青色のボール、クレアは黄色のボール、デイブは茶色のボール、イヴは黒色のボール、フレッドは白色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。続いてイヴとボブがボールを交換します。その後ガートルードとクレアがボールを交換します。さらにアリスとガートルードがボールを交換します。次にボブとクレアがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 青色のボール\n(C) 黄色のボール\n(D) 茶色のボール\n(E) 黒色のボール\n(F) 白色のボール\n(G) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブは右ミッドフィールダー、クレアはチアリーダー、デイブはストライカー、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にガートルードとデイブがポジションを交換します。続いてボブとクレアがポジションを交換します。その後フレッドとデイブがポジションを交換します。さらにガートルードとフレッドがポジションを交換します。そしてフレッドとクレアが再びポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) 右ミッドフィールダー\n(C) チアリーダー\n(D) ストライカー\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) 左ミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはディフェンダー、ボブはベンチウォーマー、クレアはチアリーダー、デイブは左ミッドフィールダー、イヴは右ウイング、フレッドは左ウイング、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にガートルードとボブがポジションを交換します。続いてボブとデイブがポジションを交換します。その後ガートルードとデイブがポジションを交換します。さらにボブとクレアがポジションを交換します。その後フレッドとボブがポジションを交換します。最後にアリスとイヴがポジションを交換します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) ディフェンダー\n(B) ベンチウォーマー\n(C) チアリーダー\n(D) 左ミッドフィールダー\n(E) 右ウイング\n(F) 左ウイング\n(G) ゴールキーパー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはメリッサと、クレアはジェイミーと、デイブはサムと、イヴはパトリックと、フレッドはロドリゴと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてイヴとボブがパートナーを交代します。その後クレアとボブがパートナーを交代します。さらにフレッドとイヴがパートナーを交代します。最後にガートルードとデイブがパートナーを交代します。ダンスが終了する時点で、フレッドのパートナーは\n選択肢:\n(A) オフィーリア\n(B) メリッサ\n(C) ジェイミー\n(D) サム\n(E) パトリック\n(F) ロドリゴ\n(G) カール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはローラと、クレアはイジーと、デイブはロドリゴと、イヴはヘルガと、フレッドはサムと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてフレッドとガートルードがパートナーを交代します。その後ガートルードとアリスがパートナーを交代します。さらにアリスとデイブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとデイブが再びパートナーを交代します。ダンスが終了した時点で、ガートルードは\n選択肢:\n(A) パトリック\n(B) ローラ\n(C) イジー\n(D) ロドリゴ\n(E) ヘルガ\n(F) サム\n(G) メリッサ\nと踊っています。", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは赤色のボール、フレッドは緑色のボール、ガートルードは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとイヴがボールを交換します。次にデイブとフレッドがボールを交換します。続いてクレアとフレッドがボールを交換します。その後イヴとボブがボールを交換します。さらにクレアとアリスがボールを交換します。次にガートルードとイヴが再びボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 赤色のボール\n(F) 緑色のボール\n(G) 茶色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『ロリータ』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『オデュッセイア』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずフレッドとアリスが本を交換します。次にフレッドとイヴが本を交換します。続いてフレッドとデイブが本を交換します。その後クレアとフレッドが本を交換します。さらにガートルードとデイブが本を交換します。次にフレッドとアリスが再び本を交換します。最後にフレッドとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『ロリータ』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『オデュッセイア』\n(G) 『白鯨』", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブはピンク色のボール、クレアは茶色のボール、デイブは黄色のボール、イヴは黒色のボール、フレッドは赤色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとデイブがボールを交換します。次にイヴとアリスがボールを交換します。続いてガートルードとイヴがボールを交換します。その後クレアとアリスがボールを交換します。次にデイブとイヴがボールを交換します。さらにアリスとガートルードがボールを交換します。最後にフレッドとボブがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) ピンク色のボール\n(C) 茶色のボール\n(D) 黄色のボール\n(E) 黒色のボール\n(F) 赤色のボール\n(G) 紫色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはジェイミーと、クレアはオフィーリアと、デイブはロドリゴと、イヴはパトリックと、フレッドはサムと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にフレッドとガートルードがパートナーを交代します。続いてイヴとボブがパートナーを交代します。さらにイヴとアリスがパートナーを交代します。その後デイブとボブがパートナーを交代し、続いてデイブとイヴがパートナーを交代します。最後にアリスとデイブがパートナーを交代します。ダンスが終了する時点で、ガートルードは\n選択肢:\n(A) イジー\n(B) ジェイミー\n(C) オフィーリア\n(D) ロドリゴ\n(E) パトリック\n(F) サム\n(G) ローラ", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはオフィーリアと、クレアはローラと、デイブはロドリゴと、イヴはジェイミーと、フレッドはサムと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとフレッドがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後クレアとイヴがパートナーを交代します。さらにデイブとクレアがパートナーを交代します。最後にガートルードとイヴがパートナーを交代し、ボブとイヴがパートナーを交代します。ダンスが終了する時点で、イヴのパートナーは\n選択肢:\n(A) パトリック\n(B) オフィーリア\n(C) ローラ\n(D) ロドリゴ\n(E) ジェイミー\n(F) サム\n(G) カール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『真珠』、ボブは『指輪物語』、クレアは『キャッチ=22』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『ユリシーズ』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとボブが本を交換します。次にアリスとフレッドが本を交換します。続いてガートルードとクレアが本を交換します。その後フレッドとイヴが本を交換します。さらにクレアとデイブが本を交換します。次にイヴとボブが本を交換します。最後にフレッドとガートルードが本を交換します。学期終了時、フレッドが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『指輪物語』\n(C) 『キャッチ=22』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『ユリシーズ』\n(G) 『オデュッセイア』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『真珠』、ボブは『グレート・ギャツビー』、クレアは『ロリータ』、デイブは『ユリシーズ』、イヴは『フランケンシュタイン』、フレッドは『白鯨』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとフレッドが本を交換します。次にボブとデイブが本を交換します。続いてイヴとアリスが本を交換します。その後ボブとフレッドが本を交換します。さらにデイブとイヴが本を交換します。次にクレアとガートルードが本を交換します。最後にフレッドとイヴが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『グレート・ギャツビー』\n(C) 『ロリータ』\n(D) 『ユリシーズ』\n(E) 『フランケンシュタイン』\n(F) 『白鯨』\n(G) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフルバック、ボブはベンチウォーマー、クレアは右ミッドフィールダー、デイブはフォワード、イヴは左ウィング、フレッドはゴールキーパー、ガートルードはチアリーダーを担当しています。\n試合が進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交代します。次にフレッドとクレアがポジションを交代します。続いてボブとフレッドがポジションを交代します。さらにボブとクレアがポジションを交代します。その後、イヴとアリスがポジションを交代します。次にデイブとガートルードがポジションを交代します。最後にクレアとガートルードがポジションを交代します。試合終了時、デイブが担当しているのは\n選択肢:\n(A) フルバック\n(B) ベンチウォーマー\n(C) 右ミッドフィールダー\n(D) フォワード\n(E) 左ウィング\n(F) ゴールキーパー\n(G) チアリーダー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『真珠』、ボブは『指輪物語』、クレアは『キャッチ=22』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『ユリシーズ』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとボブが本を交換します。次にアリスとフレッドが本を交換します。続いてガートルードとクレアが本を交換します。その後フレッドとイヴが本を交換します。さらにクレアとデイブが本を交換します。次にイヴとボブが本を交換します。最後にフレッドとガートルードが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『指輪物語』\n(C) 『キャッチ=22』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『ユリシーズ』\n(G) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『ユリシーズ』、クレアは『グレート・ギャツビー』、デイブは『オデュッセイア』、イヴは『指輪物語』、フレッドは『キャッチ=22』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとガートルードが本を交換します。次にフレッドとデイブが本を交換します。続いてアリスとボブが本を交換します。その後イヴとガートルードが本を交換します。さらにデイブとボブが本を交換します。次にフレッドとイヴが本を交換します。最後にボブとフレッドが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『ユリシーズ』\n(C) 『グレート・ギャツビー』\n(D) 『オデュッセイア』\n(E) 『指輪物語』\n(F) 『キャッチ=22』\n(G) 『白鯨』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは青色のボール、クレアは黄色のボール、デイブは茶色のボール、イヴは黒色のボール、フレッドは白色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。続いてイヴとボブがボールを交換します。その後ガートルードとクレアがボールを交換します。さらにアリスとガートルードがボールを交換します。次にボブとクレアがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 青色のボール\n(C) 黄色のボール\n(D) 茶色のボール\n(E) 黒色のボール\n(F) 白色のボール\n(G) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは紫色のプレゼント、クレアは緑色のプレゼント、デイブはピンク色のボール、イヴは白色のプレゼント、フレッドは黄色のプレゼント、ガートルードは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとフレッドがプレゼントを交換します。次にガートルードとデイブがプレゼントを交換します。続いてデイブとフレッドが再びプレゼントを交換します。その後、クレアとアリスがプレゼントを交換します。続いてクレアとデイブがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。最後にアリスとイヴがプレゼントを交換します。イベント終了時、フレッドが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 紫色のプレゼント\n(C) 緑色のプレゼント\n(D) ピンク色のボール\n(E) 白色のプレゼント\n(F) 黄色のプレゼント\n(G) 茶色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはヘルガと、クレアはサムと、デイブはメリッサと、イヴはジェイミーと、フレッドはロドリゴと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にガートルードとクレアがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにフレッドとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。最後にイヴとクレアがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ローラ\n(B) ヘルガ\n(C) サム\n(D) メリッサ\n(E) ジェイミー\n(F) ロドリゴ\n(G) パトリック", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは白色のボール、クレアは黄色のボール、デイブはピンク色のボール、イヴはオレンジ色のボール、フレッドは黒色のボール、ガートルードは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとガートルードがボールを交換します。次にフレッドとクレアがボールを交換します。続いてデイブとガートルードがボールを交換します。その後再びボブとガートルードがボールを交換します。次にアリスとクレアがボールを交換します。続いてガートルードとクレアがボールを交換します。最後にイヴとクレアがボールを交換します。ゲーム終了時、フレッドが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 白色のボール\n(C) 黄色のボール\n(D) ピンク色のボール\n(E) オレンジ色のボール\n(F) 黒色のボール\n(G) 茶色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは青色のプレゼント、ボブは緑色のプレゼント、クレアは茶色のプレゼント、デイブは紫色のプレゼント、イヴはオレンジ色のボール、フレッドはピンク色のボール、ガートルードは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとクレアがプレゼントを交換します。次にフレッドとクレアがプレゼントを交換します。続いてデイブとボブがプレゼントを交換します。その後アリスとクレアがプレゼントを交換します。さらにデイブとアリスがプレゼントを交換します。最後にガートルードとイヴがプレゼントを交換し、その後クレアとガートルードがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント\n(D) 紫色のプレゼント\n(E) オレンジ色のボール\n(F) ピンク色のボール\n(G) 赤色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブはチアリーダー、クレアは左ミッドフィールダー、デイブはセンターミッドフィールダー、イヴは左ウイング、フレッドは右ウイング、ガートルードはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとアリスがポジションを交代します。次にフレッドとクレアがポジションを交代します。続いてガートルードとイヴがポジションを交代します。その後、ボブとアリスがポジションを交代します。さらにボブとガートルードがポジションを交代します。次にガートルードとアリスがポジションを交代します。最後にイヴとボブがポジションを交代します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) チアリーダー\n(C) 左ミッドフィールダー\n(D) センターミッドフィールダー\n(E) 左ウイング\n(F) 右ウイング\n(G) フルバック", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『ユリシーズ』、クレアは『バスカヴィル家の犬』、デイブは『グレート・ギャツビー』、イヴは『キャッチ=22』、フレッドは『指輪物語』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとイヴが本を交換します。次にボブとガートルードが本を交換します。続いてクレアとデイブが本を交換します。その後ガートルードとデイブが本を交換します。さらにアリスとフレッドが本を交換し、イヴとフレッドが本を交換します。最後にガートルードとボブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『ユリシーズ』\n(C) 『バスカヴィル家の犬』\n(D) 『グレート・ギャツビー』\n(E) 『キャッチ=22』\n(F) 『指輪物語』\n(G) 『オデュッセイア』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは青色のボール、クレアは赤色のボール、デイブは紫色のボール、イヴはピンク色のボール、フレッドは茶色のボール、ガートルードは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとガートルードがボールを交換します。次にフレッドとアリスがボールを交換します。続いてアリスとクレアがボールを交換します。その後ボブとデイブがボールを交換します。さらにフレッドとイヴがボールを交換します。次にガートルードとフレッドがボールを交換します。最後にガートルードとボブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 青色のボール\n(C) 赤色のボール\n(D) 紫色のボール\n(E) ピンク色のボール\n(F) 茶色のボール\n(G) 白色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『ユリシーズ』、クレアは『真珠』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『オデュッセイア』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとデイブが本を交換します。次にアリスとイヴが本を交換します。続いてガートルードとデイブが本を交換します。その後アリスとフレッドが本を交換します。さらにボブとクレアが本を交換します。その後アリスとイヴが再び本を交換します。最後にイヴとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『ユリシーズ』\n(C) 『真珠』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『オデュッセイア』\n(G) 『白鯨』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれ以下のポジションに配置されています：アリスはベンチウォーマー、ボブはチアリーダー、クレアは左ミッドフィールダー、デイブはセンターミッドフィールダー、イヴは左ウイング、フレッドは右ウイング、ガートルードはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとアリスがポジションを交代します。次にフレッドとクレアがポジションを交代します。続いてガートルードとイヴがポジションを交代します。その後、ボブとアリスがポジションを交代します。さらにボブとガートルードがポジションを交代します。次にガートルードとアリスがポジションを交代します。最後にイヴとボブがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) チアリーダー\n(C) 左ミッドフィールダー\n(D) センターミッドフィールダー\n(E) 左ウイング\n(F) 右ウイング\n(G) フルバック", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブはオレンジ色のボール、クレアは白色のプレゼント、デイブは緑色のプレゼント、イヴは黄色のプレゼント、フレッドは茶色のプレゼント、ガートルードは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。続いてアリスとボブがプレゼントを交換します。その後アリスとガートルードがプレゼントを交換します。さらにクレアとボブがプレゼントを交換します。その後デイブとフレッドがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) オレンジ色のボール\n(C) 白色のプレゼント\n(D) 緑色のプレゼント\n(E) 黄色のプレゼント\n(F) 茶色のプレゼント\n(G) 赤色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはパトリックと、クレアはジェイミーと、デイブはカールと、イヴはオフィーリアと、フレッドはイジーと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずガートルードとクレアがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてフレッドとボブがパートナーを交代します。その後デイブとアリスがパートナーを交代します。さらにアリスとクレアがパートナーを交代します。次にデイブとボブがパートナーを交代します。最後にガートルードとフレッドがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) ヘルガ\n(B) パトリック\n(C) ジェイミー\n(D) カール\n(E) オフィーリア\n(F) イジー\n(G) メリッサ\nと踊っています。", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは茶色のボール、クレアは緑色のボール、デイブはオレンジ色のボール、イヴは黒色のボール、フレッドはピンク色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にアリスとデイブがボールを交換します。続いてデイブとガートルードがボールを交換します。その後ボブとイヴがボールを交換します。次にガートルードとフレッドがボールを交換します。さらにデイブとアリスがボールを交換します。最後にデイブとイヴがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 茶色のボール\n(C) 緑色のボール\n(D) オレンジ色のボール\n(E) 黒色のボール\n(F) ピンク色のボール\n(G) 黄色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはロドリゴと、クレアはカールと、デイブはオフィーリアと、イヴはローラと、フレッドはジェイミーと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとイヴがパートナーを交代します。次にガートルードとクレアがパートナーを交代します。続いてフレッドとクレアがパートナーを交代します。その後デイブとアリスがパートナーを交代し、続いてデイブとフレッドがパートナーを交代します。さらにアリスとボブがパートナーを交代し、最後にフレッドとボブがパートナーを交代します。ダンスが終了する時点で、クレアのパートナーは\n選択肢:\n(A) メリッサ\n(B) ロドリゴ\n(C) カール\n(D) オフィーリア\n(E) ローラ\n(F) ジェイミー\n(G) パトリック", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『真珠』、ボブは『ユリシーズ』、クレアは『白鯨』、デイブは『フランケンシュタイン』、イヴは『バスカヴィル家の犬』、フレッドは『キャッチ=22』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとフレッドが本を交換します。次にアリスとイヴが本を交換します。続いてクレアとデイブが本を交換します。その後クレアとボブが本を交換します。さらにフレッドとイヴが本を交換します。次にボブとデイブが本を交換します。最後にガートルードとイヴが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『ユリシーズ』\n(C) 『白鯨』\n(D) 『フランケンシュタイン』\n(E) 『バスカヴィル家の犬』\n(F) 『キャッチ=22』\n(G) 『オデュッセイア』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黒色のボール、クレアは紫色のプレゼント、デイブはピンク色のボール、イヴは緑色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にイヴとフレッドがプレゼントを交換します。続いてボブとアリスが再びプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。さらにボブとフレッドがプレゼントを交換します。最後にクレアとガートルードがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黒色のボール\n(C) 紫色のプレゼント\n(D) ピンク色のボール\n(E) 緑色のプレゼント\n(F) オレンジ色のボール\n(G) 黄色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはロドリゴと、クレアはジェイミーと、デイブはローラと、イヴはヘルガと、フレッドはメリッサと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後アリスとガートルードがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にフレッドとイヴがパートナーを交代します。ダンス終了時、ボブのパートナーは\n選択肢:\n(A) サム\n(B) ロドリゴ\n(C) ジェイミー\n(D) ローラ\n(E) ヘルガ\n(F) メリッサ\n(G) オフィーリア", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブは黄色のプレゼント、クレアは赤色のプレゼント、デイブは白色のプレゼント、イヴはピンク色のボール、フレッドは青色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。続いてボブとガートルードがプレゼントを交換します。その後フレッドとデイブがプレゼントを交換します。さらにボブとガートルードが交換し、最後にデイブとガートルードが交換します。最終的に、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黄色のプレゼント\n(C) 赤色のプレゼント\n(D) 白色のプレゼント\n(E) ピンク色のボール\n(F) 青色のプレゼント\n(G) 紫色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはオフィーリアと、クレアはサムと、デイブはヘルガと、イヴはパトリックと、フレッドはジェイミーと、ガートルードはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとボブがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてフレッドとイヴがパートナーを交代します。その後クレアとフレッドがパートナーを交代します。さらにガートルードとアリスがパートナーを交代します。そしてアリスとボブがパートナーを交代します。最後にデイブとフレッドがパートナーを交代します。ダンスが終わる時点で、クレアは\n選択肢:\n(A) ローラと踊っています\n(B) オフィーリアと踊っています\n(C) サムと踊っています\n(D) ヘルガと踊っています\n(E) パトリックと踊っています\n(F) ジェイミーと踊っています\n(G) ロドリゴと踊っています", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはチアリーダー、クレアは右ミッドフィールダー、デイブはセンターミッドフィールダー、イヴはゴールキーパー、フレッドはストライカー、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交代します。次にアリスとイヴがポジションを交換します。続いてクレアとガートルードがポジションを交換します。その後フレッドとアリスがポジションを交換し、続いてボブとクレアが交換します。さらにデイブとイヴが交換し、最後にボブとアリスがポジションを入れ替えます。試合終了時、ガートルードがプレーしているのは\n選択肢:\n(A) 左ミッドフィールダー\n(B) チアリーダー\n(C) 右ミッドフィールダー\n(D) センターミッドフィールダー\n(E) ゴールキーパー\n(F) ストライカー\n(G) ベンチウォーマー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『指輪物語』、クレアは『オデュッセイア』、デイブは『ロリータ』、イヴは『バスカヴィル家の犬』、フレッドは『フランケンシュタイン』、ガートルードは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずフレッドとデイブが本を交換します。次にアリスとクレアが本を交換します。続いてイヴとデイブが本を交換します。その後ボブとイヴが本を交換します。さらにガートルードとクレアが本を交換し、最後にイヴとガートルードが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『指輪物語』\n(C) 『オデュッセイア』\n(D) 『ロリータ』\n(E) 『バスカヴィル家の犬』\n(F) 『フランケンシュタイン』\n(G) 『グレート・ギャツビー』", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは紫色のプレゼント、クレアは白色のプレゼント、デイブは茶色のプレゼント、イヴは緑色のプレゼント、フレッドは青色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。続いてガートルードとアリスがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にフレッドとアリスがプレゼントを交換します。最後にフレッドとイヴがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 紫色のプレゼント\n(C) 白色のプレゼント\n(D) 茶色のプレゼント\n(E) 緑色のプレゼント\n(F) 青色のプレゼント\n(G) 黄色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『真珠』、ボブは『指輪物語』、クレアは『キャッチ=22』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『ユリシーズ』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとボブが本を交換します。次にアリスとフレッドが本を交換します。続いてガートルードとクレアが本を交換します。その後フレッドとイヴが本を交換します。さらにクレアとデイブが本を交換します。次にイヴとボブが本を交換します。最後にフレッドとガートルードが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『指輪物語』\n(C) 『キャッチ=22』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『ユリシーズ』\n(G) 『オデュッセイア』", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『オデュッセイア』、イヴは『ロリータ』、フレッドは『真珠』、ガートルードは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとクレアが本を交換します。次にフレッドとクレアが本を交換します。続いてボブとガートルードが本を交換します。その後アリスとフレッドが本を交換します。次にクレアとデイブが本を交換します。さらにボブとガートルードが本を交換します。最後にイヴとボブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『オデュッセイア』\n(E) 『ロリータ』\n(F) 『真珠』\n(G) 『指輪物語』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはチアリーダー、クレアはフルバック、デイブは右ウィング、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてガートルードとアリスがポジションを交換します。その後ボブとクレアがポジションを交換し、続いてアリスとボブが交換します。さらにイヴとフレッドがポジションを交換し、最後にアリスとフレッドが交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) チアリーダー\n(C) フルバック\n(D) 右ウィング\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) センターミッドフィールダー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはゴールキーパー、ボブはセンターミッドフィールダー、クレアはベンチウォーマー、デイブは左ウィング、イヴはフォワード、フレッドは右ミッドフィールダー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてデイブとボブがポジションを交換します。その後フレッドとガートルードがポジションを交換します。さらにボブとクレアがポジションを交換します。次にデイブとアリスがポジションを交換します。最後にクレアとイヴがポジションを交換します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) センターミッドフィールダー\n(C) ベンチウォーマー\n(D) 左ウィング\n(E) フォワード\n(F) 右ミッドフィールダー\n(G) 左ミッドフィールダー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはヘルガと、クレアはメリッサと、デイブはサムと、イヴはカールと、フレッドはオフィーリアと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとイヴがパートナーを交代します。次にボブとデイブがパートナーを交代します。続いてイヴとアリスがパートナーを交代します。その後ボブとクレアがパートナーを交代します。さらにイヴとアリスがパートナーを交代します。最後にガートルードとフレッドがパートナーを交代します。ダンスが終了する時点で、フレッドは\n選択肢:\n(A) イジー\n(B) ヘルガ\n(C) メリッサ\n(D) サム\n(E) カール\n(F) オフィーリア\n(G) ローラ\nと踊っています。", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブはピンク色のボール、クレアは茶色のボール、デイブは緑色のボール、イヴは黄色のボール、フレッドは赤色のボール、ガートルードは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとガートルードがボールを交換します。次にデイブとボブがボールを交換します。続いてイヴとガートルードがボールを交換します。その後ボブとアリスがボールを交換します。さらにイヴとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。最後にガートルードとフレッドがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) ピンク色のボール\n(C) 茶色のボール\n(D) 緑色のボール\n(E) 黄色のボール\n(F) 赤色のボール\n(G) 青色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはオフィーリアと、クレアはローラと、デイブはパトリックと、イヴはロドリゴと、フレッドはメリッサと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとデイブがパートナーを交代します。次にフレッドとイヴがパートナーを交代します。続いてアリスとガートルードがパートナーを交代します。その後デイブとボブがパートナーを交代します。さらにアリスとクレアがパートナーを交代します。そしてアリスとガートルードが再びパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終了する時点で、フレッドは\n選択肢:\n(A) ジェイミーと踊っている\n(B) オフィーリアと踊っている\n(C) ローラと踊っている\n(D) パトリックと踊っている\n(E) ロドリゴと踊っている\n(F) メリッサと踊っている\n(G) カールと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『フランケンシュタイン』、デイブは『白鯨』、イヴは『ユリシーズ』、フレッドは『真珠』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとイヴが本を交換します。次にデイブとフレッドが本を交換します。続いてガートルードとボブが本を交換します。その後アリスとクレアが本を交換します。さらにフレッドとクレアが本を交換します。次にボブとガートルードが本を交換します。最後にクレアとフレッドが本を交換します。学期終了時、フレッドが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『フランケンシュタイン』\n(D) 『白鯨』\n(E) 『ユリシーズ』\n(F) 『真珠』\n(G) 『オデュッセイア』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはサムと、クレアはヘルガと、デイブはオフィーリアと、イヴはメリッサと、フレッドはロドリゴと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にデイブとフレッドがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にデイブとイヴがパートナーを交代します。最後にフレッドとガートルードがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) ローラ\n(B) サム\n(C) ヘルガ\n(D) オフィーリア\n(E) メリッサ\n(F) ロドリゴ\n(G) カール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはオフィーリアと、クレアはヘルガと、デイブはパトリックと、イヴはロドリゴと、フレッドはイジーと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずガートルードとイヴがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてフレッドとデイブがパートナーを交代します。その後ボブとクレアがパートナーを交代します。さらにフレッドとアリスがパートナーを交代します。次にクレアとイヴがパートナーを交代します。最後にイヴとボブがパートナーを交代します。ダンス終了時、アリスは\n選択肢:\n(A) ジェイミーと踊っている\n(B) オフィーリアと踊っている\n(C) ヘルガと踊っている\n(D) パトリックと踊っている\n(E) ロドリゴと踊っている\n(F) イジーと踊っている\n(G) ローラと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは黒色のボール、クレアはオレンジ色のボール、デイブは紫色のボール、イヴは茶色のボール、フレッドはピンク色のボール、ガートルードは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとフレッドがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとガートルードがボールを交換します。その後イヴとデイブがボールを交換します。さらにデイブとフレッドがボールを交換します。次にフレッドとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 黒色のボール\n(C) オレンジ色のボール\n(D) 紫色のボール\n(E) 茶色のボール\n(F) ピンク色のボール\n(G) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『グレート・ギャツビー』、ボブは『指輪物語』、クレアは『ユリシーズ』、デイブは『オデュッセイア』、イヴは『フランケンシュタイン』、フレッドは『バスカヴィル家の犬』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にデイブとフレッドが本を交換します。続いてアリスとイヴが本を交換します。その後クレアとデイブが本を交換し、次にフレッドとクレアが交換します。さらにクレアとガートルードが交換し、最後にフレッドとボブが本を交換します。学期終了時、フレッドが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『指輪物語』\n(C) 『ユリシーズ』\n(D) 『オデュッセイア』\n(E) 『フランケンシュタイン』\n(F) 『バスカヴィル家の犬』\n(G) 『白鯨』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブは右ウィング、クレアはフォワード、デイブは右ミッドフィールダー、イヴはサイドバック、フレッドはゴールキーパー、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとイヴがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてフレッドとボブがポジションを交換します。その後ガートルードとフレッドがポジションを交換します。さらにアリスとイヴがポジションを交換します。次にイヴとデイブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、アリスが担当しているポジションは\n選択肢:\n(A) 左ウィング\n(B) 右ウィング\n(C) フォワード\n(D) 右ミッドフィールダー\n(E) サイドバック\n(F) ゴールキーパー\n(G) チアリーダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『フランケンシュタイン』、クレアは『ユリシーズ』、デイブは『バスカヴィル家の犬』、イヴは『白鯨』、フレッドは『指輪物語』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にガートルードとクレアが本を交換します。続いてデイブとガートルードが本を交換します。その後アリスとフレッドが本を交換し、続いてデイブとイヴが本を交換します。さらにクレアとボブが本を交換し、最後にイヴとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『フランケンシュタイン』\n(C) 『ユリシーズ』\n(D) 『バスカヴィル家の犬』\n(E) 『白鯨』\n(F) 『指輪物語』\n(G) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『真珠』、クレアは『ロリータ』、デイブは『白鯨』、イヴは『オデュッセイア』、フレッドは『指輪物語』、ガートルードは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にアリスとクレアが本を交換します。続いてデイブとフレッドが本を交換します。その後ガートルードとイヴが本を交換します。さらにボブとデイブが本を交換し、最後にフレッドとイヴが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『真珠』\n(C) 『ロリータ』\n(D) 『白鯨』\n(E) 『オデュッセイア』\n(F) 『指輪物語』\n(G) 『バスカヴィル家の犬』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『指輪物語』、デイブは『キャッチ=22』、イヴは『オデュッセイア』、フレッドは『白鯨』、ガートルードは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとガートルードが本を交換します。次にボブとイヴが本を交換します。続いてアリスとガートルードが本を交換します。その後クレアとイヴが本を交換します。さらにイヴとアリスが本を交換します。次にフレッドとアリスが本を交換します。最後にイヴとデイブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『指輪物語』\n(D) 『キャッチ=22』\n(E) 『オデュッセイア』\n(F) 『白鯨』\n(G) 『ユリシーズ』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは青色のボール、クレアは黄色のボール、デイブは茶色のボール、イヴは黒色のボール、フレッドは白色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。続いてイヴとボブがボールを交換します。その後ガートルードとクレアがボールを交換します。さらにアリスとガートルードがボールを交換します。次にボブとクレアがボールを交換します。最後にボブとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 青色のボール\n(C) 黄色のボール\n(D) 茶色のボール\n(E) 黒色のボール\n(F) 白色のボール\n(G) オレンジ色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブはセンターミッドフィールダー、クレアは左ミッドフィールダー、デイブはフルバック、イヴはベンチウォーマー、フレッドは右ウィング、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとイヴがポジションを交換します。次にイヴとボブがポジションを交換します。続いてボブとデイブがポジションを交換します。その後ガートルードとクレアがポジションを交換し、次にボブとイヴが交換します。さらにイヴとアリスが交換し、最後にフレッドとボブがポジションを交換します。試合終了時、ボブが担当しているポジションは\n選択肢:\n(A) 左ウィング\n(B) センターミッドフィールダー\n(C) 左ミッドフィールダー\n(D) フルバック\n(E) ベンチウォーマー\n(F) 右ウィング\n(G) チアリーダー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは白色のボール、ボブは茶色のボール、クレアは青色のボール、デイブはピンク色のボール、イヴは紫色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとデイブがボールを交換します。次にガートルードとクレアがボールを交換します。続いてデイブとボブがボールを交換します。その後クレアとガートルードがボールを交換します。さらにアリスとフレッドがボールを交換します。次にボブとアリスがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 白色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) ピンク色のボール\n(E) 紫色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは紫色のボール、クレアは青色のボール、デイブは黒色のボール、イヴはオレンジ色のボール、フレッドは白色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとクレアがボールを交換します。次にアリスとボブがボールを交換します。続いてガートルードとフレッドがボールを交換します。その後デイブとイヴがボールを交換します。さらにガートルードとデイブがボールを交換します。次にフレッドとボブがボールを交換します。最後にガートルードとアリスがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 紫色のボール\n(C) 青色のボール\n(D) 黒色のボール\n(E) オレンジ色のボール\n(F) 白色のボール\n(G) 黄色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブは右ミッドフィールダー、クレアは右ウイング、デイブはセンターミッドフィールダー、イヴはフルバック、フレッドはストライカー、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交代します。次にクレアとフレッドがポジションを交代します。続いてガートルードとフレッドがポジションを交代します。その後イヴとフレッドがポジションを交代します。さらにアリスとガートルードがポジションを交代します。その後ガートルードとデイブがポジションを交代します。最後にボブとデイブがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) チアリーダー\n(B) 右ミッドフィールダー\n(C) 右ウイング\n(D) センターミッドフィールダー\n(E) フルバック\n(F) ストライカー\n(G) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはイジーと、クレアはサムと、デイブはカールと、イヴはローラと、フレッドはジェイミーと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後アリスとイヴがパートナーを交代します。さらにクレアとフレッドがパートナーを交代します。次にクレアとガートルードがパートナーを交代します。最後にアリスとイヴが再びパートナーを交代します。ダンスが終了する時点で、ガートルードは\n選択肢:\n(A) パトリック\n(B) イジー\n(C) サム\n(D) カール\n(E) ローラ\n(F) ジェイミー\n(G) オフィーリア", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『グレート・ギャツビー』、クレアは『指輪物語』、デイブは『真珠』、イヴは『バスカヴィル家の犬』、フレッドは『ロリータ』、ガートルードは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にデイブとボブが本を交換します。続いてクレアとフレッドが本を交換します。その後クレアとデイブが本を交換します。さらにフレッドとイヴが本を交換します。最後にアリスとデイブが本を交換し、最終的にフレッドとガートルードが本を交換します。学期終了時、ガートルードが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『グレート・ギャツビー』\n(C) 『指輪物語』\n(D) 『真珠』\n(E) 『バスカヴィル家の犬』\n(F) 『ロリータ』\n(G) 『キャッチ=22』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『白鯨』、クレアは『バスカヴィル家の犬』、デイブは『キャッチ=22』、イヴは『指輪物語』、フレッドは『真珠』、ガートルードは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとボブが本を交換します。次にアリスとイヴが本を交換します。続いてボブとフレッドが本を交換します。その後ガートルードとクレアが本を交換します。さらにフレッドとデイブが本を交換します。次にアリスとフレッドが本を交換します。最後にデイブとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『白鯨』\n(C) 『バスカヴィル家の犬』\n(D) 『キャッチ=22』\n(E) 『指輪物語』\n(F) 『真珠』\n(G) 『フランケンシュタイン』", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはサムと、クレアはヘルガと、デイブはオフィーリアと、イヴはメリッサと、フレッドはロドリゴと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にデイブとフレッドがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にデイブとイヴがパートナーを交代します。最後にフレッドとガートルードがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ローラ\n(B) サム\n(C) ヘルガ\n(D) オフィーリア\n(E) メリッサ\n(F) ロドリゴ\n(G) カール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『オデュッセイア』、ボブは『グレート・ギャツビー』、クレアは『ロリータ』、デイブは『真珠』、イヴは『指輪物語』、フレッドは『フランケンシュタイン』、ガートルードは『バスカヴィル家の犬』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にアリスとデイブが本を交換します。続いてガートルードとフレッドが本を交換します。その後、ボブとアリスが本を交換します。次にアリスとイヴが本を交換します。続いてデイブとガートルードが本を交換します。最後にデイブとイヴが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『グレート・ギャツビー』\n(C) 『ロリータ』\n(D) 『真珠』\n(E) 『指輪物語』\n(F) 『フランケンシュタイン』\n(G) 『バスカヴィル家の犬』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブは右ミッドフィールダー、クレアはフォワード、デイブはサイドバック、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとボブがポジションを交換します。次にフレッドとクレアがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後イヴとデイブがポジションを交換します。さらにクレアとアリスがポジションを交換します。その後デイブとボブがポジションを交換します。最後にガートルードとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) 右ミッドフィールダー\n(C) フォワード\n(D) サイドバック\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) 右ウイング", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『白鯨』、ボブは『オデュッセイア』、クレアは『ユリシーズ』、デイブは『指輪物語』、イヴは『ロリータ』、フレッドは『真珠』、ガートルードは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとクレアが本を交換します。次にガートルードとフレッドが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとアリスが本を交換します。さらにガートルードとクレアが本を交換します。その後、ガートルードとボブが本を交換します。最後にボブとイヴが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『オデュッセイア』\n(C) 『ユリシーズ』\n(D) 『指輪物語』\n(E) 『ロリータ』\n(F) 『真珠』\n(G) 『キャッチ=22』", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはロドリゴと、クレアはジェイミーと、デイブはヘルガと、イヴはオフィーリアと、フレッドはイジーと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとイヴがパートナーを交代します。次にボブとイヴがパートナーを交代します。続いてフレッドとデイブがパートナーを交代します。その後ボブとフレッドがパートナーを交代します。さらにボブとガートルードがパートナーを交代します。次にフレッドとデイブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンス終了時、イヴは\n選択肢:\n(A) メリッサと\n(B) ロドリゴと\n(C) ジェイミーと\n(D) ヘルガと\n(E) オフィーリアと\n(F) イジーと\n(G) パトリックと\n踊っています。", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアはオレンジ色のボール、デイブは赤色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にガートルードとイヴがボールを交換します。続いてボブとフレッドがボールを交換します。その後クレアとフレッドがボールを交換します。さらにアリスとクレアがボールを交換します。次にイヴとフレッドがボールを交換します。最後にイヴとデイブがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール\n(D) 赤色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは黒色のボール、クレアはオレンジ色のボール、デイブは紫色のボール、イヴは茶色のボール、フレッドはピンク色のボール、ガートルードは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとフレッドがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとガートルードがボールを交換します。その後イヴとデイブがボールを交換します。さらにデイブとフレッドがボールを交換します。次にフレッドとクレアがボールを交換します。最後にクレアとボブがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 黒色のボール\n(C) オレンジ色のボール\n(D) 紫色のボール\n(E) 茶色のボール\n(F) ピンク色のボール\n(G) 青色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは緑色のプレゼント、クレアは茶色のプレゼント、デイブは紫色のプレゼント、イヴはオレンジ色のボール、フレッドはピンク色のボール、ガートルードは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとクレアがプレゼントを交換します。次にフレッドとクレアがプレゼントを交換します。続いてデイブとボブがプレゼントを交換します。その後アリスとクレアがプレゼントを交換します。さらにデイブとアリスがプレゼントを交換します。最後にガートルードとイヴがプレゼントを交換し、その後クレアとガートルードがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント\n(D) 紫色のプレゼント\n(E) オレンジ色のボール\n(F) ピンク色のボール\n(G) 赤色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはフォワード、ボブはゴールキーパー、クレアは左ウイング、デイブは右ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとフレッドがポジションを交換します。次にクレアとイヴがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後、アリスとクレアがポジションを交換します。さらにガートルードとデイブがポジションを交換します。そしてボブとアリスがポジションを交換します。最後にガートルードとデイブがポジションを交換します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ゴールキーパー\n(C) 左ウイング\n(D) 右ミッドフィールダー\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) 左ミッドフィールダー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはチアリーダー、クレアはフォワード、デイブは左ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドは右ミッドフィールダー、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとクレアがポジションを交代します。次にデイブとガートルードがポジションを交代します。続いてアリスとイヴがポジションを交代します。その後フレッドとボブがポジションを交代します。さらにクレアとガートルードがポジションを交代します。次にフレッドとデイブがポジションを交代します。最後にイヴとクレアがポジションを交代します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) チアリーダー\n(C) フォワード\n(D) 左ミッドフィールダー\n(E) センターミッドフィールダー\n(F) 右ミッドフィールダー\n(G) ゴールキーパー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黒色のボール、クレアは紫色のプレゼント、デイブはピンク色のボール、イヴは緑色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にイヴとフレッドがプレゼントを交換します。続いてボブとアリスが再びプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。さらにボブとフレッドがプレゼントを交換します。最後にクレアとガートルードがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黒色のボール\n(C) 紫色のプレゼント\n(D) ピンク色のボール\n(E) 緑色のプレゼント\n(F) オレンジ色のボール\n(G) 黄色のプレゼント", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはオフィーリアと、クレアはヘルガと、デイブはイジーと、イヴはメリッサと、フレッドはサムと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてフレッドとボブがパートナーを交代します。その後デイブとボブがパートナーを交代します。さらにクレアとガートルードがパートナーを交代します。そしてボブとイヴがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンスが終了する時点で、フレッドは\n選択肢:\n(A) カールと\n(B) オフィーリアと\n(C) ヘルガと\n(D) イジーと\n(E) メリッサと\n(F) サムと\n(G) パトリックと\n踊っています。", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは左ミッドフィールダー、クレアはゴールキーパー、デイブはセンターミッドフィールダー、イヴはフルバック、フレッドはチアリーダー、ガートルードは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にガートルードとフレッドがポジションを交換します。続いてクレアとフレッドがポジションを交換します。その後イヴとボブがポジションを交換します。さらにイヴとアリスがポジションを交換します。その後イヴとガートルードがポジションを交換します。最後にデイブとガートルードがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 左ミッドフィールダー\n(C) ゴールキーパー\n(D) センターミッドフィールダー\n(E) フルバック\n(F) チアリーダー\n(G) 右ウイング", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『ユリシーズ』、クレアは『真珠』、デイブは『グレート・ギャツビー』、イヴは『フランケンシュタイン』、フレッドは『オデュッセイア』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとデイブが本を交換します。次にアリスとイヴが本を交換します。続いてガートルードとデイブが本を交換します。その後アリスとフレッドが本を交換します。さらにボブとクレアが本を交換します。その後アリスとイヴが再び本を交換します。最後にイヴとクレアが本を交換します。学期終了時、フレッドが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『ユリシーズ』\n(C) 『真珠』\n(D) 『グレート・ギャツビー』\n(E) 『フランケンシュタイン』\n(F) 『オデュッセイア』\n(G) 『白鯨』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブはフォワード、クレアは左ウィング、デイブはチアリーダー、イヴはフルバック、フレッドは右ウィング、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交代します。次にガートルードとボブがポジションを交代します。続いてイヴとアリスがポジションを交代します。その後クレアとフレッドがポジションを交代します。さらにガートルードとデイブがポジションを交代します。その後イヴとフレッドがポジションを交代します。最後にフレッドとボブがポジションを交代します。試合終了時、ガートルードがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) フォワード\n(C) 左ウィング\n(D) チアリーダー\n(E) フルバック\n(F) 右ウィング\n(G) ベンチウォーマー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『ロリータ』、クレアは『グレート・ギャツビー』、デイブは『オデュッセイア』、イヴは『ユリシーズ』、フレッドは『真珠』、ガートルードは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとフレッドが本を交換します。次にデイブとガートルードが本を交換します。続いてデイブとクレアが本を交換します。その後アリスとボブが本を交換します。さらにイヴとクレアが本を交換します。次にアリスとガートルードが本を交換します。最後にボブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『ロリータ』\n(C) 『グレート・ギャツビー』\n(D) 『オデュッセイア』\n(E) 『ユリシーズ』\n(F) 『真珠』\n(G) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはチアリーダー、クレアは右ウイング、デイブは右ミッドフィールダー、イヴはフォワード、フレッドは左ウイング、ガートルードはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとガートルードがポジションを交換します。次にデイブとガートルードがポジションを交換します。続いてガートルードとフレッドがポジションを交換します。その後、アリスとボブがポジションを交換します。さらにクレアとデイブがポジションを交換します。次にイヴとクレアがポジションを交換します。最後にアリスとガートルードがポジションを交換します。試合終了時、フレッドがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) チアリーダー\n(C) 右ウイング\n(D) 右ミッドフィールダー\n(E) フォワード\n(F) 左ウイング\n(G) フルバック", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはオフィーリアと、クレアはヘルガと、デイブはイジーと、イヴはメリッサと、フレッドはサムと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてフレッドとボブがパートナーを交代します。その後デイブとボブがパートナーを交代します。さらにクレアとガートルードがパートナーを交代します。そしてボブとイヴがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンスが終了する時点で、アリスは\n選択肢:\n(A) カールと踊っている\n(B) オフィーリアと踊っている\n(C) ヘルガと踊っている\n(D) イジーと踊っている\n(E) メリッサと踊っている\n(F) サムと踊っている\n(G) パトリックと踊っている", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはパトリックと、デイブはローラと、イヴはイジーと、フレッドはメリッサと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとボブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてアリスとガートルードがパートナーを交代します。その後ボブとガートルードがパートナーを交代します。さらにフレッドとアリスがパートナーを交代します。次にフレッドとクレアがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) パトリック\n(D) ローラ\n(E) イジー\n(F) メリッサ\n(G) カール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはロドリゴと、クレアはジェイミーと、デイブはイジーと、イヴはサムと、フレッドはカールと、ガートルードはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にボブとフレッドがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後アリスとフレッドがパートナーを交代します。さらにクレアとアリスがパートナーを交代します。次にボブとイヴがパートナーを交代します。最後にイヴとガートルードがパートナーを交代します。ダンスが終了する時点で、クレアのパートナーは\n選択肢:\n(A) ローラ\n(B) ロドリゴ\n(C) ジェイミー\n(D) イジー\n(E) サム\n(F) カール\n(G) ヘルガ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはパトリックと、デイブはロドリゴと、イヴはイジーと、フレッドはオフィーリアと、ガートルードはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとガートルードがパートナーを交代します。次にデイブとガートルードがパートナーを交代します。続いてフレッドとガートルードがパートナーを交代します。その後イヴとボブがパートナーを交代します。さらにガートルードとアリスがパートナーを交代します。次にデイブとイヴがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンス終了時、クレアは\n選択肢:\n(A) ローラと踊っている\n(B) メリッサと踊っている\n(C) パトリックと踊っている\n(D) ロドリゴと踊っている\n(E) イジーと踊っている\n(F) オフィーリアと踊っている\n(G) サムと踊っている", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『オデュッセイア』、イヴは『グレート・ギャツビー』、フレッドは『ロリータ』、ガートルードは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとアリスが本を交換します。続いてアリスとデイブが本を交換します。その後ガートルードとデイブが本を交換します。さらにアリスとボブが本を交換します。次にイヴとクレアが本を交換します。最後にアリスとフレッドが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『オデュッセイア』\n(E) 『グレート・ギャツビー』\n(F) 『ロリータ』\n(G) 『真珠』", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはイジーと、クレアはメリッサと、デイブはローラと、イヴはロドリゴと、フレッドはヘルガと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にイヴとガートルードがパートナーを交代します。続いてクレアとガートルードがパートナーを交代します。その後ガートルードとボブがパートナーを交代します。さらにクレアとボブがパートナーを交代します。次にフレッドとガートルードがパートナーを交代します。最後にクレアとデイブがパートナーを交代します。ダンス終了時、クレアのパートナーは\n選択肢:\n(A) カール\n(B) イジー\n(C) メリッサ\n(D) ローラ\n(E) ロドリゴ\n(F) ヘルガ\n(G) パトリック", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは青色のプレゼント、クレアは赤色のプレゼント、デイブは紫色のプレゼント、イヴは茶色のプレゼント、フレッドは白色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずガートルードとイヴがプレゼントを交換します。次にガートルードとボブがプレゼントを交換します。続いてガートルードとフレッドがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。さらにアリスとボブがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 青色のプレゼント\n(C) 赤色のプレゼント\n(D) 紫色のプレゼント\n(E) 茶色のプレゼント\n(F) 白色のプレゼント\n(G) 黄色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブはオレンジ色のボール、クレアはピンク色のボール、デイブは黄色のボール、イヴは青色のボール、フレッドは赤色のボール、ガートルードは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとボブがボールを交換します。次にアリスとデイブがボールを交換します。続いてガートルードとデイブがボールを交換します。その後フレッドとデイブがボールを交換します。さらにクレアとデイブがボールを交換します。次にボブとデイブがボールを交換します。最後にイヴとフレッドがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) オレンジ色のボール\n(C) ピンク色のボール\n(D) 黄色のボール\n(E) 青色のボール\n(F) 赤色のボール\n(G) 茶色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスはオレンジ色のボール、ボブは茶色のプレゼント、クレアはピンク色のボール、デイブは青色のプレゼント、イヴは緑色のプレゼント、フレッドは黄色のプレゼント、ガートルードは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとガートルードがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。さらにフレッドとアリスがプレゼントを交換します。次にガートルードとアリスがプレゼントを交換します。最後にボブとガートルードがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) オレンジ色のボール\n(B) 茶色のプレゼント\n(C) ピンク色のボール\n(D) 青色のプレゼント\n(E) 緑色のプレゼント\n(F) 黄色のプレゼント\n(G) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはフォワード、ボブはセンターミッドフィールダー、クレアは左ウィング、デイブはゴールキーパー、イヴはチアリーダー、フレッドは右ウィング、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとデイブがポジションを交換します。次にデイブとガートルードがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後イヴとガートルードがポジションを交換します。さらにボブとガートルードがポジションを交換します。次にアリスとガートルードがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) センターミッドフィールダー\n(C) 左ウィング\n(D) ゴールキーパー\n(E) チアリーダー\n(F) 右ウィング\n(G) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黄色のプレゼント、クレアは青色のプレゼント、デイブは緑色のプレゼント、イヴはピンク色のボール、フレッドは黒色のボール、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にフレッドとボブがプレゼントを交換します。続いてデイブとクレアがプレゼントを交換します。その後イヴとガートルードがプレゼントを交換します。さらにイヴとクレアがプレゼントを交換します。次にアリスとデイブがプレゼントを交換します。最後にクレアとイヴがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黄色のプレゼント\n(C) 青色のプレゼント\n(D) 緑色のプレゼント\n(E) ピンク色のボール\n(F) 黒色のボール\n(G) 紫色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ウィング、ボブはゴールキーパー、クレアはセンターミッドフィールダー、デイブは右ミッドフィールダー、イヴはフルバック、フレッドは左ミッドフィールダー、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとイヴがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてイヴとクレアがポジションを交換します。その後フレッドとイヴがポジションを交換します。さらにクレアとガートルードがポジションを交換し、続いてクレアとデイブがポジションを交換します。最後にフレッドとボブがポジションを交換します。試合終了時、フレッドが担当しているポジションは\n選択肢:\n(A) 左ウィング\n(B) ゴールキーパー\n(C) センターミッドフィールダー\n(D) 右ミッドフィールダー\n(E) フルバック\n(F) 左ミッドフィールダー\n(G) チアリーダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブはオレンジ色のボール、クレアは黒色のボール、デイブは青色のプレゼント、イヴはピンク色のボール、フレッドは紫色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとデイブがプレゼントを交換します。次にイヴとクレアがプレゼントを交換します。続いてガートルードとアリスがプレゼントを交換します。その後イヴとボブがプレゼントを交換し、続いてボブとアリスが交換します。最後にガートルードとデイブが交換し、最後にクレアとアリスが交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) 青色のプレゼント\n(E) ピンク色のボール\n(F) 紫色のプレゼント\n(G) 黄色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは右ウイング、クレアは右ミッドフィールダー、デイブはベンチウォーマー、イヴはチアリーダー、フレッドはゴールキーパー、ガートルードは左ウイングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとボブがポジションを交代します。次にボブとクレアがポジションを交換します。続いてアリスとイヴがポジションを交換します。その後デイブとクレアがポジションを交換します。さらにフレッドとアリスがポジションを交換します。その後ボブとフレッドがポジションを交換します。最後にアリスとガートルードがポジションを交換します。試合終了時、フレッドが担当しているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ウイング\n(C) 右ミッドフィールダー\n(D) ベンチウォーマー\n(E) チアリーダー\n(F) ゴールキーパー\n(G) 左ウイング", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『指輪物語』、クレアは『グレート・ギャツビー』、デイブは『バスカヴィル家の犬』、イヴは『フランケンシュタイン』、フレッドは『白鯨』、ガートルードは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとフレッドが本を交換します。次にクレアとボブが本を交換します。続いてフレッドとイヴが本を交換します。その後ガートルードとアリスが本を交換します。さらにフレッドとデイブが本を交換します。次にガートルードとイヴが本を交換します。最後にデイブとフレッドが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『指輪物語』\n(C) 『グレート・ギャツビー』\n(D) 『バスカヴィル家の犬』\n(E) 『フランケンシュタイン』\n(F) 『白鯨』\n(G) 『ユリシーズ』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブはピンク色のボール、クレアはオレンジ色のボール、デイブは黒色のボール、イヴは茶色のボール、フレッドは緑色のボール、ガートルードは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとアリスがボールを交換します。次にフレッドとボブがボールを交換します。続いてフレッドとクレアがボールを交換します。その後イヴとデイブがボールを交換します。さらにアリスとイヴがボールを交換します。次にアリスとクレアがボールを交換します。最後にクレアとフレッドがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) ピンク色のボール\n(C) オレンジ色のボール\n(D) 黒色のボール\n(E) 茶色のボール\n(F) 緑色のボール\n(G) 青色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは紫色のプレゼント、クレアは白色のプレゼント、デイブはオレンジ色のボール、イヴは黄色のプレゼント、フレッドは茶色のプレゼント、ガートルードはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとガートルードがプレゼントを交換します。次にガートルードとデイブがプレゼントを交換します。続いてイヴとガートルードがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。さらにフレッドとアリスがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、ガートルードが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 紫色のプレゼント\n(C) 白色のプレゼント\n(D) オレンジ色のボール\n(E) 黄色のプレゼント\n(F) 茶色のプレゼント\n(G) ピンク色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは茶色のボール、クレアは青色のボール、デイブは黒色のボール、イヴはピンク色のボール、フレッドはオレンジ色のボール、ガートルードは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとイヴがボールを交換します。次にデイブとアリスがボールを交換します。続いてガートルードとクレアがボールを交換します。その後フレッドとイヴがボールを交換します。さらにガートルードとボブがボールを交換します。次にイヴとクレアがボールを交換します。最後にボブとフレッドがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) 黒色のボール\n(E) ピンク色のボール\n(F) オレンジ色のボール\n(G) 緑色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『フランケンシュタイン』、デイブは『白鯨』、イヴは『ユリシーズ』、フレッドは『真珠』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとイヴが本を交換します。次にデイブとフレッドが本を交換します。続いてガートルードとボブが本を交換します。その後アリスとクレアが本を交換します。さらにフレッドとクレアが本を交換します。次にボブとガートルードが本を交換します。最後にクレアとフレッドが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『フランケンシュタイン』\n(D) 『白鯨』\n(E) 『ユリシーズ』\n(F) 『真珠』\n(G) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブはオレンジ色のボール、クレアはピンク色のボール、デイブは白色のプレゼント、イヴは黄色のプレゼント、フレッドは青色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてクレアとガートルードがプレゼントを交換します。その後クレアとイヴがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。最後にフレッドとデイブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) オレンジ色のボール\n(C) ピンク色のボール\n(D) 白色のプレゼント\n(E) 黄色のプレゼント\n(F) 青色のプレゼント\n(G) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブは黄色のボール、イヴはピンク色のボール、フレッドは白色のボール、ガートルードはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとガートルードがボールを交換します。次にデイブとアリスがボールを交換します。続いてフレッドとデイブがボールを交換します。その後ボブとフレッドがボールを交換します。次にクレアとデイブがボールを交換します。さらにデイブとアリスがボールを交換します。最後にボブとデイブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) 黄色のボール\n(E) ピンク色のボール\n(F) 白色のボール\n(G) オレンジ色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブはゴールキーパー、クレアはフォワード、デイブは右ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドはチアリーダー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとクレアがポジションを交代します。次にデイブとフレッドがポジションを交代します。続いてクレアとフレッドがポジションを交代します。その後イヴとガートルードがポジションを交代します。さらにアリスとフレッドがポジションを交代します。次にデイブとフレッドがポジションを交代します。最後にデイブとボブがポジションを交代します。試合終了時、ガートルードがプレーしているのは\n選択肢:\n(A) ベンチウォーマー\n(B) ゴールキーパー\n(C) フォワード\n(D) 右ミッドフィールダー\n(E) センターミッドフィールダー\n(F) チアリーダー\n(G) 左ミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは白色のプレゼント、ボブはオレンジ色のボール、クレアは黒色のボール、デイブはピンク色のボール、イヴは紫色のプレゼント、フレッドは緑色のプレゼント、ガートルードは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。さらにフレッドとイヴがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。最後にフレッドとガートルードがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) ピンク色のボール\n(E) 紫色のプレゼント\n(F) 緑色のプレゼント\n(G) 茶色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブはオレンジ色のボール、クレアは緑色のプレゼント、デイブはピンク色のボール、イヴは茶色のプレゼント、フレッドは白色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとイヴがプレゼントを交換します。次にイヴとフレッドがプレゼントを交換します。続いてボブとガートルードがプレゼントを交換します。その後フレッドとイヴが再びプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてクレアとイヴがプレゼントを交換します。最後にガートルードとイヴがプレゼントを交換します。イベント終了時、ガートルードが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) オレンジ色のボール\n(C) 緑色のプレゼント\n(D) ピンク色のボール\n(E) 茶色のプレゼント\n(F) 白色のプレゼント\n(G) 紫色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『キャッチ=22』、クレアは『ユリシーズ』、デイブは『白鯨』、イヴは『ロリータ』、フレッドは『真珠』、ガートルードは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとガートルードが本を交換します。次にイヴとデイブが本を交換します。続いてアリスとガートルードが本を交換します。その後イヴとアリスが本を交換します。さらにフレッドとイヴが本を交換します。次にアリスとボブが本を交換します。最後にクレアとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『キャッチ=22』\n(C) 『ユリシーズ』\n(D) 『白鯨』\n(E) 『ロリータ』\n(F) 『真珠』\n(G) 『指輪物語』", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはローラと、クレアはイジーと、デイブはロドリゴと、イヴはヘルガと、フレッドはサムと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてフレッドとガートルードがパートナーを交代します。その後ガートルードとアリスがパートナーを交代します。さらにアリスとデイブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。最後にアリスとデイブが再びパートナーを交代します。ダンスが終了する時点で、デイブは\n選択肢:\n(A) パトリック\n(B) ローラ\n(C) イジー\n(D) ロドリゴ\n(E) ヘルガ\n(F) サム\n(G) メリッサ\nと踊っています。", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは白色のボール、ボブは黒色のボール、クレアはピンク色のボール、デイブはオレンジ色のボール、イヴは紫色のボール、フレッドは緑色のボール、ガートルードは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとクレアがボールを交換します。次にボブとイヴがボールを交換します。続いてクレアとアリスがボールを交換します。その後ボブとアリスがボールを交換します。さらにデイブとイヴがボールを交換します。次にフレッドとガートルードがボールを交換します。最後にガートルードとクレアがボールを交換します。ゲーム終了時、フレッドが持っているボールは\n選択肢:\n(A) 白色のボール\n(B) 黒色のボール\n(C) ピンク色のボール\n(D) オレンジ色のボール\n(E) 紫色のボール\n(F) 緑色のボール\n(G) 茶色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブは左ウィング、クレアはゴールキーパー、デイブは右ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドはベンチウォーマー、ガートルードはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとクレアがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてフレッドとデイブがポジションを交換します。その後再びフレッドとクレアがポジションを交換します。さらにアリスとボブがポジションを交換します。続いてデイブとボブがポジションを交換します。最後にフレッドとイヴがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) チアリーダー\n(B) 左ウィング\n(C) ゴールキーパー\n(D) 右ミッドフィールダー\n(E) センターミッドフィールダー\n(F) ベンチウォーマー\n(G) フォワード", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは白色のボール、クレアは茶色のボール、デイブは青色のボール、イヴは黄色のボール、フレッドは黒色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずフレッドとガートルードがボールを交換します。次にガートルードとボブがボールを交換します。続いてフレッドとクレアがボールを交換します。その後クレアとデイブがボールを交換します。さらにクレアとイヴがボールを交換します。次にアリスとボブがボールを交換します。最後にクレアとイヴがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 白色のボール\n(C) 茶色のボール\n(D) 青色のボール\n(E) 黄色のボール\n(F) 黒色のボール\n(G) 紫色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは左ミッドフィールダー、クレアはゴールキーパー、デイブはセンターミッドフィールダー、イヴはフルバック、フレッドはチアリーダー、ガートルードは右ウイングです。\n試合が進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にガートルードとフレッドがポジションを交換します。続いてクレアとフレッドがポジションを交換します。その後イヴとボブがポジションを交換します。さらにイヴとアリスがポジションを交換します。その後イヴとガートルードがポジションを交換します。最後にデイブとガートルードがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 左ミッドフィールダー\n(C) ゴールキーパー\n(D) センターミッドフィールダー\n(E) フルバック\n(F) チアリーダー\n(G) 右ウイング", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはイジーと、クレアはオフィーリアと、デイブはメリッサと、イヴはパトリックと、フレッドはロドリゴと、ガートルードはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとボブがパートナーを交代します。次にイヴとガートルードがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後イヴとデイブがパートナーを交代します。さらにボブとアリスがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にボブとイヴがパートナーを交代します。ダンスが終了する時点で、フレッドは\n選択肢:\n(A) ヘルガ\n(B) イジー\n(C) オフィーリア\n(D) メリッサ\n(E) パトリック\n(F) ロドリゴ\n(G) サム", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは茶色のプレゼント、クレアは赤色のプレゼント、デイブは青色のプレゼント、イヴは白色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。続いてフレッドとガートルードがプレゼントを交換します。その後イヴとガートルードがプレゼントを交換します。さらにイヴとアリスがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。最後にガートルードとデイブがプレゼントを交換します。イベント終了時、アリスが持っているのは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のプレゼント\n(C) 赤色のプレゼント\n(D) 青色のプレゼント\n(E) 白色のプレゼント\n(F) オレンジ色のボール\n(G) 黒色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはロドリゴと、クレアはジェイミーと、デイブはローラと、イヴはヘルガと、フレッドはメリッサと、ガートルードはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後アリスとガートルードがパートナーを交代します。さらにアリスとボブがパートナーを交代します。次にボブとフレッドがパートナーを交代します。最後にフレッドとイヴがパートナーを交代します。ダンスが終わる時点で、フレッドのパートナーは\n選択肢:\n(A) サム\n(B) ロドリゴ\n(C) ジェイミー\n(D) ローラ\n(E) ヘルガ\n(F) メリッサ\n(G) オフィーリア", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは黄色のボール、デイブは紫色のボール、イヴは青色のボール、フレッドはオレンジ色のボール、ガートルードはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとガートルードがボールを交換します。続いてフレッドとガートルードがボールを交換します。その後ボブとフレッドがボールを交換します。さらにガートルードとイヴがボールを交換します。次にクレアとイヴがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 黄色のボール\n(D) 紫色のボール\n(E) 青色のボール\n(F) オレンジ色のボール\n(G) ピンク色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは紫色のプレゼント、クレアは白色のプレゼント、デイブは茶色のプレゼント、イヴは緑色のプレゼント、フレッドは青色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。続いてガートルードとアリスがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にフレッドとアリスがプレゼントを交換します。最後にフレッドとイヴがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 紫色のプレゼント\n(C) 白色のプレゼント\n(D) 茶色のプレゼント\n(E) 緑色のプレゼント\n(F) 青色のプレゼント\n(G) 黄色のプレゼント", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは青色のボール、デイブは茶色のボール、イヴは赤色のボール、フレッドは紫色のボール、ガートルードはピンク色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとイヴがボールを交換します。次にフレッドとボブがボールを交換します。続いてフレッドとイヴがボールを交換します。その後、アリスとガートルードがボールを交換します。さらにガートルードとクレアがボールを交換します。次にガートルードとデイブがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、フレッドが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 青色のボール\n(D) 茶色のボール\n(E) 赤色のボール\n(F) 紫色のボール\n(G) ピンク色のボール", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黄色のプレゼント、クレアは紫色のプレゼント、デイブは緑色のプレゼント、イヴは黒いボール、フレッドはピンク色のボール、ガートルードは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとフレッドがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。続いてクレアとガートルードがプレゼントを交換します。その後フレッドとクレアがプレゼントを交換します。さらにボブとフレッドがプレゼントを交換します。最後にガートルードとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黄色のプレゼント\n(C) 紫色のプレゼント\n(D) 緑色のプレゼント\n(E) 黒いボール\n(F) ピンク色のボール\n(G) 青色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブはオレンジ色のボール、クレアは黒色のボール、デイブは茶色のボール、イヴはピンク色のボール、フレッドは白色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとフレッドがボールを交換します。次にデイブとフレッドがボールを交換します。続いてイヴとガートルードがボールを交換します。その後デイブとクレアがボールを交換します。さらにクレアとボブがボールを交換します。次にデイブとアリスがボールを交換します。最後にボブとフレッドがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) 茶色のボール\n(E) ピンク色のボール\n(F) 白色のボール\n(G) 紫色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『キャッチ=22』、クレアは『指輪物語』、デイブは『ユリシーズ』、イヴは『フランケンシュタイン』、フレッドは『真珠』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずフレッドとアリスが本を交換します。次にガートルードとイヴが本を交換します。続いてアリスとイヴが本を交換します。その後デイブとガートルードが本を交換します。さらにガートルードとクレアが本を交換します。その後アリスとクレアが本を交換します。最後にデイブとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『キャッチ=22』\n(C) 『指輪物語』\n(D) 『ユリシーズ』\n(E) 『フランケンシュタイン』\n(F) 『真珠』\n(G) 『オデュッセイア』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはフォワード、ボブは右ウイング、クレアはセンターミッドフィールダー、デイブはチアリーダー、イヴは右ミッドフィールダー、フレッドは左ウイング、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとイヴがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてガートルードとアリスがポジションを交換します。その後デイブとボブがポジションを交換します。さらにクレアとアリスがポジションを交換します。その後ボブとアリスがポジションを交換します。最後にガートルードとイヴがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウイング\n(C) センターミッドフィールダー\n(D) チアリーダー\n(E) 右ミッドフィールダー\n(F) 左ウイング\n(G) 左ミッドフィールダー", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは緑色のプレゼント、クレアは赤色のプレゼント、デイブは黒いボール、イヴは青色のプレゼント、フレッドは紫色のプレゼント、ガートルードはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとイヴがプレゼントを交換します。次にアリスとガートルードがプレゼントを交換します。続いてアリスとクレアがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。さらにクレアとガートルードがプレゼントを交換します。最後にボブとガートルードがプレゼントを交換します。イベント終了時、フレッドが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 緑色のプレゼント\n(C) 赤色のプレゼント\n(D) 黒いボール\n(E) 青色のプレゼント\n(F) 紫色のプレゼント\n(G) ピンク色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれ以下のポジションに配置されています：アリスはベンチウォーマー、ボブはゴールキーパー、クレアはフォワード、デイブは右ミッドフィールダー、イヴはセンターミッドフィールダー、フレッドはチアリーダー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとクレアがポジションを交換します。次にデイブとフレッドがポジションを交換します。続いてクレアとフレッドがポジションを交換します。その後イヴとガートルードがポジションを交換します。さらにアリスとフレッドがポジションを交換します。次にデイブとフレッドがポジションを交換します。最後にデイブとボブがポジションを交換します。試合終了時、アリスが担当しているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) ゴールキーパー\n(C) フォワード\n(D) 右ミッドフィールダー\n(E) センターミッドフィールダー\n(F) チアリーダー\n(G) 左ミッドフィールダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは赤色のプレゼント、クレアは青色のプレゼント、デイブは茶色のプレゼント、イヴは黄色のプレゼント、フレッドは白色のプレゼント、ガートルードは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。続いてアリスとガートルードがプレゼントを交換します。その後クレアとガートルードがプレゼントを交換します。さらにアリスとイヴがプレゼントを交換します。次にフレッドとデイブがプレゼントを交換します。最後にクレアとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 赤色のプレゼント\n(C) 青色のプレゼント\n(D) 茶色のプレゼント\n(E) 黄色のプレゼント\n(F) 白色のプレゼント\n(G) 黒色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『白鯨』、ボブは『オデュッセイア』、クレアは『ユリシーズ』、デイブは『指輪物語』、イヴは『ロリータ』、フレッドは『真珠』、ガートルードは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとクレアが本を交換します。次にガートルードとフレッドが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとアリスが本を交換します。さらにガートルードとクレアが本を交換します。その後、ガートルードとボブが本を交換します。最後にボブとイヴが本を交換します。学期終了時、ガートルードが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『オデュッセイア』\n(C) 『ユリシーズ』\n(D) 『指輪物語』\n(E) 『ロリータ』\n(F) 『真珠』\n(G) 『キャッチ=22』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは黒色のボール、クレアはピンク色のボール、デイブは白色のボール、イヴは緑色のボール、フレッドは茶色のボール、ガートルードは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとクレアがボールを交換します。次にボブとガートルードがボールを交換します。続いてアリスとデイブがボールを交換します。その後フレッドとクレアがボールを交換します。さらにガートルードとクレアがボールを交換します。次にデイブとアリスがボールを交換します。最後にイヴとアリスがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 黒色のボール\n(C) ピンク色のボール\n(D) 白色のボール\n(E) 緑色のボール\n(F) 茶色のボール\n(G) 赤色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『指輪物語』、クレアは『キャッチ=22』、デイブは『ロリータ』、イヴは『フランケンシュタイン』、フレッドは『真珠』、ガートルードは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にイヴとアリスが本を交換します。続いてクレアとガートルードが本を交換します。その後デイブとフレッドが本を交換します。さらにガートルードとクレアが本を交換し、イヴとクレアが本を交換します。最後にガートルードとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『指輪物語』\n(C) 『キャッチ=22』\n(D) 『ロリータ』\n(E) 『フランケンシュタイン』\n(F) 『真珠』\n(G) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは白色のボール、デイブは緑色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとアリスがボールを交換します。次にアリスとフレッドがボールを交換します。続いてフレッドとデイブがボールを交換します。その後イヴとボブがボールを交換します。次にクレアとフレッドがボールを交換します。さらにボブとガートルードがボールを交換します。最後にガートルードとアリスがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 白色のボール\n(D) 緑色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『オデュッセイア』、イヴは『グレート・ギャツビー』、フレッドは『ロリータ』、ガートルードは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとアリスが本を交換します。続いてアリスとデイブが本を交換します。その後ガートルードとデイブが本を交換します。さらにアリスとボブが本を交換します。次にイヴとクレアが本を交換します。最後にアリスとフレッドが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『オデュッセイア』\n(E) 『グレート・ギャツビー』\n(F) 『ロリータ』\n(G) 『真珠』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはジェイミーと、クレアはサムと、デイブはイジーと、イヴはカールと、フレッドはオフィーリアと、ガートルードはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとガートルードがパートナーを交代します。次にガートルードとボブがパートナーを交代します。続いてデイブとイヴがパートナーを交代します。その後フレッドとボブがパートナーを交代します。さらにアリスとクレアがパートナーを交代します。次にボブとデイブがパートナーを交代します。最後にイヴとアリスがパートナーを交代します。ダンス終了時、フレッドは\n選択肢:\n(A) メリッサと踊っている\n(B) ジェイミーと踊っている\n(C) サムと踊っている\n(D) イジーと踊っている\n(E) カールと踊っている\n(F) オフィーリアと踊っている\n(G) ヘルガと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブはピンク色のボール、クレアはオレンジ色のボール、デイブは黄色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとアリスがボールを交換します。次にイヴとクレアがボールを交換します。続いてクレアとガートルードがボールを交換します。その後ボブとアリスがボールを交換します。さらにイヴとアリスがボールを交換します。次にデイブとアリスがボールを交換します。最後にデイブとフレッドがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) ピンク色のボール\n(C) オレンジ色のボール\n(D) 黄色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 紫色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはサムと、クレアはヘルガと、デイブはジェイミーと、イヴはロドリゴと、フレッドはオフィーリアと、ガートルードはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずガートルードとイヴがパートナーを交代します。次にフレッドとデイブがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後ガートルードとボブがパートナーを交代します。さらにアリスとクレアがパートナーを交代します。次にデイブとアリスがパートナーを交代します。最後にガートルードとクレアがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) イジー\n(B) サム\n(C) ヘルガ\n(D) ジェイミー\n(E) ロドリゴ\n(F) オフィーリア\n(G) メリッサ", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『ロリータ』、クレアは『バスカヴィル家の犬』、デイブは『白鯨』、イヴは『ユリシーズ』、フレッドは『フランケンシュタイン』、ガートルードは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずガートルードとデイブが本を交換します。次にフレッドとイヴが本を交換します。続いてガートルードとボブが本を交換します。その後クレアとアリスが本を交換します。さらにイヴとクレアが本を交換します。次にイヴとボブが本を交換します。最後にボブとアリスが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『ロリータ』\n(C) 『バスカヴィル家の犬』\n(D) 『白鯨』\n(E) 『ユリシーズ』\n(F) 『フランケンシュタイン』\n(G) 『指輪物語』", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは青色のプレゼント、ボブは黄色のプレゼント、クレアは赤色のプレゼント、デイブは黒色のボール、イヴは白色のプレゼント、フレッドは茶色のプレゼント、ガートルードはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとフレッドがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてデイブとフレッドがプレゼントを交換します。その後イヴとアリスがプレゼントを交換します。さらにボブとアリスがプレゼントを交換します。次にイヴとガートルードがプレゼントを交換します。最後にフレッドとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黄色のプレゼント\n(C) 赤色のプレゼント\n(D) 黒色のボール\n(E) 白色のプレゼント\n(F) 茶色のプレゼント\n(G) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは白色のプレゼント、クレアは紫色のプレゼント、デイブは黒色のボール、イヴは茶色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずガートルードとアリスがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてアリスとデイブがプレゼントを交換します。その後フレッドとデイブがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にクレアとガートルードがプレゼントを交換します。最後にガートルードとデイブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 白色のプレゼント\n(C) 紫色のプレゼント\n(D) 黒色のボール\n(E) 茶色のプレゼント\n(F) オレンジ色のボール\n(G) 黄色のプレゼント", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブはサポーター、クレアはディフェンダー、デイブはベンチウォーマー、イヴは左ウィング、フレッドはセンターミッドフィールダー、ガートルードは右ウィングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとアリスがポジションを交代します。次にアリスとボブがポジションを交代します。続いてフレッドとアリスがポジションを交代します。その後ガートルードとデイブがポジションを交代します。さらにアリスとイヴがポジションを交代します。次にクレアとボブがポジションを交代します。最後にフレッドとアリスがポジションを交代します。試合終了時、フレッドが担当しているポジションは\n選択肢:\n(A) フォワード\n(B) サポーター\n(C) ディフェンダー\n(D) ベンチウォーマー\n(E) 左ウィング\n(F) センターミッドフィールダー\n(G) 右ウィング", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『指輪物語』、デイブは『キャッチ=22』、イヴは『オデュッセイア』、フレッドは『白鯨』、ガートルードは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとガートルードが本を交換します。次にボブとイヴが本を交換します。続いてアリスとガートルードが本を交換します。その後クレアとイヴが本を交換します。さらにイヴとアリスが本を交換します。次にフレッドとアリスが本を交換します。最後にイヴとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『指輪物語』\n(D) 『キャッチ=22』\n(E) 『オデュッセイア』\n(F) 『白鯨』\n(G) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはヘルガと、クレアはジェイミーと、デイブはパトリックと、イヴはオフィーリアと、フレッドはロドリゴと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとボブがパートナーを交代します。次にイヴとクレアがパートナーを交代します。続いてクレアとガートルードがパートナーを交代します。その後アリスとイヴがパートナーを交代し、続いてガートルードとアリスがパートナーを交代します。さらにイヴとフレッドがパートナーを交代し、最後にガートルードとクレアがパートナーを交代します。ダンスが終わる時点で、フレッドは\n選択肢:\n(A) サムと踊っている\n(B) ヘルガと踊っている\n(C) ジェイミーと踊っている\n(D) パトリックと踊っている\n(E) オフィーリアと踊っている\n(F) ロドリゴと踊っている\n(G) カールと踊っている", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは赤色のボール、デイブは黄色のボール、イヴは紫色のボール、フレッドは青色のボール、ガートルードは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとアリスがボールを交換します。次にイヴとフレッドがボールを交換します。続いてガートルードとフレッドがボールを交換します。その後クレアとイヴがボールを交換します。さらにボブとデイブがボールを交換します。次にデイブとイヴがボールを交換します。最後にガートルードとクレアがボールを交換します。ゲーム終了時、ガートルードが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 赤色のボール\n(D) 黄色のボール\n(E) 紫色のボール\n(F) 青色のボール\n(G) 緑色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブはフォワード、クレアは左ウィング、デイブはチアリーダー、イヴはフルバック、フレッドは右ウィング、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にガートルードとボブがポジションを交換します。続いてイヴとアリスがポジションを交換します。その後クレアとフレッドがポジションを交換します。さらにガートルードとデイブがポジションを交換します。その後イヴとフレッドがポジションを交換します。最後にフレッドとボブがポジションを交換します。試合終了時、フレッドがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) フォワード\n(C) 左ウィング\n(D) チアリーダー\n(E) フルバック\n(F) 右ウィング\n(G) ベンチウォーマー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『フランケンシュタイン』、デイブは『白鯨』、イヴは『ユリシーズ』、フレッドは『真珠』、ガートルードは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとイヴが本を交換します。次にデイブとフレッドが本を交換します。続いてガートルードとボブが本を交換します。その後アリスとクレアが本を交換します。さらにフレッドとクレアが本を交換します。次にボブとガートルードが本を交換します。最後にクレアとフレッドが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『フランケンシュタイン』\n(D) 『白鯨』\n(E) 『ユリシーズ』\n(F) 『真珠』\n(G) 『オデュッセイア』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブはオレンジ色のボール、クレアは黒色のボール、デイブはピンク色のボール、イヴは紫色のプレゼント、フレッドは緑色のプレゼント、ガートルードは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。さらにフレッドとイヴがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。最後にフレッドとガートルードがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) オレンジ色のボール\n(C) 黒色のボール\n(D) ピンク色のボール\n(E) 紫色のプレゼント\n(F) 緑色のプレゼント\n(G) 茶色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはセンターミッドフィールダー、ボブは右ウイング、クレアは右ミッドフィールダー、デイブはベンチウォーマー、イヴはチアリーダー、フレッドはゴールキーパー、ガートルードは左ウイングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずフレッドとボブがポジションを交代します。次にボブとクレアがポジションを交換します。続いてアリスとイヴがポジションを交換します。その後デイブとクレアがポジションを交換します。さらにフレッドとアリスがポジションを交換します。その後ボブとフレッドがポジションを交換します。最後にアリスとガートルードがポジションを交換します。試合終了時、デイブが担当しているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 右ウイング\n(C) 右ミッドフィールダー\n(D) ベンチウォーマー\n(E) チアリーダー\n(F) ゴールキーパー\n(G) 左ウイング", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは緑色のプレゼント、クレアは白色のプレゼント、デイブはオレンジ色のボール、イヴはピンク色のボール、フレッドは黄色のプレゼント、ガートルードは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にガートルードとイヴがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。さらにガートルードとクレアがプレゼントを交換します。次にアリスとガートルードがプレゼントを交換します。最後にイヴとフレッドがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 緑色のプレゼント\n(C) 白色のプレゼント\n(D) オレンジ色のボール\n(E) ピンク色のボール\n(F) 黄色のプレゼント\n(G) 赤色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはメリッサと、クレアはジェイミーと、デイブはロドリゴと、イヴはサムと、フレッドはカールと、ガートルードはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとクレアがパートナーを交代します。次にクレアとガートルードがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後フレッドとイヴがパートナーを交代します。さらにデイブとフレッドがパートナーを交代します。次にクレアとフレッドがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、イヴは\n選択肢:\n(A) イジー\n(B) メリッサ\n(C) ジェイミー\n(D) ロドリゴ\n(E) サム\n(F) カール\n(G) ローラ\nと踊っています。", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは青色のプレゼント、ボブはピンク色のボール、クレアは茶色のプレゼント、デイブは黒色のボール、イヴは紫色のプレゼント、フレッドは赤色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとデイブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。続いてボブとガートルードがプレゼントを交換します。その後ガートルードとフレッドがプレゼントを交換します。さらにデイブとガートルードが交換し、最後にアリスとクレアが交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) ピンク色のボール\n(C) 茶色のプレゼント\n(D) 黒色のボール\n(E) 紫色のプレゼント\n(F) 赤色のプレゼント\n(G) 黄色のプレゼント", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはヘルガと、デイブはイジーと、イヴはロドリゴと、フレッドはサムと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にイヴとフレッドがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。その後イヴとアリスがパートナーを交代します。さらにアリスとガートルードがパートナーを交代します。次にデイブとイヴがパートナーを交代します。最後にガートルードとアリスがパートナーを交代します。ダンスが終わる時点で、クレアは\n選択肢:\n(A) ローラ\n(B) メリッサ\n(C) ヘルガ\n(D) イジー\n(E) ロドリゴ\n(F) サム\n(G) パトリック\nと踊っています。", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはオフィーリアと、クレアはパトリックと、デイブはカールと、イヴはローラと、フレッドはメリッサと、ガートルードはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にガートルードとフレッドがパートナーを交代します。続いてフレッドとボブがパートナーを交代します。その後イヴとボブがパートナーを交代します。さらにガートルードとアリスがパートナーを交代します。その後フレッドとクレアがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンス終了時、イヴのパートナーは\n選択肢:\n(A) ジェイミー\n(B) オフィーリア\n(C) パトリック\n(D) カール\n(E) ローラ\n(F) メリッサ\n(G) ヘルガ", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『真珠』、ボブは『オデュッセイア』、クレアは『フランケンシュタイン』、デイブは『指輪物語』、イヴは『バスカヴィル家の犬』、フレッドは『ロリータ』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にデイブとクレアが本を交換します。続いてフレッドとアリスが本を交換します。その後ボブとフレッドが本を交換します。さらにイヴとボブが本を交換します。次にデイブとクレアが本を交換します。最後にガートルードとアリスが本を交換します。学期終了時、フレッドが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『オデュッセイア』\n(C) 『フランケンシュタイン』\n(D) 『指輪物語』\n(E) 『バスカヴィル家の犬』\n(F) 『ロリータ』\n(G) 『白鯨』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブはフルバック、クレアはセンターミッドフィールダー、デイブは右ウィング、イヴはベンチウォーマー、フレッドはチアリーダー、ガートルードは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交代します。次にデイブとイヴがポジションを交代します。続いてフレッドとボブがポジションを交代します。その後、アリスとイヴがポジションを交代します。さらにクレアとフレッドがポジションを交代します。そしてクレアとボブがポジションを交代します。最後にボブとガートルードがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) フルバック\n(C) センターミッドフィールダー\n(D) 右ウィング\n(E) ベンチウォーマー\n(F) チアリーダー\n(G) 左ミッドフィールダー", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはイジーと、デイブはロドリゴと、イヴはカールと、フレッドはローラと、ガートルードはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとボブがパートナーを交代します。次にクレアとボブがパートナーを交代します。続いてイヴとボブがパートナーを交代します。その後ガートルードとボブがパートナーを交代します。さらにクレアとデイブがパートナーを交代します。そしてアリスとガートルードがパートナーを交代します。最後にボブとフレッドがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) メリッサ\n(B) サム\n(C) イジー\n(D) ロドリゴ\n(E) カール\n(F) ローラ\n(G) パトリック\nと踊っています。", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブは右ウィング、クレアは左ウィング、デイブはベンチウォーマー、イヴはゴールキーパー、フレッドはセンターミッドフィールダー、ガートルードはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にガートルードとアリスがポジションを交換します。続いてフレッドとボブがポジションを交換します。その後デイブとフレッドがポジションを交換し、さらにフレッドとボブが交換します。最後にボブとイヴがポジションを交換し、最終的にクレアとアリスが交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウィング\n(C) 左ウィング\n(D) ベンチウォーマー\n(E) ゴールキーパー\n(F) センターミッドフィールダー\n(G) チアリーダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブはフルバック、クレアはセンターミッドフィールダー、デイブは左ミッドフィールダー、イヴはフォワード、フレッドはチアリーダー、ガートルードはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとボブがポジションを交代します。次にイヴとアリスがポジションを交換します。続いてガートルードとデイブがポジションを交換します。その後デイブとフレッドがポジションを交換します。さらにクレアとイヴがポジションを交換します。その後フレッドとガートルードがポジションを交換します。最後にフレッドとクレアがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) フルバック\n(C) センターミッドフィールダー\n(D) 左ミッドフィールダー\n(E) フォワード\n(F) チアリーダー\n(G) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは茶色のボール、クレアはオレンジ色のボール、デイブは赤色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にガートルードとイヴがボールを交換します。続いてボブとフレッドがボールを交換します。その後クレアとフレッドがボールを交換します。さらにアリスとクレアがボールを交換します。次にイヴとフレッドがボールを交換します。最後にイヴとデイブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 茶色のボール\n(C) オレンジ色のボール\n(D) 赤色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『ロリータ』、デイブは『バスカヴィル家の犬』、イヴは『真珠』、フレッドは『グレート・ギャツビー』、ガートルードは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとボブが本を交換します。次にフレッドとガートルードが本を交換します。続いてクレアとフレッドが本を交換します。その後デイブとイヴが本を交換します。さらにガートルードとクレアが本を交換します。そしてアリスとガートルードが本を交換します。最後にクレアとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『ロリータ』\n(D) 『バスカヴィル家の犬』\n(E) 『真珠』\n(F) 『グレート・ギャツビー』\n(G) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは赤色のボール、フレッドは緑色のボール、ガートルードは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとイヴがボールを交換します。次にデイブとフレッドがボールを交換します。続いてクレアとフレッドがボールを交換します。その後イヴとボブがボールを交換します。さらにクレアとアリスがボールを交換します。次にガートルードとイヴが再びボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、フレッドが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 赤色のボール\n(F) 緑色のボール\n(G) 茶色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブはピンク色のボール、クレアは茶色のボール、デイブは黒色のボール、イヴは黄色のボール、フレッドはオレンジ色のボール、ガートルードは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずガートルードとボブがボールを交換します。次にデイブとボブがボールを交換します。続いてボブとクレアがボールを交換します。その後デイブとフレッドがボールを交換します。さらにガートルードとデイブがボールを交換します。次にボブとクレアがボールを交換します。最後にイヴとアリスがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) ピンク色のボール\n(C) 茶色のボール\n(D) 黒色のボール\n(E) 黄色のボール\n(F) オレンジ色のボール\n(G) 赤色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはカールと、クレアはイジーと、デイブはジェイミーと、イヴはヘルガと、フレッドはロドリゴと、ガートルードはオフェリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にアリスとフレッドがパートナーを交代します。続いてガートルードとデイブがパートナーを交代します。その後イヴとボブがパートナーを交代し、さらにイヴとフレッドがパートナーを交代します。最後にボブとクレアがパートナーを交代し、最終的にフレッドとガートルードがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) サム\n(B) カール\n(C) イジー\n(D) ジェイミー\n(E) ヘルガ\n(F) ロドリゴ\n(G) オフェリア", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黒色のボール、クレアは紫色のプレゼント、デイブはピンク色のボール、イヴは緑色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にイヴとフレッドがプレゼントを交換します。続いてボブとアリスが再びプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。さらにボブとフレッドがプレゼントを交換します。最後にクレアとガートルードがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黒色のボール\n(C) 紫色のプレゼント\n(D) ピンク色のボール\n(E) 緑色のプレゼント\n(F) オレンジ色のボール\n(G) 黄色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『ユリシーズ』、クレアは『グレート・ギャツビー』、デイブは『オデュッセイア』、イヴは『指輪物語』、フレッドは『キャッチ=22』、ガートルードは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとガートルードが本を交換します。次にフレッドとデイブが本を交換します。続いてアリスとボブが本を交換します。その後イヴとガートルードが本を交換します。さらにデイブとボブが本を交換します。次にフレッドとイヴが本を交換します。最後にボブとフレッドが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『ユリシーズ』\n(C) 『グレート・ギャツビー』\n(D) 『オデュッセイア』\n(E) 『指輪物語』\n(F) 『キャッチ=22』\n(G) 『白鯨』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人がゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは白色のボール、デイブは緑色のボール、イヴは青色のボール、フレッドは黒色のボール、ガートルードは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとアリスがボールを交換します。次にアリスとフレッドがボールを交換します。続いてフレッドとデイブがボールを交換します。その後イヴとボブがボールを交換します。次にクレアとフレッドがボールを交換します。続いてボブとガートルードがボールを交換します。最後にガートルードとアリスがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 白色のボール\n(D) 緑色のボール\n(E) 青色のボール\n(F) 黒色のボール\n(G) 黄色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーにはポジションが割り当てられています：アリスはフォワード、ボブはゴールキーパー、クレアは左ウィング、デイブはベンチウォーマー、イヴはセンターミッドフィールダー、フレッドはサイドバック、ガートルードはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとフレッドがポジションを交代します。次にクレアとガートルードがポジションを交代します。続いてデイブとアリスがポジションを交代します。その後ボブとデイブがポジションを交代します。さらにボブとイヴがポジションを交代します。次にイヴとアリスがポジションを交代します。最後にガートルードとデイブがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ゴールキーパー\n(C) 左ウィング\n(D) ベンチウォーマー\n(E) センターミッドフィールダー\n(F) サイドバック\n(G) チアリーダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黄色のプレゼント、クレアは赤色のプレゼント、デイブは白色のプレゼント、イヴはピンク色のボール、フレッドは青色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとイヴがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。続いてボブとガートルードがプレゼントを交換します。その後フレッドとデイブがプレゼントを交換します。さらにボブとガートルードが交換し、最後にデイブとガートルードが交換します。イベント終了時、ガートルードが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黄色のプレゼント\n(C) 赤色のプレゼント\n(D) 白色のプレゼント\n(E) ピンク色のボール\n(F) 青色のプレゼント\n(G) 紫色のプレゼント", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはゴールキーパー、クレアは右ウィンガー、デイブは左ウィンガー、イヴはフォワード、フレッドはベンチウォーマー、ガートルードはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとイヴがポジションを交換します。次にフレッドとクレアがポジションを交換します。続いてクレアとアリスがポジションを交換します。その後デイブとボブがポジションを交換し、続いてアリスとボブがポジションを交換します。さらにデイブとボブがポジションを交換し、最後にボブとアリスがポジションを交換します。試合終了時、ボブが担当しているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) ゴールキーパー\n(C) 右ウィンガー\n(D) 左ウィンガー\n(E) フォワード\n(F) ベンチウォーマー\n(G) チアリーダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『ユリシーズ』、クレアは『バスカヴィル家の犬』、デイブは『キャッチ=22』、イヴは『グレート・ギャツビー』、フレッドは『フランケンシュタイン』、ガートルードは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとボブが本を交換します。次にデイブとガートルードが本を交換します。続いてボブとデイブが本を交換します。その後ボブとクレアが本を交換します。さらにフレッドとクレアが本を交換します。そしてアリスとクレアが本を交換します。最後にクレアとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『ユリシーズ』\n(C) 『バスカヴィル家の犬』\n(D) 『キャッチ=22』\n(E) 『グレート・ギャツビー』\n(F) 『フランケンシュタイン』\n(G) 『ロリータ』", "target": "(F)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはジェイミーと、クレアはパトリックと、デイブはローラと、イヴはイジーと、フレッドはメリッサと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずフレッドとボブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてアリスとガートルードがパートナーを交代します。その後ボブとガートルードがパートナーを交代します。さらにフレッドとアリスがパートナーを交代します。次にフレッドとクレアがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) ジェイミー\n(C) パトリック\n(D) ローラ\n(E) イジー\n(F) メリッサ\n(G) カール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアはオレンジ色のボール、デイブは茶色のプレゼント、イヴは黒色のボール、フレッドは黄色のプレゼント、ガートルードは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずフレッドとガートルードがプレゼントを交換します。次にフレッドとイヴがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後クレアとガートルードがプレゼントを交換します。さらにデイブとイヴがプレゼントを交換します。最後にアリスとフレッドがプレゼントを交換し、その後アリスとボブがプレゼントを交換します。イベント終了時、フレッドが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) オレンジ色のボール\n(D) 茶色のプレゼント\n(E) 黒色のボール\n(F) 黄色のプレゼント\n(G) 紫色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人がホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは茶色のプレゼント、クレアは赤色のプレゼント、デイブは青色のプレゼント、イヴは白色のプレゼント、フレッドはオレンジ色のボール、ガートルードは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。続いてフレッドとガートルードがプレゼントを交換します。その後イヴとガートルードがプレゼントを交換します。さらにイヴとアリスがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。最後にガートルードとデイブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のプレゼント\n(C) 赤色のプレゼント\n(D) 青色のプレゼント\n(E) 白色のプレゼント\n(F) オレンジ色のボール\n(G) 黒色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはイジーと、クレアはメリッサと、デイブはローラと、イヴはヘルガと、フレッドはオフィーリアと、ガートルードはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてデイブとフレッドがパートナーを交代します。その後ガートルードとイヴがパートナーを交代します。さらにイヴとデイブがパートナーを交代します。次にガートルードとデイブがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、フレッドは\n選択肢:\n(A) サムと\n(B) イジーと\n(C) メリッサと\n(D) ローラと\n(E) ヘルガと\n(F) オフィーリアと\n(G) カールと\n踊っています。", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードはスクエアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはオフィーリアと、クレアはパトリックと、デイブはジェイミーと、イヴはローラと、フレッドはヘルガと、ガートルードはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとフレッドがパートナーを交代します。次にガートルードとイヴがパートナーを交代します。続いてガートルードとアリスがパートナーを交代します。その後ボブとアリスがパートナーを交代します。さらにデイブとフレッドがパートナーを交代します。次にイヴとアリスがパートナーを交代します。最後にイヴとクレアがパートナーを交代します。ダンスが終了する時点で、アリスは\n選択肢:\n(A) メリッサと踊っている\n(B) オフィーリアと踊っている\n(C) パトリックと踊っている\n(D) ジェイミーと踊っている\n(E) ローラと踊っている\n(F) ヘルガと踊っている\n(G) イジーと踊っている", "target": "(G)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『ロリータ』、デイブは『ユリシーズ』、イヴは『指輪物語』、フレッドは『白鯨』、ガートルードは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとフレッドが本を交換します。次にデイブとアリスが本を交換します。続いてガートルードとクレアが本を交換します。その後ボブとクレアが本を交換し、続いてアリスとクレアが本を交換します。さらにイヴとアリスが本を交換し、最後にアリスとガートルードが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『ロリータ』\n(D) 『ユリシーズ』\n(E) 『指輪物語』\n(F) 『白鯨』\n(G) 『キャッチ=22』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの6人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは左ミッドフィールダー、ボブはチアリーダー、クレアは右ウィンガー、デイブはストライカー、イヴはセンターミッドフィールダー、フレッドはフルバック、ガートルードはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずガートルードとアリスがポジションを交換します。次にデイブとガートルードがポジションを交換します。続いてアリスとガートルードがポジションを交換します。その後イヴとクレアがポジションを交換します。さらにイヴとボブがポジションを交換します。次にクレアとガートルードがポジションを交換します。最後にフレッドとアリスがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) チアリーダー\n(C) 右ウィンガー\n(D) ストライカー\n(E) センターミッドフィールダー\n(F) フルバック\n(G) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴ、フレッド、ガートルードの7人が白象ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは紫色のプレゼント、クレアは白色のプレゼント、デイブは茶色のプレゼント、イヴは緑色のプレゼント、フレッドは青色のプレゼント、ガートルードは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとボブがプレゼントを交換します。次にアリスとボブがプレゼントを交換します。続いてガートルードとアリスがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。さらにボブとデイブがプレゼントを交換します。次にフレッドとアリスがプレゼントを交換します。最後にフレッドとイヴがプレゼントを交換します。イベント終了時、フレッドが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 紫色のプレゼント\n(C) 白色のプレゼント\n(D) 茶色のプレゼント\n(E) 緑色のプレゼント\n(F) 青色のプレゼント\n(G) 黄色のプレゼント", "target": "(E)"}
