{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはサムと、クレアはジェイミーと、デイブはローラと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にデイブとアリスがパートナーを交代します。続いてイヴとアリスがパートナーを交代します。その後クレアとボブがパートナーを交代します。最後にデイブとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) パトリック\n(B) サム\n(C) ジェイミー\n(D) ローラ\n(E) メリッサ", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはジェイミーと、クレアはメリッサと、デイブはロドリゴと、イヴはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にクレアとイヴがパートナーを交代します。再びクレアとボブがパートナーを交代します。その後イヴとデイブがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンス終了時、アリスは\n選択肢:\n(A) オフィーリアと踊っている\n(B) ジェイミーと踊っている\n(C) メリッサと踊っている\n(D) ロドリゴと踊っている\n(E) パトリックと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはローラと、クレアはイジーと、デイブはロドリゴと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとイヴがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後デイブとクレアがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ジェイミー\n(B) ローラ\n(C) イジー\n(D) ロドリゴ\n(E) オフィーリア", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『バスカヴィル家の犬』、クレアは『フランケンシュタイン』、デイブは『真珠』、イヴは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にアリスとクレアが本を交換します。続いてアリスとボブが本を交換します。その後、デイブとアリスが本を交換します。最後にデイブとクレアが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『バスカヴィル家の犬』\n(C) 『フランケンシュタイン』\n(D) 『真珠』\n(E) 『指輪物語』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『白鯨』、ボブは『ユリシーズ』、クレアは『指輪物語』、デイブは『ロリータ』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとデイブが本を交換します。続いてデイブとアリスが本を交換します。その後デイブとボブが本を交換します。最後にイヴとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『ユリシーズ』\n(C) 『指輪物語』\n(D) 『ロリータ』\n(E) 『キャッチ=22』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはゴールキーパー、ボブは左ミッドフィールダー、クレアは右ウイング、デイブはフォワード、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとクレアがポジションを交換します。次にアリスとボブがポジションを交換します。続いてデイブとボブがポジションを交換します。その後、ボブとイヴがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ミッドフィールダー\n(C) 右ウイング\n(D) フォワード\n(E) センターミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはジェイミーと、クレアはオフィーリアと、デイブはカールと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてクレアとボブがパートナーを交代します。その後デイブとアリスがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンス終了時、クレアのパートナーは\n選択肢:\n(A) ヘルガ\n(B) ジェイミー\n(C) オフィーリア\n(D) カール\n(E) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは紫色のプレゼント、クレアは青色のプレゼント、デイブは黒色のボール、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。続いてボブとイヴがプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。最後にアリスとイヴがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 紫色のプレゼント\n(C) 青色のプレゼント\n(D) 黒色のボール\n(E) 白色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとイヴが本を交換します。続いてデイブとクレアが本を交換します。その後デイブとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはベンチウォーマー、ボブは左ミッドフィールダー、クレアは左ウイング、デイブはセンターミッドフィールダー、イヴはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとデイブがポジションを交換します。次にデイブとアリスがポジションを交換します。続いてクレアとボブがポジションを交換します。その後ボブとイヴがポジションを交換します。最後にアリスとデイブがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) 左ミッドフィールダー\n(C) 左ウイング\n(D) センターミッドフィールダー\n(E) フォワード", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは黒色のボール、クレアは青色のボール、デイブは黄色のボール、イヴは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとイヴがボールを交換します。次にアリスとボブがボールを交換します。続いてイヴとデイブがボールを交換します。その後クレアとデイブがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 黒色のボール\n(C) 青色のボール\n(D) 黄色のボール\n(E) 茶色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブはピンク色のボール、イヴは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとクレアがボールを交換します。その後デイブとクレアがボールを交換します。最後にアリスとデイブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) ピンク色のボール\n(E) 青色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはジェイミーと、クレアはメリッサと、デイブはローラと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてボブとアリスがパートナーを交代します。その後クレアとイヴがパートナーを交代します。最後にイヴとアリスがパートナーを交代します。ダンス終了時、クレアのパートナーは\n選択肢:\n(A) カール\n(B) ジェイミー\n(C) メリッサ\n(D) ローラ\n(E) オフィーリア", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブはベンチウォーマー、クレアは右ミッドフィールダー、デイブはゴールキーパー、イヴはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとアリスがポジションを交換します。次にデイブとクレアがポジションを交換します。続いてアリスとクレアがポジションを交換します。その後イヴとアリスがポジションを交換します。最後にデイブとボブがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) 右ウィング\n(B) ベンチウォーマー\n(C) 右ミッドフィールダー\n(D) ゴールキーパー\n(E) チアリーダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはイジーと、クレアはローラと、デイブはサムと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にクレアとイヴがパートナーを交代します。続いてボブとデイブがパートナーを交代します。その後クレアとイヴが再びパートナーを交代します。最後にアリスとイヴがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) オフィーリアと踊っている\n(B) イジーと踊っている\n(C) ローラと踊っている\n(D) サムと踊っている\n(E) メリッサと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは茶色のボール、クレアは黒色のボール、デイブはオレンジ色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にデイブとボブがボールを交換します。続いてイヴとボブがボールを交換します。その後、ボブとアリスがボールを交換します。最後にイヴとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のボール\n(C) 黒色のボール\n(D) オレンジ色のボール\n(E) 黄色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはゴールキーパー、クレアは右ウィンガー、デイブはフルバック、イヴは右ミッドフィールダーです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずクレアとアリスがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてボブとクレアがポジションを交換します。その後イヴとアリスがポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) ゴールキーパー\n(C) 右ウィンガー\n(D) フルバック\n(E) 右ミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『指輪物語』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にデイブとイヴが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとイヴが再び本を交換します。最後にクレアとデイブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『指輪物語』\n(E) 『キャッチ=22』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブはゴールキーパー、クレアはベンチウォーマー、デイブはセンターミッドフィールダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずクレアとイヴがポジションを交換します。次にクレアとアリスがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後ボブとイヴがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) ゴールキーパー\n(C) ベンチウォーマー\n(D) センターミッドフィールダー\n(E) 左ミッドフィールダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブはオレンジ色のボール、クレアは紫色のプレゼント、デイブは黄色のプレゼント、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとイヴがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後再びボブとイヴがプレゼントを交換します。最後にアリスとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) オレンジ色のボール\n(C) 紫色のプレゼント\n(D) 黄色のプレゼント\n(E) 白色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『真珠』、デイブは『オデュッセイア』、イヴは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてクレアとボブが本を交換します。その後デイブとクレアが本を交換します。最後にボブとデイブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『真珠』\n(D) 『オデュッセイア』\n(E) 『指輪物語』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『白鯨』、ボブは『ロリータ』、クレアは『グレート・ギャツビー』、デイブは『キャッチ=22』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとデイブが本を交換します。次にボブとクレアが本を交換します。続いてデイブとアリスが本を交換します。その後デイブとクレアが再び本を交換します。最後にクレアとイヴが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『ロリータ』\n(C) 『グレート・ギャツビー』\n(D) 『キャッチ=22』\n(E) 『ユリシーズ』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『フランケンシュタイン』、ボブは『ユリシーズ』、クレアは『ロリータ』、デイブは『オデュッセイア』、イヴは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとデイブが本を交換します。次にクレアとアリスが本を交換します。続いてデイブとイヴが本を交換します。その後ボブとクレアが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『ユリシーズ』\n(C) 『ロリータ』\n(D) 『オデュッセイア』\n(E) 『指輪物語』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは紫色のボール、クレアは黒色のボール、デイブは緑色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にボブとアリスがボールを交換します。続いてイヴとデイブがボールを交換します。その後デイブとクレアがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 紫色のボール\n(C) 黒色のボール\n(D) 緑色のボール\n(E) 黄色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはローラと、クレアはオフィーリアと、デイブはメリッサと、イヴはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとデイブがパートナーを交代します。次にアリスとクレアがパートナーを交代します。続いてアリスとイヴがパートナーを交代します。その後ボブとデイブがパートナーを交代します。最後にデイブとクレアがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) カール\n(B) ローラ\n(C) オフィーリア\n(D) メリッサ\n(E) サム", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはゴールキーパー、ボブは左ウイング、クレアはベンチウォーマー、デイブはチアリーダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとアリスがポジションを交換します。次にボブとイヴがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後ボブとイヴが再びポジションを交換します。最後にイヴとクレアがポジションを交換します。試合終了時、ボブが担当しているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ウイング\n(C) ベンチウォーマー\n(D) チアリーダー\n(E) 左ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは赤色のプレゼント、クレアは緑色のプレゼント、デイブはオレンジ色のボール、イヴは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 赤色のプレゼント\n(C) 緑色のプレゼント\n(D) オレンジ色のボール\n(E) 黒色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブは右ミッドフィールダー、クレアはチアリーダー、デイブはフォワード、イヴは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとイヴがポジションを交換します。次にクレアとアリスがポジションを交換します。続いてイヴとアリスがポジションを交換します。その後ボブとデイブがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) 右ミッドフィールダー\n(C) チアリーダー\n(D) フォワード\n(E) 左ウィンガー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは紫色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブは黄色のボール、イヴは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとデイブがボールを交換します。次にデイブとイヴがボールを交換します。続いてボブとデイブがボールを交換します。その後デイブとクレアがボールを交換します。最後にイヴとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 紫色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) 黄色のボール\n(E) 茶色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブは左ミッドフィールダー、クレアは右ミッドフィールダー、デイブはフォワード、イヴはフルバックです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にデイブとボブがポジションを交換します。続いてイヴとデイブがポジションを交換します。その後、アリスとクレアがポジションを交換します。最後にボブとイヴがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) 左ミッドフィールダー\n(C) 右ミッドフィールダー\n(D) フォワード\n(E) フルバック", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはパトリックと、クレアはカールと、デイブはヘルガと、イヴはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンス終了時、イヴのパートナーは\n選択肢:\n(A) ジェイミー\n(B) パトリック\n(C) カール\n(D) ヘルガ\n(E) イジー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『指輪物語』、クレアは『ロリータ』、デイブは『フランケンシュタイン』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にアリスとデイブが本を交換します。続いてアリスとクレアが本を交換します。その後ボブとイヴが本を交換します。最後にアリスとデイブが再び本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『指輪物語』\n(C) 『ロリータ』\n(D) 『フランケンシュタイン』\n(E) 『オデュッセイア』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黒色のボール、クレアは緑色のプレゼント、デイブは紫色のプレゼント、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとクレアがプレゼントを交換します。その後、デイブとボブが再びプレゼントを交換します。最後にアリスとデイブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黒色のボール\n(C) 緑色のプレゼント\n(D) 紫色のプレゼント\n(E) 黄色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはサムと、デイブはカールと、イヴはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとアリスがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてアリスとデイブがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にボブとアリスがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ローラと踊っている\n(B) メリッサと踊っている\n(C) サムと踊っている\n(D) カールと踊っている\n(E) ヘルガと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黄色のプレゼント、クレアは黒色のボール、デイブは紫色のプレゼント、イヴは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。最後にイヴとデイブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黄色のプレゼント\n(C) 黒色のボール\n(D) 紫色のプレゼント\n(E) 赤色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『真珠』、デイブは『オデュッセイア』、イヴは『指輪物語』を手に入れます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてクレアとボブが本を交換します。その後デイブとクレアが本を交換します。最後にボブとデイブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『真珠』\n(D) 『オデュッセイア』\n(E) 『指輪物語』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは青色のボール、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にデイブとボブがボールを交換します。続いてデイブとアリスがボールを交換します。その後イヴとクレアがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 青色のボール\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 白色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間であり、時折本を交換しています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『バスカヴィル家の犬』、デイブは『ユリシーズ』、イヴは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとクレアが本を交換します。次にボブとクレアが本を交換します。続いてクレアとイヴが本を交換します。その後ボブとクレアが再び本を交換します。最後にアリスとクレアが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『バスカヴィル家の犬』\n(D) 『ユリシーズ』\n(E) 『グレート・ギャツビー』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黄色のプレゼント、クレアはオレンジ色のボール、デイブは白色のプレゼント、イヴは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとデイブがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてボブとデイブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。最後にイヴとアリスがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黄色のプレゼント\n(C) オレンジ色のボール\n(D) 白色のプレゼント\n(E) 茶色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『真珠』、クレアは『ユリシーズ』、デイブは『バスカヴィル家の犬』、イヴは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとクレアが本を交換します。次にクレアとイヴが本を交換します。続いてアリスとクレアが本を交換します。その後クレアとボブが本を交換します。最後にデイブとイヴが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『真珠』\n(C) 『ユリシーズ』\n(D) 『バスカヴィル家の犬』\n(E) 『白鯨』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアはピンク色のボール、デイブは白色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとデイブがボールを交換します。次にボブとクレアがボールを交換します。続いてクレアとデイブがボールを交換します。その後デイブとボブがボールを交換します。最後にアリスとイヴがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) ピンク色のボール\n(D) 白色のボール\n(E) 赤色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『白鯨』、ボブは『ユリシーズ』、クレアは『指輪物語』、デイブは『ロリータ』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとデイブが本を交換します。続いてデイブとアリスが本を交換します。その後デイブとボブが本を交換します。最後にイヴとデイブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『ユリシーズ』\n(C) 『指輪物語』\n(D) 『ロリータ』\n(E) 『キャッチ=22』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブはフルバック、クレアはゴールキーパー、デイブは左ウィング、イヴは右ウィングを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にアリスとデイブがポジションを交換します。続いてクレアとボブがポジションを交換します。その後イヴとアリスがポジションを交換し、最後にクレアとイヴがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) フルバック\n(C) ゴールキーパー\n(D) 左ウィング\n(E) 右ウィング", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『キャッチ=22』、デイブは『グレート・ギャツビー』、イヴは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとイヴが本を交換します。次にクレアとイヴが本を交換します。続いてアリスとイヴが再び本を交換します。その後、イヴとデイブが本を交換します。最後にアリスとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『キャッチ=22』\n(D) 『グレート・ギャツビー』\n(E) 『ロリータ』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはロドリゴと、クレアはメリッサと、デイブはパトリックと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてデイブとイヴがパートナーを交代します。その後イヴとクレアがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) ヘルガ\n(B) ロドリゴ\n(C) メリッサ\n(D) パトリック\n(E) ジェイミー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとボブがボールを交換します。続いてクレアとボブがボールを交換します。その後ボブとアリスがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) オレンジ色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはジェイミーと、クレアはサムと、デイブはメリッサと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとデイブがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後ボブとアリスがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) オフィーリアと踊っている\n(B) ジェイミーと踊っている\n(C) サムと踊っている\n(D) メリッサと踊っている\n(E) ロドリゴと踊っている", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは紫色のプレゼント、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとイヴがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてアリスとデイブがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。最後にボブとアリスがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 紫色のプレゼント\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 青色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはロドリゴと、クレアはパトリックと、デイブはイジーと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にボブとクレアがパートナーを交代します。続いてボブとイヴがパートナーを交代します。その後クレアとアリスがパートナーを交代します。最後にクレアとボブがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) ジェイミー\n(B) ロドリゴ\n(C) パトリック\n(D) イジー\n(E) メリッサ\nと踊っています。", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは紫色のプレゼント、クレアは青色のプレゼント、デイブは黒色のボール、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にクレアとアリスがプレゼントを交換します。続いてボブとイヴがプレゼントを交換します。その後デイブとクレアがプレゼントを交換します。最後にアリスとイヴがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 紫色のプレゼント\n(C) 青色のプレゼント\n(D) 黒色のボール\n(E) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『オデュッセイア』、クレアは『白鯨』、デイブは『ロリータ』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にアリスとボブが本を交換します。続いてボブとイヴが本を交換します。その後イヴとアリスが本を交換します。最後にボブとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『オデュッセイア』\n(C) 『白鯨』\n(D) 『ロリータ』\n(E) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはフルバック、クレアはベンチウォーマー、デイブはゴールキーパー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとクレアがポジションを交換します。次にボブとデイブがポジションを交換します。続いてイヴとデイブがポジションを交換します。その後デイブとクレアがポジションを交換します。最後にアリスとデイブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) フルバック\n(C) ベンチウォーマー\n(D) ゴールキーパー\n(E) 左ミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブはベンチウォーマー、クレアは左ミッドフィールダー、デイブは右ウイング、イヴはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてイヴとボブがポジションを交換します。その後デイブとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) ベンチウォーマー\n(C) 左ミッドフィールダー\n(D) 右ウイング\n(E) フォワード", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブはフルバック、クレアはゴールキーパー、デイブは左ウイング、イヴは右ウイングを担当しています。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずイヴとクレアがポジションを交換します。次にアリスとデイブがポジションを交換します。続いてクレアとボブがポジションを交換します。その後イヴとアリスがポジションを交換し、最後にクレアとイヴがポジションを交換します。試合終了時、イヴが担当しているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) フルバック\n(C) ゴールキーパー\n(D) 左ウイング\n(E) 右ウイング", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは青色のプレゼント、クレアは茶色のプレゼント、デイブは黄色のプレゼント、イヴは黒色のボールです。\nイベントが進むにつれて、人々はペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。続いてクレアとボブがプレゼントを交換します。その後デイブとアリスがプレゼントを交換します。最後にデイブとイヴがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 青色のプレゼント\n(C) 茶色のプレゼント\n(D) 黄色のプレゼント\n(E) 黒色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブは左ミッドフィールダー、クレアは右ミッドフィールダー、デイブはフォワード、イヴはフルバックです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずイヴとクレアがポジションを交換します。次にデイブとボブがポジションを交換します。続いてイヴとデイブがポジションを交換します。その後、アリスとクレアがポジションを交換します。最後にボブとイヴがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) 左ミッドフィールダー\n(C) 右ミッドフィールダー\n(D) フォワード\n(E) フルバック", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブは左ミッドフィールダー、クレアは右ミッドフィールダー、デイブはゴールキーパー、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交代します。次にデイブとクレアがポジションを交代します。続いてイヴとボブがポジションを交代します。その後、アリスとデイブがポジションを交代します。最後にイヴとクレアがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) 左ミッドフィールダー\n(C) 右ミッドフィールダー\n(D) ゴールキーパー\n(E) センターミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブは茶色のプレゼント、クレアは白色のプレゼント、デイブは黒色のボール、イヴはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずデイブとクレアがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてアリスとクレアがプレゼントを交換します。その後イヴとアリスがプレゼントを交換します。最後にボブとデイブがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 茶色のプレゼント\n(C) 白色のプレゼント\n(D) 黒色のボール\n(E) オレンジ色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはサムと、クレアはカールと、デイブはイジーと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にデイブとアリスがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後イヴとクレアがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) ロドリゴ\n(B) サム\n(C) カール\n(D) イジー\n(E) ジェイミー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黒色のボール、クレアは緑色のプレゼント、デイブは紫色のプレゼント、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとクレアがプレゼントを交換します。その後、デイブとボブがプレゼントを交換します。最後にアリスとデイブがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黒色のボール\n(C) 緑色のプレゼント\n(D) 紫色のプレゼント\n(E) 黄色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはカールと、クレアはローラと、デイブはジェイミーと、イヴはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後デイブとボブがパートナーを交代します。最後にクレアとアリスが再びパートナーを交代します。ダンスが終わる時点で、イヴは\n選択肢:\n(A) オフィーリアと踊っている\n(B) カールと踊っている\n(C) ローラと踊っている\n(D) ジェイミーと踊っている\n(E) イジーと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはパトリックと、クレアはジェイミーと、デイブはロドリゴと、イヴはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後デイブとイヴがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) カールと踊っている\n(B) パトリックと踊っている\n(C) ジェイミーと踊っている\n(D) ロドリゴと踊っている\n(E) ローラと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとアリスがボールを交換します。次にクレアとボブがボールを交換します。続いてデイブとボブがボールを交換します。その後アリスとイヴがボールを交換します。最後にデイブとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) 黄色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはカールと、クレアはイジーと、デイブはパトリックと、イヴはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてボブとデイブがパートナーを交代します。その後アリスとボブがパートナーを交代します。最後にボブとイヴがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) サムと踊っている\n(B) カールと踊っている\n(C) イジーと踊っている\n(D) パトリックと踊っている\n(E) ヘルガと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは茶色のプレゼント、クレアは紫色のプレゼント、デイブは白色のプレゼント、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとイヴがプレゼントを交換します。その後、アリスとクレアがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 茶色のプレゼント\n(C) 紫色のプレゼント\n(D) 白色のプレゼント\n(E) 青色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『白鯨』、クレアは『真珠』、デイブは『ロリータ』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとクレアが本を交換します。次にデイブとアリスが本を交換します。続いてデイブとイヴが本を交換します。その後アリスとデイブが本を交換します。最後にボブとイヴが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『白鯨』\n(C) 『真珠』\n(D) 『ロリータ』\n(E) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはフルバック、ボブはセンターミッドフィールダー、クレアは右ミッドフィールダー、デイブは左ウイング、イヴはゴールキーパーです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずデイブとイヴがポジションを交換します。次にクレアとボブがポジションを交換します。続いてアリスとボブがポジションを交換します。その後イヴとデイブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) フルバック\n(B) センターミッドフィールダー\n(C) 右ミッドフィールダー\n(D) 左ウイング\n(E) ゴールキーパー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはパトリックと、クレアはジェイミーと、デイブはロドリゴと、イヴはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にボブとアリスがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後デイブとイヴがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) カール\n(B) パトリック\n(C) ジェイミー\n(D) ロドリゴ\n(E) ローラ", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは緑色のボール、クレアは青色のボール、デイブはピンク色のボール、イヴは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとアリスがボールを交換します。次にボブとクレアがボールを交換します。続いてボブとアリスがボールを交換します。その後アリスとクレアがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 緑色のボール\n(C) 青色のボール\n(D) ピンク色のボール\n(E) 紫色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはメリッサと、クレアはローラと、デイブはサムと、イヴはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとデイブがパートナーを交代します。次にイヴとボブがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。その後イヴとアリスがパートナーを交代します。最後にクレアとデイブが再びパートナーを交代します。ダンスが終了する時点で、アリスのパートナーは\n選択肢:\n(A) カール\n(B) メリッサ\n(C) ローラ\n(D) サム\n(E) イジー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブはゴールキーパー、クレアはフォワード、デイブは左ミッドフィールダー、イヴは右ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとイヴがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてイヴとクレアがポジションを交換します。その後、クレアとアリスがポジションを交換します。最後にボブとデイブがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) チアリーダー\n(B) ゴールキーパー\n(C) フォワード\n(D) 左ミッドフィールダー\n(E) 右ウイング", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはディフェンダー、ボブは右ウイング、クレアはセンターミッドフィールダー、デイブはフォワード、イヴはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交代します。次にデイブとボブがポジションを交代します。続いてアリスとクレアがポジションを交代します。その後ボブとクレアがポジションを交代します。最後にアリスとイヴがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) ディフェンダー\n(B) 右ウイング\n(C) センターミッドフィールダー\n(D) フォワード\n(E) ベンチウォーマー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは青色のボール、デイブは緑色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとクレアがボールを交換します。次にボブとデイブがボールを交換します。続いてイヴとアリスがボールを交換します。その後クレアとボブがボールを交換します。最後にアリスとイヴがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) 緑色のボール\n(E) 黄色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ウイング、クレアはゴールキーパー、デイブは左ウイング、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にアリスとボブがポジションを交換します。続いてイヴとデイブがポジションを交換します。その後ボブとデイブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウイング\n(C) ゴールキーパー\n(D) 左ウイング\n(E) 左ミッドフィールダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはイジーと、クレアはカールと、デイブはヘルガと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にアリスとクレアがパートナーを交代します。続いてアリスとデイブがパートナーを交代します。さらにアリスとイヴがパートナーを交代します。最後にデイブとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) サム\n(B) イジー\n(C) カール\n(D) ヘルガ\n(E) オフィーリア", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィンガー、ボブはフォワード、クレアはベンチウォーマー、デイブはフルバック、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にクレアとイヴがポジションを交換します。続いてイヴとボブがポジションを交換します。その後、アリスとクレアがポジションを交換します。最後にアリスとデイブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ウィンガー\n(B) フォワード\n(C) ベンチウォーマー\n(D) フルバック\n(E) 左ミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブはピンク色のボール、イヴは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとデイブがボールを交換します。その後イヴとアリスがボールを交換します。最後にデイブとボブがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) ピンク色のボール\n(E) 青色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは青色のボール、デイブは白色のボール、イヴは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとイヴがボールを交換します。次にボブとクレアがボールを交換します。続いてクレアとアリスがボールを交換します。その後デイブとイヴが再びボールを交換します。最後にイヴとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) 白色のボール\n(E) 緑色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはローラと、クレアはイジーと、デイブはカールと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてイヴとクレアがパートナーを交代します。その後、アリスとイヴがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、アリスは\n選択肢:\n(A) オフィーリアと踊っている\n(B) ローラと踊っている\n(C) イジーと踊っている\n(D) カールと踊っている\n(E) ジェイミーと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『白鯨』、クレアは『指輪物語』、デイブは『キャッチ=22』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとデイブが本を交換します。次にアリスとイヴが本を交換します。続いてボブとイヴが本を交換します。その後デイブとボブが本を交換します。最後にアリスとデイブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『白鯨』\n(C) 『指輪物語』\n(D) 『キャッチ=22』\n(E) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブはベンチウォーマー、クレアは左ミッドフィールダー、デイブは右ウイング、イヴはフォワードです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてイヴとボブがポジションを交換します。その後デイブとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) ベンチウォーマー\n(C) 左ミッドフィールダー\n(D) 右ウイング\n(E) フォワード", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『オデュッセイア』、クレアは『指輪物語』、デイブは『白鯨』、イヴは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にイヴとボブが本を交換します。続いてボブとクレアが本を交換します。その後アリスとクレアが本を交換します。最後にデイブとクレアが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『オデュッセイア』\n(C) 『指輪物語』\n(D) 『白鯨』\n(E) 『ロリータ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはイジーと、クレアはヘルガと、デイブはパトリックと、イヴはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。その後ボブとアリスがパートナーを交代します。最後にデイブとクレアがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) オフィーリアと踊っている\n(B) イジーと踊っている\n(C) ヘルガと踊っている\n(D) パトリックと踊っている\n(E) ローラと踊っている", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黄色のプレゼント、クレアはオレンジ色のボール、デイブは白色のプレゼント、イヴは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとデイブがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてボブとデイブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。最後にイヴとアリスがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黄色のプレゼント\n(C) オレンジ色のボール\n(D) 白色のプレゼント\n(E) 茶色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『バスカヴィル家の犬』、ボブは『白鯨』、クレアは『指輪物語』、デイブは『オデュッセイア』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にボブとイヴが本を交換します。続いてクレアとデイブが本を交換します。その後アリスとイヴが本を交換し、最後にクレアとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『白鯨』\n(C) 『指輪物語』\n(D) 『オデュッセイア』\n(E) 『フランケンシュタイン』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブはゴールキーパー、クレアはフルバック、デイブはストライカー、イヴは左ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとデイブがポジションを交換します。次にデイブとアリスがポジションを交換します。続いてボブとデイブがポジションを交換します。その後クレアとボブがポジションを交換します。最後にクレアとアリスがポジションを交換します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) ゴールキーパー\n(C) フルバック\n(D) ストライカー\n(E) 左ウイング", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『グレート・ギャツビー』、ボブは『真珠』、クレアは『バスカヴィル家の犬』、デイブは『指輪物語』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にアリスとデイブが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『真珠』\n(C) 『バスカヴィル家の犬』\n(D) 『指輪物語』\n(E) 『オデュッセイア』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは緑色のプレゼント、クレアはピンク色のボール、デイブは黄色のプレゼント、イヴは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。続いてイヴとデイブがプレゼントを交換します。その後ボブとイヴがプレゼントを交換します。最後にイヴとクレアがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 緑色のプレゼント\n(C) ピンク色のボール\n(D) 黄色のプレゼント\n(E) 黒色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはジェイミーと、クレアはオフィーリアと、デイブはカールと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてクレアとボブがパートナーを交代します。その後デイブとアリスがパートナーを交代します。最後にクレアとイヴがパートナーを交代します。ダンス終了時、ボブは\n選択肢:\n(A) ヘルガ\n(B) ジェイミー\n(C) オフィーリア\n(D) カール\n(E) ロドリゴ", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはディフェンダー、クレアはチアリーダー、デイブはベンチウォーマー、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとイヴがポジションを交換します。次にアリスとクレアがポジションを交換します。続いてデイブとボブがポジションを交換します。その後アリスとデイブがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、ボブが担当しているポジションは\n選択肢:\n(A) フォワード\n(B) ディフェンダー\n(C) チアリーダー\n(D) ベンチウォーマー\n(E) ゴールキーパー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはイジーと、クレアはジェイミーと、デイブはオフィーリアと、イヴはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後ボブとイヴがパートナーを交代し、最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、ボブのパートナーは\n選択肢:\n(A) サム\n(B) イジー\n(C) ジェイミー\n(D) オフィーリア\n(E) パトリック", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは白色のプレゼント、クレアは黒色のボール、デイブは赤色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にイヴとアリスがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後、クレアとデイブがプレゼントを交換します。最後にイヴとデイブがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 白色のプレゼント\n(C) 黒色のボール\n(D) 赤色のプレゼント\n(E) 紫色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスはピンク色のボール、ボブは赤色のプレゼント、クレアは緑色のプレゼント、デイブはオレンジ色のボール、イヴは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてデイブとアリスがプレゼントを交換します。その後ボブとクレアがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 赤色のプレゼント\n(C) 緑色のプレゼント\n(D) オレンジ色のボール\n(E) 黒色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはカールと、クレアはメリッサと、デイブはオフィーリアと、イヴはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとデイブがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてボブとクレアがパートナーを交代します。その後アリスとクレアがパートナーを交代します。最後にデイブとイヴがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) ヘルガ\n(B) カール\n(C) メリッサ\n(D) オフィーリア\n(E) サム", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはジェイミーと、デイブはパトリックと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にクレアとイヴがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後クレアとイヴが再びパートナーを交代します。最後にイヴとボブがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) メリッサと踊っている\n(B) ローラと踊っている\n(C) ジェイミーと踊っている\n(D) パトリックと踊っている\n(E) オフィーリアと踊っている", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは緑色のプレゼント、クレアは茶色のプレゼント、デイブは赤色のプレゼント、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとクレアがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてボブとアリスがプレゼントを交換します。その後イヴとアリスがプレゼントを交換します。最後にボブとデイブがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 緑色のプレゼント\n(C) 茶色のプレゼント\n(D) 赤色のプレゼント\n(E) 白色のプレゼント", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは青色のボール、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとアリスがボールを交換します。次にアリスとクレアがボールを交換します。続いてクレアとボブがボールを交換します。その後イヴとボブがボールを交換します。最後にアリスとデイブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 青色のボール\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 白色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『真珠』、デイブは『オデュッセイア』、イヴは『指輪物語』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてクレアとボブが本を交換します。その後デイブとクレアが本を交換します。最後にボブとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『真珠』\n(D) 『オデュッセイア』\n(E) 『指輪物語』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『真珠』、デイブは『キャッチ=22』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとデイブが本を交換します。次にボブとアリスが本を交換します。続いてデイブとアリスが本を交換します。その後ボブとクレアが本を交換します。最後にデイブとイヴが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『真珠』\n(D) 『キャッチ=22』\n(E) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブは茶色のプレゼント、クレアは緑色のプレゼント、デイブは赤色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとボブがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。続いてボブとアリスがプレゼントを交換します。その後アリスとイヴがプレゼントを交換します。最後にデイブとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) 茶色のプレゼント\n(C) 緑色のプレゼント\n(D) 赤色のプレゼント\n(E) 紫色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはベンチウォーマー、クレアはフォワード、デイブはフルバック、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとクレアがポジションを交換します。次にボブとイヴがポジションを交換します。続いてアリスとクレアがポジションを交換します。その後ボブとイヴが再びポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) ベンチウォーマー\n(C) フォワード\n(D) フルバック\n(E) センターミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはメリッサと、クレアはローラと、デイブはサムと、イヴはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとデイブがパートナーを交代します。次にイヴとボブがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。その後イヴとアリスがパートナーを交代します。最後にクレアとデイブが再びパートナーを交代します。ダンスが終了する時点で、ボブは\n選択肢:\n(A) カールと踊っている\n(B) メリッサと踊っている\n(C) ローラと踊っている\n(D) サムと踊っている\n(E) イジーと踊っている", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはゴールキーパー、ボブは左ウイング、クレアはベンチウォーマー、デイブはチアリーダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとアリスがポジションを交換します。次にボブとイヴがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後ボブとイヴが再びポジションを交換します。最後にイヴとクレアがポジションを交換します。試合終了時、イヴが担当しているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) 左ウイング\n(C) ベンチウォーマー\n(D) チアリーダー\n(E) 左ミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは緑色のボール、ボブは紫色のボール、クレアは黒色のボール、デイブは青色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとイヴがボールを交換します。次にボブとアリスがボールを交換します。続いてイヴとクレアがボールを交換します。その後ボブとデイブがボールを交換します。最後にデイブとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 緑色のボール\n(B) 紫色のボール\n(C) 黒色のボール\n(D) 青色のボール\n(E) 赤色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは青色のボール、クレアは黒色のボール、デイブは白色のボール、イヴは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとイヴがボールを交換します。その後クレアとデイブがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 青色のボール\n(C) 黒色のボール\n(D) 白色のボール\n(E) 紫色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは緑色のボール、クレアは茶色のボール、デイブは黒色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にデイブとイヴがボールを交換します。続いてクレアとイヴがボールを交換します。その後ボブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 緑色のボール\n(C) 茶色のボール\n(D) 黒色のボール\n(E) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブは左ミッドフィールダー、クレアは右ミッドフィールダー、デイブはゴールキーパー、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交代します。次にデイブとクレアがポジションを交代します。続いてイヴとボブがポジションを交代します。その後、アリスとデイブがポジションを交代します。最後にイヴとクレアがポジションを交代します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) 左ミッドフィールダー\n(C) 右ミッドフィールダー\n(D) ゴールキーパー\n(E) センターミッドフィールダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブはチアリーダー、クレアは左ミッドフィールダー、デイブは左ウィング、イヴはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてアリスとクレアがポジションを交換します。その後クレアとデイブが再びポジションを交換します。最後にイヴとアリスがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) チアリーダー\n(C) 左ミッドフィールダー\n(D) 左ウィング\n(E) ベンチウォーマー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとボブがボールを交換します。続いてクレアとボブがボールを交換します。その後ボブとアリスがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) オレンジ色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはセンターミッドフィールダー、ボブは左ミッドフィールダー、クレアは右ミッドフィールダー、デイブはベンチウォーマー、イヴは左ウイングです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にアリスとボブがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後クレアとアリスがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) センターミッドフィールダー\n(B) 左ミッドフィールダー\n(C) 右ミッドフィールダー\n(D) ベンチウォーマー\n(E) 左ウイング", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブはピンク色のボール、イヴは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとデイブがボールを交換します。その後イヴとアリスがボールを交換します。最後にデイブとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) ピンク色のボール\n(E) 青色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブはオレンジ色のボール、クレアは白色のプレゼント、デイブは赤色のプレゼント、イヴはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとアリスがプレゼントを交換します。次にデイブとボブがプレゼントを交換します。続いてクレアとデイブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。最後にボブとデイブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) オレンジ色のボール\n(C) 白色のプレゼント\n(D) 赤色のプレゼント\n(E) ピンク色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはローラと、クレアはサムと、デイブはパトリックと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にデイブとアリスがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。さらにクレアとアリスがパートナーを交代します。最後にボブとイヴがパートナーを交代します。ダンスが終わる時点で、アリスは\n選択肢:\n(A) イジー\n(B) ローラ\n(C) サム\n(D) パトリック\n(E) ジェイミー\nと踊っています。", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはパトリックと、クレアはイジーと、デイブはローラと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にデイブとイヴがパートナーを交代します。続いてアリスとクレアが再びパートナーを交代します。その後、アリスとイヴがパートナーを交換します。最後にデイブとボブがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) メリッサ\n(B) パトリック\n(C) イジー\n(D) ローラ\n(E) ロドリゴ\nと踊っています。", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『白鯨』、ボブは『キャッチ=22』、クレアは『指輪物語』、デイブは『ユリシーズ』、イヴは『オデュッセイア』を選びます。\n学期が進むにつれ、彼らは購入した本を交換し始めます。まずクレアとボブが本を交換します。次にクレアとアリスが本を交換します。続いてデイブとクレアが本を交換します。その後イヴとデイブが本を交換し、最後にイヴとアリスが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『白鯨』\n(B) 『キャッチ=22』\n(C) 『指輪物語』\n(D) 『ユリシーズ』\n(E) 『オデュッセイア』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『バスカヴィル家の犬』、ボブは『指輪物語』、クレアは『ユリシーズ』、デイブは『ロリータ』、イヴは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にクレアとイヴが本を交換します。続いてクレアとデイブが本を交換します。その後ボブとデイブが本を交換します。最後にクレアとイヴが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『バスカヴィル家の犬』\n(B) 『指輪物語』\n(C) 『ユリシーズ』\n(D) 『ロリータ』\n(E) 『白鯨』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『キャッチ=22』、クレアは『真珠』、デイブは『指輪物語』、イヴは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとクレアが本を交換します。次にボブとイヴが本を交換します。続いてクレアとデイブが本を交換します。その後ボブとイヴが再び本を交換します。最後にアリスとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『キャッチ=22』\n(C) 『真珠』\n(D) 『指輪物語』\n(E) 『バスカヴィル家の犬』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にデイブとボブが本を交換します。続いてイヴとクレアが本を交換します。その後ボブとアリスが本を交換し、最後にクレアとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはイジーと、クレアはジェイミーと、デイブはオフィーリアと、イヴはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) サム\n(B) イジー\n(C) ジェイミー\n(D) オフィーリア\n(E) パトリック", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはピンク色のボール、ボブは白色のボール、クレアは赤色のボール、デイブは紫色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてアリスとボブがボールを交換します。その後デイブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) ピンク色のボール\n(B) 白色のボール\n(C) 赤色のボール\n(D) 紫色のボール\n(E) 黄色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ウィング、ボブはゴールキーパー、クレアはベンチウォーマー、デイブはセンターミッドフィールダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとイヴがポジションを交換します。次にクレアとアリスがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後ボブとイヴがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) ゴールキーパー\n(C) ベンチウォーマー\n(D) センターミッドフィールダー\n(E) 左ミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはカールと、クレアはイジーと、デイブはサムと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。続いてデイブとクレアがパートナーを交代します。その後イヴとデイブがパートナーを交代します。最後にボブとアリスが再びパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) ヘルガ\n(B) カール\n(C) イジー\n(D) サム\n(E) メリッサ", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはチアリーダー、ボブはフルバック、クレアはセンターミッドフィールダー、デイブは左ミッドフィールダー、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとアリスがポジションを交代します。次にアリスとボブがポジションを交代します。続いてデイブとイヴがポジションを交代します。その後ボブとデイブがポジションを交代します。最後にアリスとクレアがポジションを交代します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) フルバック\n(C) センターミッドフィールダー\n(D) 左ミッドフィールダー\n(E) ゴールキーパー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフルバック、ボブは右ウイング、クレアはセンターミッドフィールダー、デイブはフォワード、イヴはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交代します。次にデイブとボブがポジションを交代します。続いてアリスとクレアがポジションを交代します。その後ボブとクレアがポジションを交代します。最後にアリスとイヴがポジションを交代します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) フルバック\n(B) 右ウイング\n(C) センターミッドフィールダー\n(D) フォワード\n(E) ベンチウォーマー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黒色のボール、クレアは赤色のプレゼント、デイブは白色のプレゼント、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてボブとイヴがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黒色のボール\n(C) 赤色のプレゼント\n(D) 白色のプレゼント\n(E) 青色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは緑色のプレゼント、ボブは白色のプレゼント、クレアは黒色のボール、デイブはオレンジ色のボール、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとアリスがプレゼントを交換します。次にアリスとイヴがプレゼントを交換します。続いてクレアとイヴがプレゼントを交換します。その後アリスとデイブがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 白色のプレゼント\n(C) 黒色のボール\n(D) オレンジ色のボール\n(E) 黄色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『グレート・ギャツビー』、ボブは『真珠』、クレアは『バスカヴィル家の犬』、デイブは『指輪物語』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にアリスとデイブが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『真珠』\n(C) 『バスカヴィル家の犬』\n(D) 『指輪物語』\n(E) 『オデュッセイア』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはローラと、クレアはジェイミーと、デイブはパトリックと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にクレアとイヴがパートナーを交代します。続いてデイブとアリスがパートナーを交代します。その後クレアとイヴが再びパートナーを交代します。最後にイヴとボブがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) メリッサ\n(B) ローラ\n(C) ジェイミー\n(D) パトリック\n(E) オフィーリア", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは白色のプレゼント、ボブは緑色のプレゼント、クレアは黄色のプレゼント、デイブは紫色のプレゼント、イヴはピンク色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。続いてデイブとイヴがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。最後にデイブとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 白色のプレゼント\n(B) 緑色のプレゼント\n(C) 黄色のプレゼント\n(D) 紫色のプレゼント\n(E) ピンク色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは緑色のボール、クレアはオレンジ色のボール、デイブは黄色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとイヴがボールを交換します。次にデイブとクレアがボールを交換します。続いてデイブとイヴがボールを交換します。その後クレアとイヴがボールを交換します。最後にボブとイヴがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 緑色のボール\n(C) オレンジ色のボール\n(D) 黄色のボール\n(E) 赤色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは紫色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にデイブとクレアがボールを交換します。続いてデイブとアリスがボールを交換します。さらにデイブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 紫色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) 白色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブはオレンジ色のボール、クレアはピンク色のボール、デイブは緑色のボール、イヴは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとイヴがボールを交換します。次にイヴとデイブがボールを交換します。続いてデイブとアリスがボールを交換します。その後アリスとクレアがボールを交換します。最後にボブとクレアがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) オレンジ色のボール\n(C) ピンク色のボール\n(D) 緑色のボール\n(E) 茶色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは緑色のボール、クレアは茶色のボール、デイブは黒色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にデイブとイヴがボールを交換します。続いてクレアとイヴがボールを交換します。その後ボブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 緑色のボール\n(C) 茶色のボール\n(D) 黒色のボール\n(E) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『オデュッセイア』、ボブは『白鯨』、クレアは『ロリータ』、デイブは『指輪物語』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとボブが本を交換します。次にデイブとアリスが本を交換します。続いてデイブとボブが本を交換します。その後ボブとクレアが本を交換します。最後にアリスとデイブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『白鯨』\n(C) 『ロリータ』\n(D) 『指輪物語』\n(E) 『フランケンシュタイン』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは黒色のボール、クレアは白色のボール、デイブは黄色のボール、イヴは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとデイブがボールを交換します。次にアリスとイヴがボールを交換します。続いてデイブとボブがボールを交換します。その後アリスとイヴが再びボールを交換します。最後にクレアとイヴがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 黒色のボール\n(C) 白色のボール\n(D) 黄色のボール\n(E) 紫色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『白鯨』、クレアは『真珠』、デイブは『ユリシーズ』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとイヴが本を交換します。次にボブとデイブが本を交換します。続いてクレアとボブが本を交換します。その後アリスとボブが本を交換します。最後にクレアとイヴが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『白鯨』\n(C) 『真珠』\n(D) 『ユリシーズ』\n(E) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『フランケンシュタイン』、ボブは『ユリシーズ』、クレアは『ロリータ』、デイブは『オデュッセイア』、イヴは『指輪物語』を選びます。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとデイブが本を交換します。次にクレアとアリスが本を交換します。続いてデイブとイヴが本を交換します。その後ボブとクレアが本を交換します。最後にアリスとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『ユリシーズ』\n(C) 『ロリータ』\n(D) 『オデュッセイア』\n(E) 『指輪物語』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黒色のボール、クレアは青色のプレゼント、デイブはオレンジ色のボール、イヴは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとボブがプレゼントを交換します。その後アリスとクレアがプレゼントを交換します。最後にイヴとデイブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黒色のボール\n(C) 青色のプレゼント\n(D) オレンジ色のボール\n(E) 赤色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはベンチウォーマー、クレアはフォワード、デイブはフルバック、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとクレアがポジションを交換します。次にボブとイヴがポジションを交換します。続いてアリスとクレアがポジションを交換します。その後ボブとイヴが再びポジションを交換します。最後にクレアとボブがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) ベンチウォーマー\n(C) フォワード\n(D) フルバック\n(E) センターミッドフィールダー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはイジーと、クレアはサムと、デイブはパトリックと、イヴはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にクレアとアリスがパートナーを交代します。続いてボブとクレアがパートナーを交代します。その後イヴとボブがパートナーを交代します。最後にデイブとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ローラ\n(B) イジー\n(C) サム\n(D) パトリック\n(E) カール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはオフィーリアと、クレアはパトリックと、デイブはヘルガと、イヴはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にアリスとクレアがパートナーを交代します。続いてボブとデイブがパートナーを交代します。その後アリスとイヴが再びパートナーを交代します。最後にデイブとアリスがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) カール\n(B) オフィーリア\n(C) パトリック\n(D) ヘルガ\n(E) サム", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黒色のボール、クレアは緑色のプレゼント、デイブは紫色のプレゼント、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとクレアがプレゼントを交換します。その後デイブとボブがプレゼントを交換します。最後にアリスとデイブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黒色のボール\n(C) 緑色のプレゼント\n(D) 紫色のプレゼント\n(E) 黄色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは白色のボール、クレアは黄色のボール、デイブは赤色のボール、イヴは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとデイブがボールを交換します。次にアリスとデイブがボールを交換します。続いてアリスとクレアがボールを交換します。その後デイブとボブがボールを交換します。最後にイヴとデイブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 白色のボール\n(C) 黄色のボール\n(D) 赤色のボール\n(E) 茶色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ウィング、ボブは右ミッドフィールダー、クレアは左ウィング、デイブはチアリーダー、イヴはゴールキーパーです。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずデイブとボブがポジションを交換します。次にデイブとイヴがポジションを交換します。続いてアリスとボブがポジションを交換します。その後デイブとクレアがポジションを交換します。最後にデイブとイヴが再びポジションを交換します。試合終了時、イヴが担当しているのは\n選択肢:\n(A) 右ウィング\n(B) 右ミッドフィールダー\n(C) 左ウィング\n(D) チアリーダー\n(E) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはメリッサと、クレアはパトリックと、デイブはロドリゴと、イヴはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとクレアがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてデイブとボブがパートナーを交代します。さらにデイブとクレアが再びパートナーを交代します。最後にデイブとイヴがパートナーを交代します。ダンスが終了する時点で、ボブは\n選択肢:\n(A) ジェイミー\n(B) メリッサ\n(C) パトリック\n(D) ロドリゴ\n(E) カール\nと踊っています。", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーチームのメンバーです。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはディフェンダー、クレアはチアリーダー、デイブはベンチウォーマー、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとイヴがポジションを交換します。次にアリスとクレアがポジションを交換します。続いてデイブとボブがポジションを交換します。その後アリスとデイブがポジションを交換します。最後にデイブとイヴがポジションを交換します。試合終了時、クレアが担当しているのは\n選択肢:\n(A) フォワード\n(B) ディフェンダー\n(C) チアリーダー\n(D) ベンチウォーマー\n(E) ゴールキーパー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にデイブとボブが本を交換します。続いてイヴとクレアが本を交換します。その後ボブとアリスが本を交換します。最後にクレアとデイブが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはカールと、クレアはイジーと、デイブはサムと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとアリスがパートナーを交代します。次にボブとクレアがパートナーを交代します。続いてデイブとクレアがパートナーを交代します。その後イヴとデイブがパートナーを交代します。最後にボブとアリスが再びパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) ヘルガ\n(B) カール\n(C) イジー\n(D) サム\n(E) メリッサ\nと踊っています。", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黒色のボール、クレアは茶色のプレゼント、デイブはオレンジ色のボール、イヴは赤色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にアリスとデイブがプレゼントを交換します。続いてイヴとクレアがプレゼントを交換します。その後、アリスとボブがプレゼントを交換します。最後にデイブとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黒色のボール\n(C) 茶色のプレゼント\n(D) オレンジ色のボール\n(E) 赤色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは赤色のボール、デイブは白色のボール、イヴは緑色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとアリスがボールを交換します。次にアリスとクレアがボールを交換します。続いてイヴとアリスがボールを交換します。その後クレアとボブがボールを交換します。最後にクレアとデイブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 赤色のボール\n(D) 白色のボール\n(E) 緑色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは茶色のプレゼント、クレアは紫色のプレゼント、デイブは白色のプレゼント、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとイヴがプレゼントを交換します。その後、アリスとクレアがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 茶色のプレゼント\n(C) 紫色のプレゼント\n(D) 白色のプレゼント\n(E) 青色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとイヴが本を交換します。続いてデイブとクレアが本を交換します。その後デイブとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは白色のプレゼント、クレアは黒色のボール、デイブは赤色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にイヴとアリスがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後、クレアとデイブがプレゼントを交換します。最後にイヴとデイブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 白色のプレゼント\n(C) 黒色のボール\n(D) 赤色のプレゼント\n(E) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはディフェンダー、クレアは左ウイング、デイブはセンターミッドフィールダー、イヴはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交代します。次にデイブとクレアがポジションを交代します。続いてアリスとボブがポジションを交代します。その後イヴとデイブがポジションを交代します。最後にアリスとデイブがポジションを交代します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) ディフェンダー\n(C) 左ウイング\n(D) センターミッドフィールダー\n(E) ベンチウォーマー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはゴールキーパー、ボブはフォワード、クレアはチアリーダー、デイブはセンターミッドフィールダー、イヴは右ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとデイブがポジションを交換します。次にデイブとボブがポジションを交換します。続いてデイブとクレアがポジションを交換します。さらにデイブとボブが再びポジションを交換します。最後にアリスとボブがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) ゴールキーパー\n(B) フォワード\n(C) チアリーダー\n(D) センターミッドフィールダー\n(E) 右ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブはピンク色のボール、クレアは黒色のボール、デイブは茶色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとデイブがプレゼントを交換します。次にイヴとデイブがプレゼントを交換します。続いてイヴとクレアがプレゼントを交換します。その後デイブとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) ピンク色のボール\n(C) 黒色のボール\n(D) 茶色のプレゼント\n(E) 紫色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは茶色のボール、クレアは緑色のボール、デイブは白色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとイヴがボールを交換します。続いてアリスとイヴがボールを交換します。その後デイブとクレアがボールを交換します。最後にボブとデイブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 茶色のボール\n(C) 緑色のボール\n(D) 白色のボール\n(E) 赤色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは赤色のプレゼント、ボブは黄色のプレゼント、クレアは緑色のプレゼント、デイブはピンク色のボール、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてボブとデイブがプレゼントを交換します。その後イヴとデイブがプレゼントを交換します。最後にデイブとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 黄色のプレゼント\n(C) 緑色のプレゼント\n(D) ピンク色のボール\n(E) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブはフォワード、クレアはチアリーダー、デイブは右ミッドフィールダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にイヴとデイブがポジションを交換します。続いてアリスとイヴがポジションを交換します。その後ボブとクレアがポジションを交換します。最後にイヴとクレアがポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) フォワード\n(C) チアリーダー\n(D) 右ミッドフィールダー\n(E) 左ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは青色のボール、クレアは黒色のボール、デイブは白色のボール、イヴは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとデイブがボールを交換します。次にクレアとイヴがボールを交換します。続いてデイブとイヴがボールを交換します。その後クレアとデイブがボールを交換します。最後にアリスとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 青色のボール\n(C) 黒色のボール\n(D) 白色のボール\n(E) 紫色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブはピンク色のボール、イヴは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとクレアがボールを交換します。その後デイブとクレアがボールを交換します。最後にアリスとデイブがボールを交換します。ゲーム終了時、イヴが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) ピンク色のボール\n(E) 青色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはオフィーリアと、クレアはパトリックと、デイブはヘルガと、イヴはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にアリスとクレアがパートナーを交代します。続いてボブとデイブがパートナーを交代します。その後アリスとイヴが再びパートナーを交代します。最後にデイブとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) カール\n(B) オフィーリア\n(C) パトリック\n(D) ヘルガ\n(E) サム", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは緑色のボール、クレアは黄色のボール、デイブは茶色のボール、イヴは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとボブがボールを交換します。次にアリスとクレアがボールを交換します。続いてクレアとボブがボールを交換します。その後アリスとデイブがボールを交換します。最後にデイブとイヴがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 緑色のボール\n(C) 黄色のボール\n(D) 茶色のボール\n(E) 黒色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは緑色のボール、クレアは茶色のボール、デイブは黒色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にデイブとイヴがボールを交換します。続いてクレアとイヴがボールを交換します。その後ボブとクレアがボールを交換します。最後にアリスとクレアがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 緑色のボール\n(C) 茶色のボール\n(D) 黒色のボール\n(E) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブは右ミッドフィールダー、クレアは左ミッドフィールダー、デイブは左ウイング、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとクレアがポジションを交換します。次にアリスとデイブがポジションを交換します。続いてボブとイヴがポジションを交換します。その後デイブとボブがポジションを交換します。最後にボブとイヴが再びポジションを交換します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) チアリーダー\n(B) 右ミッドフィールダー\n(C) 左ミッドフィールダー\n(D) 左ウイング\n(E) ゴールキーパー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黄色のプレゼント、クレアはオレンジ色のボール、デイブは白色のプレゼント、イヴは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとデイブがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてボブとデイブがプレゼントを交換します。その後イヴとクレアがプレゼントを交換します。最後にイヴとアリスがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黄色のプレゼント\n(C) オレンジ色のボール\n(D) 白色のプレゼント\n(E) 茶色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『真珠』、ボブは『フランケンシュタイン』、クレアは『ユリシーズ』、デイブは『バスカヴィル家の犬』、イヴは『白鯨』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとデイブが本を交換します。次にボブとクレアが本を交換します。続いてデイブとクレアが本を交換します。その後クレアとボブが本を交換します。最後にアリスとイヴが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『フランケンシュタイン』\n(C) 『ユリシーズ』\n(D) 『バスカヴィル家の犬』\n(E) 『白鯨』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはイジーと、ボブはパトリックと、クレアはヘルガと、デイブはロドリゴと、イヴはカールと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてアリスとクレアがパートナーを交代します。その後イヴとボブがパートナーを交代します。最後にクレアとイヴが再びパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) イジー\n(B) パトリック\n(C) ヘルガ\n(D) ロドリゴ\n(E) カール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『オデュッセイア』、ボブは『白鯨』、クレアは『ロリータ』、デイブは『指輪物語』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとボブが本を交換します。次にデイブとアリスが本を交換します。続いてデイブとボブが本を交換します。その後、ボブとクレアが本を交換します。最後にアリスとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『オデュッセイア』\n(B) 『白鯨』\n(C) 『ロリータ』\n(D) 『指輪物語』\n(E) 『フランケンシュタイン』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ミッドフィールダー、ボブはフォワード、クレアはゴールキーパー、デイブは左ウィング、イヴはチアリーダーを担当しています。\nゲームが進むにつれて、時折プレイヤーたちがポジションを交換します。まずデイブとクレアがポジションを交換します。次にイヴとアリスがポジションを交換します。続いてクレアとアリスがポジションを交換します。その後イヴとアリスが再びポジションを交換します。最後にイヴとボブがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) 左ミッドフィールダー\n(B) フォワード\n(C) ゴールキーパー\n(D) 左ウィング\n(E) チアリーダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『ロリータ』、クレアは『ユリシーズ』、デイブは『フランケンシュタイン』、イヴは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてボブとイヴが本を交換します。その後デイブとアリスが本を交換します。最後にデイブとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『ロリータ』\n(C) 『ユリシーズ』\n(D) 『フランケンシュタイン』\n(E) 『真珠』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『フランケンシュタイン』、ボブは『真珠』、クレアは『バスカヴィル家の犬』、デイブは『ユリシーズ』、イヴは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずデイブとクレアが本を交換します。次にボブとクレアが本を交換します。続いてクレアとイヴが本を交換します。その後ボブとクレアが再び本を交換します。最後にアリスとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『フランケンシュタイン』\n(B) 『真珠』\n(C) 『バスカヴィル家の犬』\n(D) 『ユリシーズ』\n(E) 『グレート・ギャツビー』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはパトリックと、クレアはカールと、デイブはヘルガと、イヴはイジーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとアリスがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンス終了時、クレアのパートナーは\n選択肢:\n(A) ジェイミー\n(B) パトリック\n(C) カール\n(D) ヘルガ\n(E) イジー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブはセンターミッドフィールダー、クレアは右ウイング、デイブは左ウイング、イヴはフルバックを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にクレアとアリスがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後、アリスとボブが再びポジションを交換します。最後にアリスとデイブが再度ポジションを交換します。試合終了時、イヴが担当しているポジションは\n選択肢:\n(A) チアリーダー\n(B) センターミッドフィールダー\n(C) 右ウイング\n(D) 左ウイング\n(E) フルバック", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブはフォワード、クレアはベンチウォーマー、デイブは左ミッドフィールダー、イヴはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとアリスがポジションを交代します。次にボブとイヴがポジションを交代します。続いてアリスとボブがポジションを交代します。その後クレアとアリスがポジションを交代します。最後にクレアとイヴがポジションを交代します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) 左ウィング\n(B) フォワード\n(C) ベンチウォーマー\n(D) 左ミッドフィールダー\n(E) チアリーダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは紫色のプレゼント、クレアは青色のプレゼント、デイブは黒色のボール、イヴは赤色のプレゼントです。\nイベントが進むにつれて、人々はペアを組んでプレゼントを交換します。まずデイブとクレアがプレゼントを交換します。次にボブとアリスがプレゼントを交換します。続いてイヴとボブがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 紫色のプレゼント\n(C) 青色のプレゼント\n(D) 黒色のボール\n(E) 赤色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『オデュッセイア』、クレアは『指輪物語』、デイブは『白鯨』、イヴは『ロリータ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にイヴとボブが本を交換します。続いてボブとクレアが本を交換します。その後アリスとクレアが本を交換します。最後にデイブとクレアが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『オデュッセイア』\n(C) 『指輪物語』\n(D) 『白鯨』\n(E) 『ロリータ』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブは赤色のプレゼント、クレアは緑色のプレゼント、デイブはオレンジ色のボール、イヴは黒色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとデイブがプレゼントを交換します。次にボブとクレアがプレゼントを交換します。続いてクレアとデイブが再びプレゼントを交換します。その後、アリスとイヴがプレゼントを交換します。最後にクレアとボブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) 赤色のプレゼント\n(C) 緑色のプレゼント\n(D) オレンジ色のボール\n(E) 黒色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは黄色のプレゼント、ボブはオレンジ色のボール、クレアは赤色のプレゼント、デイブは紫色のプレゼント、イヴは緑色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとイヴがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。続いてボブとイヴがプレゼントを交換します。その後クレアとイヴがプレゼントを交換します。最後にデイブとアリスがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 黄色のプレゼント\n(B) オレンジ色のボール\n(C) 赤色のプレゼント\n(D) 紫色のプレゼント\n(E) 緑色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『グレート・ギャツビー』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にデイブとボブが本を交換します。続いてイヴとクレアが本を交換します。その後ボブとアリスが本を交換し、最後にクレアとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『グレート・ギャツビー』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは赤色のプレゼント、ボブは黒色のボール、クレアはピンク色のボール、デイブはオレンジ色のボール、イヴは茶色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとアリスがプレゼントを交換します。次にクレアとデイブがプレゼントを交換します。続いてアリスとボブがプレゼントを交換します。その後イヴとデイブがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) 黒色のボール\n(C) ピンク色のボール\n(D) オレンジ色のボール\n(E) 茶色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは赤色のボール、デイブはピンク色のボール、イヴは青色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にクレアとイヴがボールを交換します。続いてボブとデイブがボールを交換します。その後イヴとアリスがボールを交換します。最後にデイブとボブがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 赤色のボール\n(D) ピンク色のボール\n(E) 青色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ウィング、ボブは右ミッドフィールダー、クレアは左ウィング、デイブはチアリーダー、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にデイブとイヴがポジションを交換します。続いてアリスとボブがポジションを交換します。その後デイブとクレアがポジションを交換します。最後にデイブとイヴが再びポジションを交換します。試合終了時、ボブが担当しているポジションは\n選択肢:\n(A) 右ウィング\n(B) 右ミッドフィールダー\n(C) 左ウィング\n(D) チアリーダー\n(E) ゴールキーパー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはロドリゴと、クレアはメリッサと、デイブはヘルガと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にアリスとクレアがパートナーを交代します。続いてデイブとボブがパートナーを交代します。その後アリスとイヴがパートナーを交代します。最後にイヴとデイブがパートナーを交代します。ダンス終了時、アリスは\n選択肢:\n(A) ローラと\n(B) ロドリゴと\n(C) メリッサと\n(D) ヘルガと\n(E) ジェイミーと", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは右ミッドフィールダー、ボブはサイドバック、クレアはフォワード、デイブはゴールキーパー、イヴはベンチウォーマーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にボブとクレアがポジションを交換します。続いてデイブとアリスがポジションを交換します。その後イヴとクレアがポジションを交換し、最後にアリスとボブがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) サイドバック\n(C) フォワード\n(D) ゴールキーパー\n(E) ベンチウォーマー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『指輪物語』、ボブは『オデュッセイア』、クレアは『フランケンシュタイン』、デイブは『バスカヴィル家の犬』、イヴは『ユリシーズ』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとクレアが本を交換します。次にアリスとイヴが本を交換します。続いてデイブとクレアが本を交換します。その後デイブとボブが本を交換します。最後にデイブとアリスが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『指輪物語』\n(B) 『オデュッセイア』\n(C) 『フランケンシュタイン』\n(D) 『バスカヴィル家の犬』\n(E) 『ユリシーズ』", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはロドリゴと、クレアはローラと、デイブはパトリックと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとボブがパートナーを交代します。次にクレアとイヴがパートナーを交代します。続いてイヴとデイブがパートナーを交代します。その後クレアとアリスがパートナーを交代します。最後にボブとイヴがパートナーを交代します。ダンスが終わる時点で、アリスは\n選択肢:\n(A) メリッサと踊っている\n(B) ロドリゴと踊っている\n(C) ローラと踊っている\n(D) パトリックと踊っている\n(E) ジェイミーと踊っている", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブはフォワード、クレアは左ミッドフィールダー、デイブはチアリーダー、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとボブがポジションを交換します。次にクレアとデイブがポジションを交換します。続いてアリスとボブがポジションを交換します。その後ボブとデイブがポジションを交換します。最後にイヴとボブがポジションを交換します。試合終了時、デイブが担当しているのは\n選択肢:\n(A) 左ウィング\n(B) フォワード\n(C) 左ミッドフィールダー\n(D) チアリーダー\n(E) ゴールキーパー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『指輪物語』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にデイブとイヴが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとイヴが再び本を交換します。最後にクレアとデイブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『指輪物語』\n(E) 『キャッチ=22』", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは茶色のプレゼント、クレアは白色のプレゼント、デイブは青色のプレゼント、イヴはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとアリスがプレゼントを交換します。次にボブとデイブがプレゼントを交換します。続いてボブとアリスがプレゼントを交換します。その後クレアとイヴがプレゼントを交換します。最後にアリスとイヴがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 茶色のプレゼント\n(C) 白色のプレゼント\n(D) 青色のプレゼント\n(E) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはフルバック、ボブはセンターミッドフィールダー、クレアは右ミッドフィールダー、デイブは左ウイング、イヴはゴールキーパーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとイヴがポジションを交換します。次にクレアとボブがポジションを交換します。続いてアリスとボブがポジションを交換します。その後イヴとデイブがポジションを交換します。最後にボブとアリスがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) フルバック\n(B) センターミッドフィールダー\n(C) 右ミッドフィールダー\n(D) 左ウイング\n(E) ゴールキーパー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは黄色のプレゼント、クレアは黒色のボール、デイブは紫色のプレゼント、イヴは赤色のプレゼントです。\nイベントが進むにつれ、参加者たちはペアを組んでプレゼントを交換します。まずボブとクレアがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後クレアとアリスがプレゼントを交換します。最後にイヴとデイブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 黄色のプレゼント\n(C) 黒色のボール\n(D) 紫色のプレゼント\n(E) 赤色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブはオレンジ色のボール、クレアは緑色のプレゼント、デイブは青色のプレゼント、イヴは白色のプレゼントです。\nイベントが進むにつれて、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にイヴとクレアがプレゼントを交換します。続いてイヴとデイブがプレゼントを交換します。その後、デイブとアリスがプレゼントを交換します。最後にクレアとデイブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) オレンジ色のボール\n(C) 緑色のプレゼント\n(D) 青色のプレゼント\n(E) 白色のプレゼント", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは白色のプレゼント、クレアは茶色のプレゼント、デイブは赤色のプレゼント、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてボブとデイブが再びプレゼントを交換します。その後、クレアとイヴがプレゼントを交換します。最後にアリスとデイブがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 白色のプレゼント\n(C) 茶色のプレゼント\n(D) 赤色のプレゼント\n(E) 黄色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはジェイミーと、クレアはイジーと、デイブはカールと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にイヴとクレアがパートナーを交代します。続いてアリスとデイブがパートナーを交代します。その後クレアとイヴがパートナーを交代します。最後にイヴとボブがパートナーを交代します。ダンスが終わる時点で、イヴのパートナーは\n選択肢:\n(A) パトリック\n(B) ジェイミー\n(C) イジー\n(D) カール\n(E) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは赤色のプレゼント、クレアはピンク色のボール、デイブは茶色のプレゼント、イヴはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後イヴとデイブがプレゼントを交換します。最後にクレアとアリスが再びプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 赤色のプレゼント\n(C) ピンク色のボール\n(D) 茶色のプレゼント\n(E) オレンジ色のボール", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィング、ボブはフォワード、クレアはベンチウォーマー、デイブは左ミッドフィールダー、イヴはチアリーダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとアリスがポジションを交代します。次にボブとイヴがポジションを交代します。続いてアリスとボブがポジションを交代します。その後クレアとアリスがポジションを交代します。最後にクレアとイヴがポジションを交代します。試合終了時、ボブがプレーしているポジションは\n選択肢:\n(A) 左ウィング\n(B) フォワード\n(C) ベンチウォーマー\n(D) 左ミッドフィールダー\n(E) チアリーダー", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは赤色のボール、ボブは青色のボール、クレアは茶色のボール、デイブは黒色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずデイブとクレアがボールを交換します。次にアリスとボブがボールを交換します。続いてイヴとデイブがボールを交換します。その後クレアとボブがボールを交換します。最後にデイブとイヴがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 赤色のボール\n(B) 青色のボール\n(C) 茶色のボール\n(D) 黒色のボール\n(E) オレンジ色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブは右ウイング、クレアはゴールキーパー、デイブは左ウイング、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交代します。次にアリスとボブがポジションを交代します。続いてイヴとデイブがポジションを交代します。その後、ボブとデイブがポジションを交代します。最後にクレアとアリスがポジションを交代します。試合終了時、デイブがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) 右ウイング\n(C) ゴールキーパー\n(D) 左ウイング\n(E) 左ミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはジェイミーと、デイブはロドリゴと、イヴはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとイヴがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてイヴとボブがパートナーを交代します。さらにイヴとクレアがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンスが終わる時点で、イヴは\n選択肢:\n(A) ローラと踊っている\n(B) メリッサと踊っている\n(C) ジェイミーと踊っている\n(D) ロドリゴと踊っている\n(E) ヘルガと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは白色のボール、ボブは黄色のボール、クレアは青色のボール、デイブはオレンジ色のボール、イヴは茶色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとアリスがボールを交換します。次にデイブとボブがボールを交換します。続いてクレアとアリスがボールを交換します。その後アリスとデイブがボールを交換します。最後にイヴとアリスがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 白色のボール\n(B) 黄色のボール\n(C) 青色のボール\n(D) オレンジ色のボール\n(E) 茶色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴはオレンジ色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずボブとクレアがボールを交換します。次にデイブとボブがボールを交換します。続いてクレアとボブがボールを交換します。その後ボブとアリスがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) オレンジ色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは黒色のボール、クレアは赤色のプレゼント、デイブは白色のプレゼント、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとデイブがプレゼントを交換します。次にデイブとイヴがプレゼントを交換します。続いてボブとイヴがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。最後にボブとクレアがプレゼントを交換します。イベント終了時、デイブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 黒色のボール\n(C) 赤色のプレゼント\n(D) 白色のプレゼント\n(E) 青色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『真珠』を、ボブは『キャッチ=22』を、クレアは『指輪物語』を、デイブは『ロリータ』を、イヴは『ユリシーズ』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとアリスが本を交換します。次にデイブとアリスが本を交換します。続いてイヴとボブが本を交換します。その後デイブとボブが本を交換します。最後にボブとクレアが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『キャッチ=22』\n(C) 『指輪物語』\n(D) 『ロリータ』\n(E) 『ユリシーズ』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは紫色のプレゼント、ボブは赤色のプレゼント、クレアはピンク色のボール、デイブは茶色のプレゼント、イヴはオレンジ色のボールです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとクレアがプレゼントを交換します。次にデイブとアリスがプレゼントを交換します。続いてボブとクレアがプレゼントを交換します。その後イヴとデイブがプレゼントを交換します。最後にクレアとアリスが再びプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 紫色のプレゼント\n(B) 赤色のプレゼント\n(C) ピンク色のボール\n(D) 茶色のプレゼント\n(E) オレンジ色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは緑色のプレゼント、ボブは茶色のプレゼント、クレアは紫色のプレゼント、デイブは白色のプレゼント、イヴは青色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとイヴがプレゼントを交換します。その後、アリスとクレアがプレゼントを交換します。最後にボブとイヴがプレゼントを交換します。イベント終了時、ボブが持っているプレゼントは\n選択肢:\n(A) 緑色のプレゼント\n(B) 茶色のプレゼント\n(C) 紫色のプレゼント\n(D) 白色のプレゼント\n(E) 青色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは茶色のボール、ボブは黒色のボール、クレアは白色のボール、デイブは黄色のボール、イヴは紫色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとデイブがボールを交換します。次にアリスとイヴがボールを交換します。続いてデイブとボブがボールを交換します。その後アリスとイヴが再びボールを交換します。最後にクレアとイヴがボールを交換します。ゲーム終了時、アリスが持っているボールは\n選択肢:\n(A) 茶色のボール\n(B) 黒色のボール\n(C) 白色のボール\n(D) 黄色のボール\n(E) 紫色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはヘルガと、デイブはオフィーリアと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にデイブとイヴがパートナーを交代します。ダンス終了時、デイブは\n選択肢:\n(A) メリッサと踊っている\n(B) サムと踊っている\n(C) ヘルガと踊っている\n(D) オフィーリアと踊っている\n(E) ジェイミーと踊っている", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはカールと、ボブはジェイミーと、クレアはメリッサと、デイブはローラと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとクレアがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてボブとアリスがパートナーを交代します。その後クレアとイヴがパートナーを交代します。最後にイヴとアリスがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) カールと踊っている\n(B) ジェイミーと踊っている\n(C) メリッサと踊っている\n(D) ローラと踊っている\n(E) オフィーリアと踊っている", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ロリータ』、ボブは『キャッチ=22』、クレアは『真珠』、デイブは『フランケンシュタイン』、イヴは『グレート・ギャツビー』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとアリスが本を交換します。次にアリスとボブが本を交換します。続いてクレアとボブが本を交換します。その後イヴとデイブが本を交換します。最後にボブとクレアが本を交換します。学期終了時、イヴが持っている本は\n選択肢:\n(A) 『ロリータ』\n(B) 『キャッチ=22』\n(C) 『真珠』\n(D) 『フランケンシュタイン』\n(E) 『グレート・ギャツビー』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者は色の異なるプレゼントを持っています：アリスは赤色のプレゼント、ボブはピンク色のボール、クレアは黒色のボール、デイブは茶色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずクレアとデイブがプレゼントを交換します。次にイヴとデイブがプレゼントを交換します。続いてイヴとクレアがプレゼントを交換します。その後デイブとボブがプレゼントを交換します。最後にアリスとクレアがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 赤色のプレゼント\n(B) ピンク色のボール\n(C) 黒色のボール\n(D) 茶色のプレゼント\n(E) 紫色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはオフィーリアと、ボブはイジーと、クレアはヘルガと、デイブはパトリックと、イヴはローラと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとクレアがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてクレアとアリスがパートナーを交代します。その後ボブとアリスがパートナーを交代します。最後にデイブとクレアがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) オフィーリアと踊っている\n(B) イジーと踊っている\n(C) ヘルガと踊っている\n(D) パトリックと踊っている\n(E) ローラと踊っている", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは青色のボール、クレアはオレンジ色のボール、デイブはピンク色のボール、イヴは白色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとボブがボールを交換します。次にデイブとボブがボールを交換します。続いてデイブとアリスがボールを交換します。その後イヴとクレアがボールを交換します。最後にクレアとアリスがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 青色のボール\n(C) オレンジ色のボール\n(D) ピンク色のボール\n(E) 白色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブは右ウィンガー、クレアは左ウィンガー、デイブはゴールキーパー、イヴはストライカーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとデイブがポジションを交換します。次にアリスとイヴがポジションを交換します。続いてクレアとデイブがポジションを交換します。その後クレアとボブがポジションを交換します。最後にイヴとボブがポジションを交換します。試合終了時、デイブが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) 右ウィンガー\n(C) 左ウィンガー\n(D) ゴールキーパー\n(E) ストライカー", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『指輪物語』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にデイブとイヴが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとイヴが再び本を交換します。最後にクレアとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『指輪物語』\n(E) 『キャッチ=22』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは青色のプレゼント、ボブは赤色のプレゼント、クレアは白色のプレゼント、デイブは黄色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれて、人々はペアを組んでプレゼントを交換します。まずデイブとイヴがプレゼントを交換します。次にデイブとクレアがプレゼントを交換します。続いてデイブとボブがプレゼントを交換します。さらにデイブとアリスがプレゼントを交換します。最後にイヴとボブがプレゼントを交換します。イベント終了時、アリスが持っているプレゼントは\n選択肢:\n(A) 青色のプレゼント\n(B) 赤色のプレゼント\n(C) 白色のプレゼント\n(D) 黄色のプレゼント\n(E) 紫色のプレゼント", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはメリッサと、ボブはサムと、クレアはヘルガと、デイブはオフィーリアと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてクレアとイヴがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にデイブとイヴがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) メリッサと踊っている\n(B) サムと踊っている\n(C) ヘルガと踊っている\n(D) オフィーリアと踊っている\n(E) ジェイミーと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはロドリゴと、クレアはサムと、デイブはヘルガと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとアリスがパートナーを交代します。次にデイブとクレアがパートナーを交代します。続いてアリスとボブがパートナーを交代します。その後クレアとイヴがパートナーを交代します。最後にクレアとアリスがパートナーを交代します。ダンス終了時、クレアのパートナーは\n選択肢:\n(A) ジェイミー\n(B) ロドリゴ\n(C) サム\n(D) ヘルガ\n(E) オフィーリア", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスは左ウィンガー、ボブはフルバック、クレアはベンチウォーマー、デイブはゴールキーパー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずボブとクレアがポジションを交換します。次にボブとデイブがポジションを交換します。続いてイヴとデイブがポジションを交換します。その後デイブとクレアがポジションを交換します。最後にアリスとデイブがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 左ウィンガー\n(B) フルバック\n(C) ベンチウォーマー\n(D) ゴールキーパー\n(E) 左ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはチアリーダー、ボブはベンチウォーマー、クレアはセンターミッドフィールダー、デイブはフォワード、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にデイブとアリスがポジションを交換します。続いてアリスとクレアがポジションを交換します。その後ボブとアリスがポジションを交換します。最後にイヴとボブがポジションを交換します。試合終了時、ボブが担当しているのは\n選択肢:\n(A) チアリーダー\n(B) ベンチウォーマー\n(C) センターミッドフィールダー\n(D) フォワード\n(E) 左ミッドフィールダー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはサムと、ボブはイジーと、クレアはジェイミーと、デイブはオフィーリアと、イヴはパトリックと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとデイブがパートナーを交代します。次にアリスとイヴがパートナーを交代します。続いてクレアとデイブがパートナーを交代します。その後ボブとイヴがパートナーを交代します。最後にアリスとボブがパートナーを交代します。ダンスが終わる時点で、クレアは\n選択肢:\n(A) サムと踊っている\n(B) イジーと踊っている\n(C) ジェイミーと踊っている\n(D) オフィーリアと踊っている\n(E) パトリックと踊っている", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスはピンク色のボール、ボブはオレンジ色のボール、クレアは緑色のプレゼント、デイブは茶色のプレゼント、イヴは紫色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずアリスとボブがプレゼントを交換します。次にクレアとボブがプレゼントを交換します。続いてクレアとイヴがプレゼントを交換します。その後ボブとデイブがプレゼントを交換します。最後にイヴとボブがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) ピンク色のボール\n(B) オレンジ色のボール\n(C) 緑色のプレゼント\n(D) 茶色のプレゼント\n(E) 紫色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアは緑色のボール、デイブは茶色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとアリスがボールを交換します。次にクレアとボブがボールを交換します。続いてデイブとボブがボールを交換します。その後アリスとイヴがボールを交換します。最後にデイブとクレアがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) 緑色のボール\n(D) 茶色のボール\n(E) 黄色のボール", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『オデュッセイア』、クレアは『白鯨』、デイブは『ロリータ』、イヴは『フランケンシュタイン』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずクレアとイヴが本を交換します。次にアリスとボブが本を交換します。続いてボブとイヴが本を交換します。その後イヴとアリスが本を交換します。最後にボブとデイブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『オデュッセイア』\n(C) 『白鯨』\n(D) 『ロリータ』\n(E) 『フランケンシュタイン』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ウィング、ボブはゴールキーパー、クレアはベンチウォーマー、デイブはセンターミッドフィールダー、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずクレアとイヴがポジションを交換します。次にクレアとアリスがポジションを交換します。続いてアリスとデイブがポジションを交換します。その後ボブとイヴがポジションを交換します。最後にアリスとクレアがポジションを交換します。試合終了時、アリスがプレーしているポジションは\n選択肢:\n(A) 右ウィング\n(B) ゴールキーパー\n(C) ベンチウォーマー\n(D) センターミッドフィールダー\n(E) 左ミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスはベンチウォーマー、ボブは右ミッドフィールダー、クレアは右ウィンガー、デイブはセンターミッドフィールダー、イヴは左ウィンガーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずデイブとボブがポジションを交換します。次にアリスとクレアがポジションを交換します。続いてクレアとイヴがポジションを交換します。その後ボブとクレアがポジションを交換し、最後にデイブとイヴがポジションを交換します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) 右ミッドフィールダー\n(C) 右ウィンガー\n(D) センターミッドフィールダー\n(E) 左ウィンガー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれ1冊ずつ新しい本を購入します：アリスは『グレート・ギャツビー』、ボブは『フランケンシュタイン』、クレアは『白鯨』、デイブは『指輪物語』、イヴは『キャッチ=22』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずアリスとボブが本を交換します。次にデイブとイヴが本を交換します。続いてイヴとアリスが本を交換します。その後デイブとイヴが再び本を交換します。最後にクレアとデイブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『フランケンシュタイン』\n(C) 『白鯨』\n(D) 『指輪物語』\n(E) 『キャッチ=22』", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの試合で同じチームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されます：アリスは右ミッドフィールダー、ボブは右ウイング、クレアはフルバック、デイブは左ミッドフィールダー、イヴはチアリーダーを担当しています。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずイヴとボブがポジションを交換します。次にイヴとクレアがポジションを交換します。続いてクレアとデイブがポジションを交換します。その後、アリスとデイブがポジションを交換します。最後にデイブとクレアがポジションを交換します。試合終了時、クレアが担当しているポジションは\n選択肢:\n(A) 右ミッドフィールダー\n(B) 右ウイング\n(C) フルバック\n(D) 左ミッドフィールダー\n(E) チアリーダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黒色のボール、ボブは茶色のボール、クレアは青色のボール、デイブは緑色のボール、イヴは黄色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずイヴとクレアがボールを交換します。次にボブとデイブがボールを交換します。続いてイヴとアリスがボールを交換します。その後クレアとボブがボールを交換します。最後にアリスとイヴがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) 黒色のボール\n(B) 茶色のボール\n(C) 青色のボール\n(D) 緑色のボール\n(E) 黄色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはベンチウォーマー、ボブはゴールキーパー、クレアは左ミッドフィールダー、デイブはフルバック、イヴはセンターミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとボブがポジションを交代します。次にアリスとイヴがポジションを交代します。続いてデイブとボブがポジションを交代します。さらにデイブとイヴがポジションを交代します。最後にクレアとボブがポジションを交代します。試合終了時、イヴがプレーしているポジションは\n選択肢:\n(A) ベンチウォーマー\n(B) ゴールキーパー\n(C) 左ミッドフィールダー\n(D) フルバック\n(E) センターミッドフィールダー", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きのグループです。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『ロリータ』、クレアは『ユリシーズ』、デイブは『フランケンシュタイン』、イヴは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてボブとイヴが本を交換します。その後デイブとアリスが本を交換します。最後にデイブとボブが本を交換します。学期終了時、アリスが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『ロリータ』\n(C) 『ユリシーズ』\n(D) 『フランケンシュタイン』\n(E) 『真珠』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはカールと、クレアはパトリックと、デイブはサムと、イヴはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとアリスがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてボブとデイブがパートナーを交代します。さらにボブとイヴがパートナーを交代します。最後にボブとクレアがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ローラと踊っている\n(B) カールと踊っている\n(C) パトリックと踊っている\n(D) サムと踊っている\n(E) ヘルガと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はサッカーの同一チームに所属しています。試合開始時、各プレイヤーはそれぞれのポジションに配置されています：アリスはフォワード、ボブはセンターミッドフィールダー、クレアはサイドバック、デイブは右ウィング、イヴは左ミッドフィールダーです。\nゲームが進むにつれて、プレイヤーたちは時折ポジションを交換します。まずアリスとイヴがポジションを交換します。次にクレアとボブがポジションを交換します。続いてイヴとボブがポジションを交換します。その後、ボブとデイブがポジションを交換します。最後にイヴとデイブがポジションを交換します。試合終了時、クレアがプレーしているポジションは\n選択肢:\n(A) フォワード\n(B) センターミッドフィールダー\n(C) サイドバック\n(D) 右ウィング\n(E) 左ミッドフィールダー", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブは黒色のボール、クレアは緑色のプレゼント、デイブは紫色のプレゼント、イヴは黄色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずボブとデイブがプレゼントを交換します。次にボブとイヴがプレゼントを交換します。続いてデイブとクレアがプレゼントを交換します。その後デイブとボブがプレゼントを交換します。最後にアリスとデイブがプレゼントを交換します。イベント終了時、イヴが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) 黒色のボール\n(C) 緑色のプレゼント\n(D) 紫色のプレゼント\n(E) 黄色のプレゼント", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『グレート・ギャツビー』、ボブは『キャッチ=22』、クレアは『真珠』、デイブは『指輪物語』、イヴは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとクレアが本を交換します。次にボブとイヴが本を交換します。続いてクレアとデイブが本を交換します。その後ボブとイヴが再び本を交換します。最後にアリスとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『グレート・ギャツビー』\n(B) 『キャッチ=22』\n(C) 『真珠』\n(D) 『指輪物語』\n(E) 『バスカヴィル家の犬』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはロドリゴと、クレアはメリッサと、デイブはパトリックと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずイヴとボブがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてデイブとイヴがパートナーを交代します。その後イヴとクレアがパートナーを交代します。最後にアリスとクレアがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) ヘルガ\n(B) ロドリゴ\n(C) メリッサ\n(D) パトリック\n(E) ジェイミー", "target": "(E)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは黄色のボール、ボブは青色のボール、クレアはピンク色のボール、デイブは白色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとアリスがボールを交換します。次にイヴとボブがボールを交換します。続いてボブとデイブがボールを交換します。その後クレアとイヴがボールを交換します。最後にアリスとデイブがボールを交換します。ゲーム終了時、デイブが持っているボールは\n選択肢:\n(A) 黄色のボール\n(B) 青色のボール\n(C) ピンク色のボール\n(D) 白色のボール\n(E) 赤色のボール", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスは青色のボール、ボブは紫色のボール、クレアは赤色のボール、デイブは茶色のボール、イヴは黒色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずクレアとデイブがボールを交換します。次にイヴとクレアがボールを交換します。続いてボブとアリスがボールを交換します。その後デイブとクレアがボールを交換します。最後にイヴとボブがボールを交換します。ゲーム終了時、ボブが持っているボールは\n選択肢:\n(A) 青色のボール\n(B) 紫色のボール\n(C) 赤色のボール\n(D) 茶色のボール\n(E) 黒色のボール", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はゲームをしています。ゲーム開始時、各プレイヤーはそれぞれ1個のボールを持っています：アリスはオレンジ色のボール、ボブは黒色のボール、クレアはピンク色のボール、デイブは白色のボール、イヴは赤色のボールです。\nゲームが進むにつれて、プレイヤーたちはペアを組んでボールを交換します。まずアリスとデイブがボールを交換します。次にボブとクレアがボールを交換します。続いてクレアとデイブがボールを交換します。その後デイブとボブがボールを交換します。最後にアリスとイヴがボールを交換します。ゲーム終了時、クレアが持っているボールは\n選択肢:\n(A) オレンジ色のボール\n(B) 黒色のボール\n(C) ピンク色のボール\n(D) 白色のボール\n(E) 赤色のボール", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『真珠』、ボブは『バスカヴィル家の犬』、クレアは『白鯨』、デイブは『ロリータ』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとアリスが本を交換します。次にクレアとデイブが本を交換します。続いてイヴとデイブが本を交換します。その後ボブとデイブが本を交換し、最後にイヴとボブが本を交換します。学期終了時、クレアが持っている本は\n選択肢:\n(A) 『真珠』\n(B) 『バスカヴィル家の犬』\n(C) 『白鯨』\n(D) 『ロリータ』\n(E) 『オデュッセイア』", "target": "(D)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はホワイト・エレファント・ギフト・エクスチェンジを行っています。イベント開始時、各参加者はそれぞれ異なる色のプレゼントを持っています：アリスは茶色のプレゼント、ボブはオレンジ色のボール、クレアは緑色のプレゼント、デイブは青色のプレゼント、イヴは白色のプレゼントです。\nイベントが進むにつれ、人々はペアを組んでプレゼントを交換します。まずイヴとボブがプレゼントを交換します。次にイヴとクレアがプレゼントを交換します。続いてイヴとデイブがプレゼントを交換します。その後、デイブとアリスがプレゼントを交換します。最後にクレアとデイブがプレゼントを交換します。イベント終了時、クレアが持っているプレゼントは\n選択肢:\n(A) 茶色のプレゼント\n(B) オレンジ色のボール\n(C) 緑色のプレゼント\n(D) 青色のプレゼント\n(E) 白色のプレゼント", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『ユリシーズ』、ボブは『白鯨』、クレアは『キャッチ=22』、デイブは『フランケンシュタイン』、イヴは『バスカヴィル家の犬』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとクレアが本を交換します。次にアリスとボブが本を交換します。続いてデイブとアリスが本を交換します。その後ボブとデイブが本を交換します。最後にイヴとボブが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『ユリシーズ』\n(B) 『白鯨』\n(C) 『キャッチ=22』\n(D) 『フランケンシュタイン』\n(E) 『バスカヴィル家の犬』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはカールと、クレアはパトリックと、デイブはメリッサと、イヴはジェイミーと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずクレアとイヴがパートナーを交代します。次にイヴとデイブがパートナーを交代します。続いてデイブとクレアがパートナーを交代します。その後クレアとボブがパートナーを交代します。最後にデイブとアリスがパートナーを交代します。ダンスが終わる時点で、ボブは\n選択肢:\n(A) ローラと踊っている\n(B) カールと踊っている\n(C) パトリックと踊っている\n(D) メリッサと踊っている\n(E) ジェイミーと踊っている", "target": "(C)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはパトリックと、ボブはサムと、クレアはジェイミーと、デイブはローラと、イヴはメリッサと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとイヴがパートナーを交代します。次にデイブとアリスがパートナーを交代します。続いてイヴとアリスがパートナーを交代します。その後クレアとボブがパートナーを交代します。最後にデイブとアリスがパートナーを交代します。ダンスが終わる時点で、クレアのパートナーは\n選択肢:\n(A) パトリック\n(B) サム\n(C) ジェイミー\n(D) ローラ\n(E) メリッサ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で、読書好きの仲間です。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『白鯨』、クレアは『バスカヴィル家の犬』、デイブは『ロリータ』、イヴは『オデュッセイア』です。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずイヴとボブが本を交換します。次にアリスとクレアが本を交換します。続いてアリスとデイブが本を交換します。その後クレアとデイブが本を交換します。最後にボブとクレアが本を交換します。学期終了時、デイブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『白鯨』\n(C) 『バスカヴィル家の犬』\n(D) 『ロリータ』\n(E) 『オデュッセイア』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはジェイミーと、ボブはパトリックと、クレアはオフィーリアと、デイブはメリッサと、イヴはロドリゴと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずデイブとボブがパートナーを交代します。次にクレアとデイブがパートナーを交代します。続いてイヴとアリスがパートナーを交代します。その後クレアとイヴがパートナーを交代します。最後にアリスとイヴがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ジェイミー\n(B) パトリック\n(C) オフィーリア\n(D) メリッサ\n(E) ロドリゴ", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴは友人同士で読書好き、時折本を交換し合っています。学期の初めに、それぞれが新しい本を1冊購入します：アリスは『キャッチ=22』、ボブは『ロリータ』、クレアは『ユリシーズ』、デイブは『フランケンシュタイン』、イヴは『真珠』を購入します。\n学期が進むにつれ、彼らは新しい本を交換し始めます。まずボブとクレアが本を交換します。次にイヴとクレアが本を交換します。続いてボブとイヴが本を交換します。その後デイブとアリスが本を交換します。最後にデイブとボブが本を交換します。学期終了時、ボブが持っている本は\n選択肢:\n(A) 『キャッチ=22』\n(B) 『ロリータ』\n(C) 『ユリシーズ』\n(D) 『フランケンシュタイン』\n(E) 『真珠』", "target": "(A)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはヘルガと、ボブはカールと、クレアはメリッサと、デイブはオフィーリアと、イヴはサムと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずアリスとデイブがパートナーを交代します。次にイヴとアリスがパートナーを交代します。続いてボブとクレアがパートナーを交代します。その後アリスとクレアがパートナーを交代します。最後にデイブとイヴがパートナーを交代します。ダンスが終わる時点で、アリスのパートナーは\n選択肢:\n(A) ヘルガ\n(B) カール\n(C) メリッサ\n(D) オフィーリア\n(E) サム", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはローラと、ボブはメリッサと、クレアはジェイミーと、デイブはロドリゴと、イヴはヘルガと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとイヴがパートナーを交代します。次にアリスとデイブがパートナーを交代します。続いてイヴとボブがパートナーを交代します。さらにイヴとクレアがパートナーを交代します。最後にデイブとボブがパートナーを交代します。ダンスが終わる時点で、デイブは\n選択肢:\n(A) ローラ\n(B) メリッサ\n(C) ジェイミー\n(D) ロドリゴ\n(E) ヘルガ\nと踊っています。", "target": "(B)"}
{"input": "アリス、ボブ、クレア、デイブ、イヴの5人はスクウェアダンスのダンサーです。曲の開始時、各ダンサーにはパートナーがいます：アリスはロドリゴと、ボブはサムと、クレアはイジーと、デイブはジェイミーと、イヴはオフィーリアと踊っています。\n曲の間中、ダンサーたちはしばしばパートナーを交換します。まずボブとイヴがパートナーを交代します。次にアリスとボブがパートナーを交代します。続いてイヴとボブがパートナーを交代します。その後デイブとアリスがパートナーを交代します。最後にイヴとクレアがパートナーを交代します。ダンス終了時、アリスは\n選択肢:\n(A) ロドリゴと踊っている\n(B) サムと踊っている\n(C) イジーと踊っている\n(D) ジェイミーと踊っている\n(E) オフィーリアと踊っている", "target": "(D)"}
