{"input": "問題：シェリーは真実を語ります。バーネルは「シェリーは真実を語る」と言います。アレクシスは「バーネルは嘘をついている」と言います。ミカエラは「アレクシスは真実を語る」と言います。エレノアは「ミカエラは真実を語る」と言います。エレノアは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティアンは嘘をつきます。シェリーは「クリスティアンは嘘をついている」と言います。デルバートは「シェリーは嘘をついている」と言います。ジェリーは「デルバートは真実を語っている」と言います。シャロンダは「ジェリーは真実を語っている」と言います。シャロンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ビナは真実を語ります。ヘレーヌは「ビナは嘘をついている」と言います。カンディは「ヘレーヌは真実を語る」と言います。ジェイミーは「カンディは嘘をついている」と言います。カは「ジェイミーは嘘をついている」と言います。カは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティは真実を語ります。カは「クリスティは真実を語る」と言います。デルバートは「カは嘘をついている」と言います。レーダは「デルバートは真実を語る」と言います。ロリーンは「レーダは真実を語る」と言います。ロリーンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：タミカは嘘をつきます。レイモンドは「タミカは真実を語る」と言います。ウィリアムは「レイモンドは真実を語る」と言います。ショーンダは「ウィリアムは嘘をついている」と言います。エレオノールは「ショーンダは真実を語る」と言います。エレオノールは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーネルは真実を語ります。カンディは「バーネルは真実を語る」と言います。アレクシスは「カンディは真実を語る」と言います。シマは「アレクシスは嘘をついている」と言います。フィービーは「シマは真実を語る」と言います。フィービーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シャロンダは嘘をつきます。テレサは「シャロンダは真実を語る」と言います。タミカは「テレサは嘘をついている」と言います。ロリーンは「タミカは真実を語る」と言います。ジェイミーは「ロリーンは嘘をついている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは嘘をつきます。クリスティアは「ジムは嘘をついている」と言います。バーネルは「クリスティアは真実を語っている」と言います。バーニタは「バーネルは真実を語っている」と言います。ミリセントは「バーニタは真実を語っている」と言います。ミリセントは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは真実を語ります。コンセプションは「フレッチャーは真実を語る」と言います。ベルニータは「コンセプションは真実を語る」と言います。ジェイミーは「ベルニータは真実を語る」と言います。テレッサは「ジェイミーは嘘をついている」と言います。テレッサは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ラシダは真実を語ります。ジムは「ラシダは嘘をついている」と言います。アレハンドロは「ジムは嘘をついている」と言います。タミカは「アレハンドロは真実を語っている」と言います。フィデルは「タミカは嘘をついている」と言います。フィデルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは嘘をつきます。ミリセントは「ジェリーは真実を語る」と言います。サルは「ミリセントは真実を語る」と言います。アンバーリーは「サルは真実を語る」と言います。シェナは「アンバーリーは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オードリーは嘘をつきます。コンセプションは「オードリーは嘘をついている」と言います。テレッサは「コンセプションは真実を語っている」と言います。デルフィーナは「テレッサは嘘をついている」と言います。エレーヌは「デルフィーナは真実を語っている」と言います。エレーヌは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリーは真実を語ります。ミリセントは「ミリーは嘘をついている」と言います。フィービーは「ミリセントは真実を語っている」と言います。シェリーは「フィービーは嘘をついている」と言います。レイモンドは「シェリーは真実を語っている」と言います。レイモンドは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：インガは真実を語ります。シェナは「インガは嘘をついている」と言います。ラシダは「シェナは真実を語っている」と言います。カは「ラシダは真実を語っている」と言います。シャロンダは「カは真実を語っている」と言います。シャロンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アンバーリーは嘘をつきます。シェナは「アンバーリーは真実を語る」と言います。ウィリアムは「シェナは真実を語る」と言います。レイモンドは「ウィリアムは嘘をついている」と言います。サルは「レイモンドは嘘をついている」と言います。サルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは嘘をつきます。インガは「ウィリアムは真実を語る」と言います。フィデルは「インガは嘘をついている」と言います。グウェンは「フィデルは真実を語る」と言います。クリスティアは「グウェンは真実を語る」と言います。クリスティアは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カは嘘をつきます。クリスティーは「カは真実を語る」と言います。ジェリーは「クリスティーは嘘をついている」と言います。クリスティーナは「ジェリーは嘘をついている」と言います。ヨランダは「クリスティーナは真実を語っている」と言います。ヨランダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：カは嘘をつきます。アンドレは「カは真実を語る」と言います。オードリーは「アンドレは嘘をついている」と言います。アントワンは「オードリーは真実を語る」と言います。ミリーは「アントワンは真実を語っている」と言います。ミリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：シャロンダは真実を語ります。アレクシスは「シャロンダは真実を語る」と言います。クリスティーは「アレクシスは嘘をついている」と言います。インガは「クリスティーは真実を語る」と言います。クリスタは「インガは真実を語る」と言います。クリスタは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：フィデルは嘘をつきます。サルは「フィデルは真実を語る」と言います。オスバルドは「サルは嘘をついている」と言います。アレクシスは「オスバルドは嘘をついている」と言います。ミリーは「アレクシスは真実を語っている」と言います。ミリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：レイモンドは真実を語ります。サルは「レイモンドは嘘をついている」と言います。アレクシスは「サルは嘘をついている」と言います。エレインは「アレクシスは嘘をついている」と言います。エラノールは「エレインは嘘をついている」と言います。エラノールは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ライアンは真実を語ります。サルは「ライアンは真実を語る」と言います。レーダは「サルは真実を語る」と言います。ラシダは「レーダは真実を語る」と言います。アレハンドロは「ラシダは真実を語る」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：司馬は嘘をつきます。ミリーは「司馬は真実を語る」と言います。ジェリーは「ミリーは真実を語る」と言います。ビナは「ジェリーは嘘をついている」と言います。メイベルは「ビナは真実を語る」と言います。メイベルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィービーは真実を語ります。クリスティーは「フィービーは真実を語る」と言います。フレッチャーは「クリスティーは真実を語る」と言います。アンバーリーは「フレッチャーは嘘をついている」と言います。レイモンドは「アンバーリーは真実を語っている」と言います。レイモンドは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：デルフィーナは真実を語ります。フレッチャーは「デルフィーナは嘘をついている」と言います。アンバーリーは「フレッチャーは嘘をついている」と言います。オードリーは「アンバーリーは真実を語っている」と言います。ロリーンは「オードリーは真実を語っている」と言います。ロリーンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アンバーリーは真実を語ります。ジェイミーは「アンバーリーは真実を語る」と言います。シャロンダは「ジェイミーは嘘をついている」と言います。アントワンは「シャロンダは真実を語る」と言います。アレハンドロは「アントワンは嘘をついている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：レーダは真実を語ります。アレクシスは「レーダは嘘をついている」と言います。サルは「アレクシスは嘘をついている」と言います。フィービーは「サルは真実を語っている」と言います。グウェンは「フィービーは真実を語っている」と言います。グウェンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは嘘をつきます。フィービーは「フレッチャーは真実を語る」と言います。ビナは「フィービーは真実を語る」と言います。アンドレは「ビナは真実を語る」と言います。ウィリアムは「アンドレは真実を語る」と言います。ウィリアムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ライアンは嘘をつきます。クリスティアンは「ライアンは嘘をついている」と言います。テレッサは「クリスティアンは真実を語っている」と言います。アンバーリーは「テレッサは真実を語っている」と言います。ジェイミーは「アンバーリーは真実を語っている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：シャロンダは嘘をつきます。ジェイミーは「シャロンダは真実を語る」と言います。レイモンドは「ジェイミーは嘘をついている」と言います。オードリーは「レイモンドは嘘をついている」と言います。シェリーは「オードリーは嘘をついている」と言います。シェリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カンディは真実を語ります。ミカエラは「カンディは嘘をついている」と言います。バーネルは「ミカエラは嘘をついている」と言います。アントワンは「バーネルは真実を語っている」と言います。サルは「アントワンは嘘をついている」と言います。サルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オードリーは嘘をつきます。シェリーは「オードリーは嘘をついている」と言います。ウィリアムは「シェリーは真実を語っている」と言います。コンセプションは「ウィリアムは真実を語っている」と言います。グウェンは「コンセプションは嘘をついている」と言います。グウェンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：デルフィーナは真実を語ります。ウィリアンは「デルフィーナは真実を語る」と言います。クリスティアは「ウィリアンは嘘をついている」と言います。シャロンダは「クリスティアは嘘をついている」と言います。シェナは「シャロンダは真実を語っている」と言います。シェナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェリーは嘘をつきます。ヘレーヌは「ジェリーは嘘をついている」と言います。アレクシスは「ヘレーヌは真実を語っている」と言います。シェリーは「アレクシスは真実を語っている」と言います。マイケルは「シェリーは真実を語っている」と言います。マイケルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィデルは真実を語ります。タミカは「フィデルは嘘をついている」と言います。シェナは「タミカは嘘をついている」と言います。オードリーは「シェナは嘘をついている」と言います。ジムは「オードリーは真実を語っている」と言います。ジムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アンドレは真実を語ります。オードリーは「アンドレは真実を語る」と言います。ジェリーは「オードリーは嘘をついている」と言います。ヘレーヌは「ジェリーは嘘をついている」と言います。ベルニタは「ヘレーヌは真実を語っている」と言います。ベルニタは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィデルは嘘をつきます。フレッチャーは「フィデルは真実を語る」と言います。ヨランダは「フレッチャーは嘘をついている」と言います。レイモンドは「ヨランダは嘘をついている」と言います。レーダは「レイモンドは嘘をついている」と言います。レーダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：タミカは真実を語ります。カは「タミカは真実を語る」と言います。フィデルは「カは真実を語る」と言います。エレノアは「フィデルは真実を語る」と言います。アンバーリーは「エレノアは真実を語る」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：メイベルは嘘をつきます。ジェイミーは「メイベルは真実を語る」と言います。フィービーは「ジェイミーは嘘をついている」と言います。ウィリアムは「フィービーは嘘をついている」と言います。シャロンダは「ウィリアムは嘘をついている」と言います。シャロンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは嘘をつきます。バーネルは「ジェイミーは真実を語る」と言います。ミリセントは「バーネルは嘘をついている」と言います。ラシダは「ミリセントは真実を語っている」と言います。ビナは「ラシダは真実を語っている」と言います。ビナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アレハンドロは嘘をつきます。アンバーリーは「アレハンドロは真実を語る」と言います。オスバルドは「アンバーリーは嘘をついている」と言います。バーネルは「オスバルドは嘘をついている」と言います。シェナは「バーネルは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィデルは真実を語ります。カンディは「フィデルは嘘をついている」と言います。クリスティーは「カンディは真実を語る」と言います。レーダは「クリスティーは嘘をついている」と言います。シマは「レーダは嘘をついている」と言います。シマは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェイミーは真実を語ります。ミリセントは「ジェイミーは嘘をついている」と言います。ミリーは「ミリセントは真実を語っている」と言います。ビナは「ミリーは嘘をついている」と言います。レーダは「ビナは真実を語っている」と言います。レーダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは真実を語ります。ヘレーヌは「フレッチャーは嘘をついている」と言います。エレノアは「ヘレーヌは真実を語っている」と言います。ヨランドは「エレノアは真実を語っている」と言います。オードリーは「ヨランドは嘘をついている」と言います。オードリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ミリセントは嘘をつきます。アレクシスは「ミリセントは嘘をついている」と言います。インガは「アレクシスは真実を語っている」と言います。クリスティーは「インガは嘘をついている」と言います。グウェンは「クリスティーは嘘をついている」と言います。グウェンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：シマは真実を語ります。ヨランダは「シマは嘘をついている」と言います。アンバーリーは「ヨランダは真実を語る」と言います。インガは「アンバーリーは嘘をついている」と言います。アレクシスは「インガは真実を語る」と言います。アレクシスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ミリーは真実を語ります。ミリセントは「ミリーは真実を語る」と言います。レイモンドは「ミリセントは真実を語る」と言います。クリスティアは「レイモンドは嘘をついている」と言います。カは「クリスティアは真実を語っている」と言います。カは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミカエラは嘘をつきます。ミリセントは「ミカエラは嘘をついている」と言います。デルバートは「ミリセントは嘘をついている」と言います。ベルニータは「デルバートは嘘をついている」と言います。テレサは「ベルニータは真実を語っている」と言います。テレサは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オードリーは真実を語ります。ヨランダは「オードリーは嘘をついている」と言います。ショーンダは「ヨランダは真実を語る」と言います。レイモンドは「ショーンダは嘘をついている」と言います。メイベルは「レイモンドは嘘をついている」と言います。メイベルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：フレッチャーは嘘をつきます。テレサは「フレッチャーは嘘をついている」と言います。バーネルは「テレサは嘘をついている」と言います。ダラスは「バーネルは嘘をついている」と言います。ミリセントは「ダラスは真実を語っている」と言います。ミリセントは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ラシダは真実を語ります。ウィリアムは「ラシダは嘘をついている」と言います。クリスティーは「ウィリアムは嘘をついている」と言います。ライアンは「クリスティーは嘘をついている」と言います。ショーンダは「ライアンは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：エレノアは真実を語ります。カは「エレノアは嘘をついている」と言います。デルバートは「カは真実を語っている」と言います。ミカエラは「デルバートは嘘をついている」と言います。シェリーは「ミカエラは嘘をついている」と言います。シェリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アンドレは嘘をつきます。アンバーリーは「アンドレは真実を語る」と言います。グウェンは「アンバーリーは真実を語る」と言います。ウィリアムは「グウェンは嘘をついている」と言います。アレクシスは「ウィリアムは真実を語る」と言います。アレクシスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーニタは真実を語ります。マイケルは「バーニタは真実を語る」と言います。フィデルは「マイケルは嘘をついている」と言います。ダラスは「フィデルは真実を語る」と言います。ミリセントは「ダラスは嘘をついている」と言います。ミリセントは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは真実を語ります。カは「フレッチャーは真実を語る」と言います。エレノアは「カは嘘をついている」と言います。バーネルは「エレノアは嘘をついている」と言います。デルフィナは「バーネルは真実を語っている」と言います。デルフィナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カンディは真実を語ります。アレハンドロは「カンディは真実を語る」と言います。ミリセントは「アレハンドロは嘘をついている」と言います。シャロンダは「ミリセントは嘘をついている」と言います。コンセプションは「シャロンダは嘘をついている」と言います。コンセプションは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリセントは真実を語ります。ミリーは「ミリセントは真実を語る」と言います。マイケルは「ミリーは真実を語る」と言います。アントワンは「マイケルは嘘をついている」と言います。アレクシスは「アントワンは真実を語っている」と言います。アレクシスは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは嘘をつきます。ヘレーヌは「ジェリーは嘘をついている」と言います。カンディは「ヘレーヌは真実を語っている」と言います。ジェイミーは「カンディは嘘をついている」と言います。シャロンダは「ジェイミーは嘘をついている」と言います。シャロンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：タミカは真実を語ります。シマは「タミカは真実を語る」と言います。ラシダは「シマは嘘をついている」と言います。デルフィナは「ラシダは嘘をついている」と言います。ジェリーは「デルフィナは嘘をついている」と言います。ジェリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：カは真実を語ります。フレッチャーは「カは真実を語る」と言います。メイベルは「フレッチャーは嘘をついている」と言います。ロリーンは「メイベルは嘘をついている」と言います。クリスティアは「ロリーンは真実を語っている」と言います。クリスティアは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：デルバートは真実を語ります。デルフィナは「デルバートは嘘をついている」と言います。アントワンは「デルフィナは真実を語っている」と言います。ヘレーヌは「アントワンは嘘をついている」と言います。シマは「ヘレーヌは嘘をついている」と言います。シマは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：メイベルは真実を語ります。ベルニタは「メイベルは真実を語る」と言います。インガは「ベルニタは真実を語る」と言います。タミカは「インガは嘘をついている」と言います。ヘレーヌは「タミカは真実を語る」と言います。ヘレーヌは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：デルフィーナは嘘をつきます。レーダは「デルフィーナは嘘をついている」と言います。フィデルは「レーダは嘘をついている」と言います。サルは「フィデルは真実を語っている」と言います。アンドレーは「サルは嘘をついている」と言います。アンドレーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェリーは真実を語ります。エレノアは「ジェリーは真実を語る」と言います。グウェンは「エレノアは真実を語る」と言います。キャンディは「グウェンは真実を語る」と言います。ダラスは「キャンディは真実を語る」と言います。ダラスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：クリスティアは嘘をつきます。マイケルは「クリスティアは真実を語る」と言います。オードリーは「マイケルは嘘をついている」と言います。シェリーは「オードリーは嘘をついている」と言います。ミカエラは「シェリーは真実を語る」と言います。ミカエラは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは嘘をつきます。カは「ジムは嘘をついている」と言います。ジェリーは「カは真実を語っている」と言います。フレッチャーは「ジェリーは真実を語っている」と言います。カンディは「フレッチャーは嘘をついている」と言います。カンディは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シマは真実を語ります。ミカエラは「シマは嘘をついている」と言います。レーダは「ミカエラは真実を語っている」と言います。フレッチャーは「レーダは嘘をついている」と言います。ビナは「フレッチャーは真実を語っている」と言います。ビナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーネルは嘘をつきます。グウェンは「バーネルは嘘をついている」と言います。テレサは「グウェンは嘘をついている」と言います。バーニタは「テレサは真実を語っている」と言います。クリスティーは「バーニタは嘘をついている」と言います。クリスティーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィデルは嘘をつきます。マイケルは「フィデルは嘘をついている」と言います。フレッチャーは「マイケルは嘘をついている」と言います。インガは「フレッチャーは真実を語っている」と言います。アンドレーは「インガは嘘をついている」と言います。アンドレーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィービーは真実を語ります。ジェイミーは「フィービーは嘘をついている」と言います。オードリーは「ジェイミーは真実を語っている」と言います。ミカエラは「オードリーは嘘をついている」と言います。ビナは「ミカエラは嘘をついている」と言います。ビナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：キャンディは嘘をつきます。フィービーは「キャンディは真実を語る」と言います。ヨランダは「フィービーは真実を語る」と言います。フレッチャーは「ヨランダは嘘をついている」と言います。ロリーンは「フレッチャーは真実を語っている」と言います。ロリーンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カンディは真実を語ります。クリスタは「カンディは嘘をついている」と言います。ライアンは「クリスタは真実を語っている」と言います。グウェンは「ライアンは真実を語っている」と言います。デルフィナは「グウェンは真実を語っている」と言います。デルフィナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリセントは嘘をつきます。シェナは「ミリセントは嘘をついている」と言います。ウィリアムは「シェナは真実を語っている」と言います。カンディは「ウィリアムは嘘をついている」と言います。バーネルは「カンディは嘘をついている」と言います。バーネルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは真実を語ります。レイモンドは「ジェイミーは嘘をついている」と言います。オードリーは「レイモンドは嘘をついている」と言います。ミカエラは「オードリーは嘘をついている」と言います。ラシダは「ミカエラは嘘をついている」と言います。ラシダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オスバルドは真実を語ります。アンドレは「オスバルドは真実を語る」と言います。ウィリアンは「アンドレは嘘をついている」と言います。ビナは「ウィリアンは真実を語る」と言います。ジェイミーは「ビナは真実を語る」と言います。ジェイミーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：レーダは真実を語ります。シャロンダは「レーダは嘘をついている」と言います。シェナは「シャロンダは真実を語っている」と言います。クリスティーは「シェナは嘘をついている」と言います。クリスティアは「クリスティーは真実を語っている」と言います。クリスティアは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：コンセプションは真実を語ります。テレッサは「コンセプションは嘘をついている」と言います。サルは「テレッサは真実を語る」と言います。フィデルは「サルは真実を語る」と言います。シェナは「フィデルは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ライアンは真実を語ります。ヘレーヌは「ライアンは真実を語る」と言います。カンディは「ヘレーヌは真実を語る」と言います。インガは「カンディは真実を語る」と言います。デルバートは「インガは嘘をついている」と言います。デルバートは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ライアンは嘘をつきます。クリスティーは「ライアンは嘘をついている」と言います。アンバーリーは「クリスティーは真実を語っている」と言います。シェナは「アンバーリーは真実を語っている」と言います。ジェイミーは「シェナは嘘をついている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティアンは真実を語ります。ダラスは「クリスティアンは真実を語る」と言います。オスバルドは「ダラスは嘘をついている」と言います。ミリーは「オスバルドは真実を語る」と言います。ビナは「ミリーは真実を語る」と言います。ビナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティは真実を語ります。ジェイミーは「クリスティは真実を語る」と言います。マイケルは「ジェイミーは嘘をついている」と言います。ラシダは「マイケルは真実を語る」と言います。テレッサは「ラシダは真実を語っている」と言います。テレッサは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ラシダは嘘をつきます。ライアンは「ラシダは真実を語る」と言います。バーネルは「ライアンは真実を語る」と言います。ショーンダは「バーネルは嘘をついている」と言います。アンバーリーは「ショーンダは嘘をついている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エラノールは嘘をつきます。タミカは「エラノールは嘘をついている」と言います。カは「タミカは真実を語っている」と言います。ショーンダは「カは嘘をついている」と言います。コンセプションは「ショーンダは嘘をついている」と言います。コンセプションは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレッサは嘘をつきます。ウィリアムは「テレッサは嘘をついている」と言います。ジェイミーは「ウィリアムは嘘をついている」と言います。ライアンは「ジェイミーは嘘をついている」と言います。カンディは「ライアンは嘘をついている」と言います。カンディは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オードリーは嘘をつきます。ジェイミーは「オードリーは真実を語る」と言います。フィービーは「ジェイミーは嘘をついている」と言います。コンセプションは「フィービーは真実を語っている」と言います。マイケルは「コンセプションは嘘をついている」と言います。マイケルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ベルニタは真実を語ります。オードリーは「ベルニタは嘘をついている」と言います。デルフィナは「オードリーは真実を語る」と言います。ビナは「デルフィナは嘘をついている」と言います。サルは「ビナは真実を語る」と言います。サルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは嘘をつきます。レイモンドは「ジェイミーは嘘をついている」と言います。カは「レイモンドは嘘をついている」と言います。ベルニタは「カは真実を語っている」と言います。テレッサは「ベルニタは嘘をついている」と言います。テレッサは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレッサは嘘をつきます。クリスティアンは「テレッサは嘘をついている」と言います。サルは「クリスティアンは真実を語っている」と言います。オードリーは「サルは嘘をついている」と言います。レーダーは「オードリーは嘘をついている」と言います。レーダーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：エレネは真実を語ります。ロリーンは「エレネは嘘をついている」と言います。レイモンドは「ロリーンは真実を語る」と言います。カは「レイモンドは真実を語る」と言います。クリスティーは「カは真実を語っている」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ライアンは嘘をつきます。キャンディは「ライアンは嘘をついている」と言います。ロリーンは「キャンディは嘘をついている」と言います。クリスティーは「ロリーンは真実を語っている」と言います。フレッチャーは「クリスティーは嘘をついている」と言います。フレッチャーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは嘘をつきます。グウェンは「ジェイミーは真実を語る」と言います。ヨランダは「グウェンは真実を語る」と言います。カンディは「ヨランダは真実を語る」と言います。オスバルドは「カンディは真実を語る」と言います。オスバルドは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アントワンは真実を語ります。ヘレーヌは「アントワンは真実を語る」と言います。グウェンは「ヘレーヌは真実を語る」と言います。サルは「グウェンは真実を語る」と言います。ショーンダは「サルは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは真実を語ります。タミカは「ジムは真実を語る」と言います。ヘレーヌは「タミカは真実を語る」と言います。ジェイミーは「ヘレーヌは真実を語る」と言います。コンセプションは「ジェイミーは真実を語る」と言います。コンセプションは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：司馬は真実を語ります。ジムは「司馬は嘘をついている」と言います。グウェンは「ジムは真実を語っている」と言います。フィービーは「グウェンは真実を語っている」と言います。ラシダは「フィービーは嘘をついている」と言います。ラシダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは真実を語ります。デルフィーナは「ジェイミーは嘘をついている」と言います。ビナは「デルフィーナは真実を語っている」と言います。テレサは「ビナは真実を語っている」と言います。コンセプションは「テレサは嘘をついている」と言います。コンセプションは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィービーは真実を語ります。ヘレーヌは「フィービーは嘘をついている」と言います。シマは「ヘレーヌは嘘をついている」と言います。アレハンドロは「シマは真実を語っている」と言います。ミカエラは「アレハンドロは嘘をついている」と言います。ミカエラは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：司馬は真実を語ります。テレッサは「司馬は真実を語る」と言います。ビナは「テレッサは嘘をついている」と言います。クリスティアは「ビナは嘘をついている」と言います。フィービーは「クリスティアは真実を語る」と言います。フィービーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは嘘をつきます。ミカエラは「ジェイミーは真実を語る」と言います。ミリセントは「ミカエラは嘘をついている」と言います。エレノアは「ミリセントは真実を語っている」と言います。ラシダは「エレノアは嘘をついている」と言います。ラシダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリセントは真実を語ります。アレクシスは「ミリセントは嘘をついている」と言います。ジェイミーは「アレクシスは嘘をついている」と言います。ウィリアムは「ジェイミーは真実を語っている」と言います。レーダは「ウィリアムは嘘をついている」と言います。レーダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェイミーは嘘をつきます。クリスティーは「ジェイミーは真実を語る」と言います。アレハンドロは「クリスティーは嘘をついている」と言います。グウェンは「アレハンドロは真実を語る」と言います。サルは「グウェンは嘘をついている」と言います。サルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：マイケルは嘘をつきます。レーダは「マイケルは嘘をついている」と言います。デルバートは「レーダは真実を語っている」と言います。タミカは「デルバートは真実を語っている」と言います。フィデルは「タミカは嘘をついている」と言います。フィデルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：レーダは真実を語ります。ビナは「レーダは嘘をついている」と言います。デルフィーナは「ビナは真実を語る」と言います。アレハンドロは「デルフィーナは嘘をついている」と言います。ショーンダは「アレハンドロは真実を語る」と言います。ショーンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アンドレは嘘をつきます。デルフィナは「アンドレは嘘をついている」と言います。ジムは「デルフィナは真実を語っている」と言います。グウェンは「ジムは嘘をついている」と言います。デルバートは「グウェンは嘘をついている」と言います。デルバートは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アンドレは嘘をつきます。ジェイミーは「アンドレは嘘をついている」と言います。ショーンダは「ジェイミーは嘘をついている」と言います。デルフィナは「ショーンダは嘘をついている」と言います。クリスティーは「デルフィナは嘘をついている」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティアは真実を語ります。シャロンダは「クリスティアは嘘をついている」と言います。ミリセントは「シャロンダは嘘をついている」と言います。バーネルは「ミリセントは嘘をついている」と言います。インガは「バーネルは真実を語っている」と言います。インガは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：コンセプションは真実を語ります。エレノアは「コンセプションは真実を語る」と言います。アレクシスは「エレノアは真実を語る」と言います。フィデルは「アレクシスは真実を語る」と言います。デルバートは「フィデルは嘘をついている」と言います。デルバートは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレノアは真実を語ります。レーダは「エレノアは嘘をついている」と言います。オスバルドは「レーダは真実を語っている」と言います。ジムは「オスバルドは嘘をついている」と言います。グウェンは「ジムは嘘をついている」と言います。グウェンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ライアンは真実を語ります。ショーンダは「ライアンは真実を語る」と言います。レーダは「ショーンダは嘘をついている」と言います。テレッサは「レーダは嘘をついている」と言います。クリスティーは「テレッサは真実を語る」と言います。クリスティーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ショーンダは嘘をつきます。ライアンは「ショーンダは真実を語る」と言います。シャロンダは「ライアンは嘘をついている」と言います。ベルニタは「シャロンダは嘘をついている」と言います。ミカエラは「ベルニタは真実を語っている」と言います。ミカエラは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アレクシスは真実を語ります。シェナは「アレクシスは真実を語る」と言います。ヨランドは「シェナは真実を語る」と言います。カは「ヨランドは真実を語る」と言います。インガは「カは真実を語る」と言います。インガは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：デルフィーナは嘘をつきます。ジェリーは「デルフィーナは真実を語る」と言います。メイベルは「ジェリーは真実を語る」と言います。ダラスは「メイベルは嘘をついている」と言います。クリスティアンは「ダラスは真実を語る」と言います。クリスティアンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：グウェンは真実を語ります。アンドレは「グウェンは真実を語る」と言います。ヨランは「アンドレは嘘をついている」と言います。サルは「ヨランは嘘をついている」と言います。クリスティアは「サルは嘘をついている」と言います。クリスティアは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティアは真実を語ります。ジムは「クリスティアは嘘をついている」と言います。デルフィナは「ジムは嘘をついている」と言います。フィービーは「デルフィナは嘘をついている」と言います。ベルニータは「フィービーは真実を語っている」と言います。ベルニータは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは真実を語ります。アレハンドロは「ジムは嘘をついている」と言います。フィービーは「アレハンドロは嘘をついている」と言います。ショーンダは「フィービーは真実を語っている」と言います。カンディは「ショーンダは嘘をついている」と言います。カンディは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オスバルドは嘘をつきます。ライアンは「オスバルドは嘘をついている」と言います。アンドレは「ライアンは真実を語っている」と言います。ラシダは「アンドレは真実を語っている」と言います。ミリーは「ラシダは真実を語っている」と言います。ミリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ヨランダは真実を語ります。ミカエラは「ヨランダは真実を語る」と言います。シマは「ミカエラは真実を語る」と言います。ショーンダは「シマは真実を語る」と言います。オスバルドは「ショーンダは嘘をついている」と言います。オスバルドは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：概念は嘘をつきます。ラシダは「概念は真実を語る」と言います。アレハンドロは「ラシダは真実を語る」と言います。シェリーは「アレハンドロは嘘をついている」と言います。アンバーリーは「シェリーは真実を語る」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレサは真実を語ります。バーネルは「テレサは嘘をついている」と言います。シェリーは「バーネルは真実を語っている」と言います。タミカは「シェリーは嘘をついている」と言います。ミリセントは「タミカは真実を語っている」と言います。ミリセントは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーネルは嘘をつきます。マイケルは「バーネルは嘘をついている」と言います。ダラスは「マイケルは嘘をついている」と言います。シャロンダは「ダラスは真実を語っている」と言います。ジェイミーは「シャロンダは嘘をついている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジムは真実を語ります。ライアンは「ジムは真実を語る」と言います。ミリセントは「ライアンは真実を語る」と言います。オードリーは「ミリセントは真実を語る」と言います。エレオノールは「オードリーは真実を語る」と言います。エレオノールは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：エレノアは嘘をつきます。ダラスは「エレノアは真実を語る」と言います。フレッチャーは「ダラスは嘘をついている」と言います。ジェイミーは「フレッチャーは真実を語る」と言います。デルフィーナは「ジェイミーは嘘をついている」と言います。デルフィーナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アレハンドロは真実を語ります。シェナは「アレハンドロは真実を語る」と言います。クリスティーは「シェナは真実を語る」と言います。シャロンダは「クリスティーは嘘をついている」と言います。ジェリーは「シャロンダは嘘をついている」と言います。ジェリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オスバルドは嘘をつきます。フィービーは「オスバルドは嘘をついている」と言います。カンディは「フィービーは真実を語っている」と言います。クリスティアは「カンディは真実を語っている」と言います。デルバートは「クリスティアは嘘をついている」と言います。デルバートは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：バーニタは嘘をつきます。ジェリーは「バーニタは真実を語る」と言います。デルバートは「ジェリーは嘘をついている」と言います。ジェイミーは「デルバートは真実を語る」と言います。シェナは「ジェイミーは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは真実を語ります。フィービーは「ウィリアムは嘘をついている」と言います。アレハンドロは「フィービーは嘘をついている」と言います。ロリーンは「アレハンドロは真実を語っている」と言います。クリスティーは「ロリーンは真実を語っている」と言います。クリスティーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ミリセントは真実を語ります。バーネルは「ミリセントは嘘をついている」と言います。タミカは「バーネルは真実を語る」と言います。オスバルドは「タミカは真実を語る」と言います。シェナは「オスバルドは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アンバーリーは嘘をつきます。シャロンダは「アンバーリーは真実を語る」と言います。ヘレーヌは「シャロンダは真実を語る」と言います。シーマは「ヘレーヌは真実を語る」と言います。クリスティーは「シーマは真実を語る」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティーは嘘をつきます。ジェイミーは「クリスティーは嘘をついている」と言います。ロリーンは「ジェイミーは真実を語っている」と言います。ベルニータは「ロリーンは真実を語っている」と言います。デルフィーナは「ベルニータは嘘をついている」と言います。デルフィーナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレネは真実を語ります。テレッサは「エレネは真実を語る」と言います。ジェイミーは「テレッサは嘘をついている」と言います。アレクシスは「ジェイミーは嘘をついている」と言います。オスバルドは「アレクシスは真実を語っている」と言います。オスバルドは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ウィリアムは真実を語ります。ミカエラは「ウィリアムは嘘をついている」と言います。コンセプションは「ミカエラは嘘をついている」と言います。インガは「コンセプションは真実を語っている」と言います。サルは「インガは嘘をついている」と言います。サルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ロリーンは嘘をつきます。オスバルドは「ロリーンは嘘をついている」と言います。アレハンドロは「オスバルドは嘘をついている」と言います。グウェンは「アレハンドロは真実を語っている」と言います。ダラスは「グウェンは嘘をついている」と言います。ダラスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：クリスティは真実を語ります。エレノアは「クリスティは嘘をついている」と言います。ジェイミーは「エレノアは真実を語っている」と言います。ジェイミーは「ジェイミーは嘘をついている」と言います。アレクシスは「ジェイミーは真実を語っている」と言います。アレクシスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：メイベルは真実を語ります。オスバルドは「メイベルは嘘をついている」と言います。カンディは「オスバルドは嘘をついている」と言います。ジェリーは「カンディは嘘をついている」と言います。アレハンドロは「ジェリーは嘘をついている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アレハンドロは嘘をつきます。ビナは「アレハンドロは嘘をついている」と言います。バーネルは「ビナは真実を語っている」と言います。フィデルは「バーネルは嘘をついている」と言います。インガは「フィデルは真実を語っている」と言います。インガは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリセントは真実を語ります。ウィリアムは「ミリセントは嘘をついている」と言います。クリスティアは「ウィリアムは嘘をついている」と言います。テレッサは「クリスティアは真実を語っている」と言います。ラシダは「テレッサは真実を語っている」と言います。ラシダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オスバルドは嘘をつきます。グウェンは「オスバルドは嘘をついている」と言います。マイケルは「グウェンは嘘をついている」と言います。エレノアは「マイケルは嘘をついている」と言います。サルは「エレノアは真実を語っている」と言います。サルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カは嘘をつきます。ロリネは「カは真実を語る」と言います。サルは「ロリネは嘘をついている」と言います。アンバーリーは「サルは嘘をついている」と言います。コンセプションは「アンバーリーは嘘をついている」と言います。コンセプションは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェリーは真実を語ります。レイモンドは「ジェリーは真実を語る」と言います。ヨランダは「レイモンドは真実を語る」と言います。エレノアは「ヨランダは真実を語る」と言います。ジェイミーは「エレノアは嘘をついている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレーヌは真実を語ります。レイモンドは「エレーヌは嘘をついている」と言います。アンドレは「レイモンドは真実を語っている」と言います。マイケルは「アンドレは真実を語っている」と言います。アンバーリーは「マイケルは真実を語っている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは真実を語ります。クリスティアは「ウィリアムは真実を語る」と言います。ビナは「クリスティアは嘘をついている」と言います。フィデルは「ビナは嘘をついている」と言います。フレッチャーは「フィデルは嘘をついている」と言います。フレッチャーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ロリーンは真実を語ります。ミカエラは「ロリーンは嘘をついている」と言います。ミリセントは「ミカエラは真実を語っている」と言います。フレッチャーは「ミリセントは真実を語っている」と言います。ショーンダは「フレッチャーは真実を語っている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは嘘をつきます。グウェンは「ジェリーは嘘をついている」と言います。フィデルは「グウェンは嘘をついている」と言います。ミリセントは「フィデルは真実を語っている」と言います。ロリーヌは「ミリセントは真実を語っている」と言います。ロリーヌは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリー・コンスタンティンは嘘をつきます。ジェイミーは「ミリーは真実を語る」と言います。ジェイミーは「ジェイミーは真実を語る」と言います。サルは「ジェイミーは嘘をついている」と言います。クリスティーは「サルは嘘をついている」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シャロンダは嘘をつきます。クリスタは「シャロンダは真実を語る」と言います。ヨランダは「クリスタは真実を語る」と言います。カは「ヨランダは真実を語る」と言います。ミカエラは「カは嘘をついている」と言います。ミカエラは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：メイベルは真実を語ります。アントワンは「メイベルは真実を語る」と言います。オードリーは「アントワンは真実を語る」と言います。ライアンは「オードリーは嘘をついている」と言います。デルフィナは「ライアンは嘘をついている」と言います。デルフィナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーニタは真実を語ります。カは「バーニタは嘘をついている」と言います。ヨランドは「カは嘘をついている」と言います。グウェンは「ヨランドは嘘をついている」と言います。フィデルは「グウェンは嘘をついている」と言います。フィデルは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：オードリーは真実を語ります。ライアンは「オードリーは嘘をついている」と言います。ラシダは「ライアンは嘘をついている」と言います。フレッチャーは「ラシダは真実を語っている」と言います。ショーンダは「フレッチャーは真実を語っている」と言います。ショーンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：デルフィーナは嘘をつきます。テレッサは「デルフィーナは嘘をついている」と言います。アンバーリーは「テレッサは真実を語っている」と言います。ライアンは「アンバーリーは嘘をついている」と言います。ミリーは「ライアンは嘘をついている」と言います。ミリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ウィリアムは真実を語ります。ミカエラは「ウィリアムは真実を語る」と言います。シマは「ミカエラは嘘をついている」と言います。インガは「シマは真実を語っている」と言います。オードリーは「インガは嘘をついている」と言います。オードリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレサは真実を語ります。ロリヌは「テレサは嘘をついている」と言います。アントワンは「ロリヌは真実を語っている」と言います。フィデルは「アントワンは真実を語っている」と言います。フィービーは「フィデルは嘘をついている」と言います。フィービーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：エレノアは真実を語ります。クリスティーナは「エレノアは嘘をついている」と言います。バーネルは「クリスティーナは嘘をついている」と言います。シャロンダは「バーネルは嘘をついている」と言います。テレッサは「シャロンダは嘘をついている」と言います。テレッサは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ヨランダは真実を語ります。グウェンは「ヨランダは真実を語る」と言います。ミカエラは「グウェンは嘘をついている」と言います。ジェイミーは「ミカエラは真実を語る」と言います。アンバーリーは「ジェイミーは嘘をついている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：グウェンは真実を語ります。ミリセントは「グウェンは嘘をついている」と言います。アントワンは「ミリセントは真実を語っている」と言います。テレサは「アントワンは嘘をついている」と言います。シェナは「テレサは嘘をついている」と言います。シェナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレネは真実を語ります。レーダは「エレネは嘘をついている」と言います。アントワンは「レーダは真実を語っている」と言います。アンドレーは「アントワンは嘘をついている」と言います。ショーンダは「アンドレーは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シェリーは真実を語ります。カンディは「シェリーは真実を語る」と言います。コンセプションは「カンディは真実を語る」と言います。マイケルは「コンセプションは真実を語る」と言います。クリスティーは「マイケルは真実を語る」と言います。クリスティーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：デルバートは真実を語ります。グウェンは「デルバートは嘘をついている」と言います。オードリーは「グウェンは嘘をついている」と言います。クリスティーは「オードリーは嘘をついている」と言います。アレクシスは「クリスティーは嘘をついている」と言います。アレクシスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アントワンは真実を語ります。ジェイミーは「アントワンは真実を語る」と言います。メイベルは「ジェイミーは真実を語る」と言います。アレクシスは「メイベルは嘘をついている」と言います。ミリセントは「アレクシスは嘘をついている」と言います。ミリセントは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：デルフィーナは真実を語ります。フィデルは「デルフィーナは真実を語る」と言います。ヘレーヌは「フィデルは嘘をついている」と言います。クリスティアは「ヘレーヌは嘘をついている」と言います。カは「クリスティアは嘘をついている」と言います。カは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは嘘をつきます。ヨランダは「ジムは嘘をついている」と言います。ウィリアムは「ヨランダは真実を語っている」と言います。デルバートは「ウィリアムは嘘をついている」と言います。シャロンダは「デルバートは真実を語っている」と言います。シャロンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレノアは嘘をつきます。ミリセントは「エレノアは真実を語る」と言います。ミリーは「ミリセントは嘘をついている」と言います。ミカエラは「ミリーは真実を語る」と言います。カンディは「ミカエラは嘘をついている」と言います。カンディは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは真実を語ります。ヨランダは「ジェリーは嘘をついている」と言います。タミカは「ヨランダは真実を語る」と言います。アレクシスは「タミカは真実を語る」と言います。ライアンは「アレクシスは真実を語る」と言います。ライアンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シマは真実を語ります。ジェリーは「シマは真実を語る」と言います。サルは「ジェリーは嘘をついている」と言います。インガは「サルは嘘をついている」と言います。ウィリアムは「インガは嘘をついている」と言います。ウィリアムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは真実を語ります。シャロンダは「ウィリアムは真実を語る」と言います。ヘレーヌは「シャロンダは真実を語る」と言います。ミリセントは「ヘレーヌは嘘をついている」と言います。アンドレは「ミリセントは嘘をついている」と言います。アンドレは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ライアンは真実を語ります。アンバーリーは「ライアンは真実を語る」と言います。クリスティアンは「アンバーリーは嘘をついている」と言います。ベルニータは「クリスティアンは嘘をついている」と言います。アレハンドロは「ベルニータは真実を語っている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーネルは真実を語ります。ラシダは「バーネルは嘘をついている」と言います。クリスティーは「ラシダは真実を語っている」と言います。シェリーは「クリスティーは真実を語っている」と言います。ジムは「シェリーは嘘をついている」と言います。ジムは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ショーンダは嘘をつきます。エレノアは「ショーンダは嘘をついている」と言います。フィデルは「エレノアは真実を語っている」と言います。ロリーンは「フィデルは真実を語っている」と言います。レイモンドは「ロリーンは嘘をついている」と言います。レイモンドは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：グウェンは真実を語ります。ロリヌは「グウェンは嘘をついている」と言います。アントワンは「ロリヌは真実を語っている」と言います。エレノアは「アントワンは真実を語っている」と言います。デルフィナは「エレノアは真実を語っている」と言います。デルフィナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シェナは真実を語ります。アントワンは「シェナは嘘をついている」と言います。タミカは「アントワンは嘘をついている」と言います。エレノアは「タミカは嘘をついている」と言います。ラシダは「エレノアは真実を語っている」と言います。ラシダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アンドレは嘘をつきます。ラシダは「アンドレは真実を語る」と言います。アンバーリーは「ラシダは嘘をついている」と言います。タミカは「アンバーリーは嘘をついている」と言います。レーダは「タミカは嘘をついている」と言います。レーダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ライアンは嘘をつきます。ジェイミーは「ライアンは嘘をついている」と言います。マイケルは「ジェイミーは真実を語っている」と言います。カは「マイケルは嘘をついている」と言います。ミリセントは「カは真実を語っている」と言います。ミリセントは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アレハンドロは嘘をつきます。ベルニータは「アレハンドロは嘘をついている」と言います。アンドリーは「ベルニータは真実を語っている」と言います。シーマは「アンドリーは真実を語っている」と言います。インガは「シーマは真実を語っている」と言います。インガは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：シェナは嘘をつきます。クリスタは「シェナは嘘をついている」と言います。アンドレーは「クリスタは真実を語っている」と言います。シェリーは「アンドレーは嘘をついている」と言います。カは「シェリーは嘘をついている」と言います。カは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アントワンは嘘をつきます。ジェリーは「アントワンは真実を語る」と言います。デルフィナは「ジェリーは嘘をついている」と言います。コンセプションは「デルフィナは嘘をついている」と言います。ベルニータは「コンセプションは真実を語っている」と言います。ベルニータは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オードリーは嘘をつきます。ジェリーは「オードリーは真実を語る」と言います。アレハンドロは「ジェリーは嘘をついている」と言います。ジェイミーは「アレハンドロは嘘をついている」と言います。ロリーンは「ジェイミーは真実を語っている」と言います。ロリーンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは嘘をつきます。フィデルは「ウィリアムは真実を語る」と言います。クリスティアは「フィデルは真実を語る」と言います。インガは「クリスティアは真実を語る」と言います。ダラスは「インガは嘘をついている」と言います。ダラスは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：シェリーは嘘をつきます。グウェンは「シェリーは嘘をついている」と言います。シマは「グウェンは嘘をついている」と言います。タミカは「シマは真実を語っている」と言います。ミリセントは「タミカは真実を語っている」と言います。ミリセントは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：バーネルは真実を語ります。フィデルは「バーネルは真実を語る」と言います。アンバーリーは「フィデルは嘘をついている」と言います。ロリーンは「アンバーリーは嘘をついている」と言います。エレオノールは「ロリーンは嘘をついている」と言います。エレオノールは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリセントは嘘をつきます。ロリーンは「ミリセントは嘘をついている」と言います。ラシダは「ロリーンは嘘をついている」と言います。シーマは「ラシダは嘘をついている」と言います。フィービーは「シーマは真実を語っている」と言います。フィービーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ビナは真実を語ります。アレハンドロは「ビナは嘘をついている」と言います。メイベルは「アレハンドロは真実を語っている」と言います。ミリセントは「メイベルは嘘をついている」と言います。イレインは「ミリセントは真実を語っている」と言います。イレインは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ショーンダは真実を語ります。コンセプションは「ショーンダは嘘をついている」と言います。シェナは「コンセプションは嘘をついている」と言います。デルバートは「シェナは嘘をついている」と言います。ジェリーは「デルバートは真実を語っている」と言います。ジェリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは真実を語ります。ジェイミーは「ジェリーは真実を語る」と言います。エレノアは「ジェイミーは真実を語る」と言います。ヘレーヌは「エレノアは真実を語る」と言います。シェリーは「ヘレーヌは真実を語る」と言います。シェリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ミリセントは真実を語ります。カは「ミリセントは真実を語る」と言います。コンセプションは「カは嘘をついている」と言います。サルは「コンセプションは嘘をついている」と言います。タミカは「サルは嘘をついている」と言います。タミカは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ショーンダは嘘をつきます。フレッチャーは「ショーンダは嘘をついている」と言います。ジェイミーは「フレッチャーは嘘をついている」と言います。ミリーは「ジェイミーは嘘をついている」と言います。グウェンは「ミリーは真実を語っている」と言います。グウェンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：クリスティは嘘をつきます。アンバーリーは「クリスティは真実を語る」と言います。ベルニータは「アンバーリーは真実を語る」と言います。クリスティアンは「ベルニータは嘘をついている」と言います。デルフィーナは「クリスティアンは嘘をついている」と言います。デルフィーナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：レーダは嘘をつきます。フィデルは「レーダは嘘をついている」と言います。クリスティアは「フィデルは真実を語っている」と言います。カは「クリスティアは嘘をついている」と言います。ジムは「カは真実を語っている」と言います。ジムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：レダは嘘をつきます。ミリセントは「レダは真実を語る」と言います。ラシダは「ミリセントは嘘をついている」と言います。メイベルは「ラシダは真実を語っている」と言います。ショーンダは「メイベルは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ラシダは嘘をつきます。オスバルドは「ラシダは真実を語る」と言います。シェリーは「オスバルドは真実を語る」と言います。グウェンは「シェリーは真実を語る」と言います。ジェリーは「グウェンは嘘をついている」と言います。ジェリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：バーニタは真実を語ります。オードリーは「バーニタは嘘をついている」と言います。ミリーは「オードリーは真実を語る」と言います。キャンディは「ミリーは嘘をついている」と言います。フレッチャーは「キャンディは真実を語る」と言います。フレッチャーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ラシダは真実を語ります。ジムは「ラシダは嘘をついている」と言います。タミカは「ジムは真実を語る」と言います。ロリネは「タミカは真実を語る」と言います。ビナは「ロリネは真実を語る」と言います。ビナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：デルバートは嘘をつきます。シャロンダは「デルバートは真実を語る」と言います。タミカは「シャロンダは嘘をついている」と言います。サルは「タミカは嘘をついている」と言います。ヘレーヌは「サルは嘘をついている」と言います。ヘレーヌは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィービーは嘘をつきます。ローリンは「フィービーは真実を語る」と言います。ダラスは「ローリンは嘘をついている」と言います。アレクシスは「ダラスは嘘をついている」と言います。ジムは「アレクシスは真実を語っている」と言います。ジムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オードリーは嘘をつきます。ラシダは「オードリーは真実を語る」と言います。メイベルは「ラシダは嘘をついている」と言います。カは「メイベルは嘘をついている」と言います。ショーンダは「カは真実を語っている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：オスバルドは嘘をつきます。フレッチャーは「オスバルドは真実を語る」と言います。マイケルは「フレッチャーは真実を語る」と言います。ダラスは「マイケルは真実を語る」と言います。テレッサは「ダラスは真実を語る」と言います。テレッサは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アレクシスは真実を語ります。レイモンドは「アレクシスは真実を語る」と言います。ミカエラは「レイモンドは真実を語る」と言います。シャロンダは「ミカエラは真実を語る」と言います。アンバーリーは「シャロンダは真実を語る」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：レイモンドは嘘をつきます。フレッチャーは「レイモンドは嘘をついている」と言います。アンバーリーは「フレッチャーは嘘をついている」と言います。シェナは「アンバーリーは真実を語っている」と言います。ダラスは「シェナは真実を語っている」と言います。ダラスは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シャロンダは真実を語ります。サルは「シャロンダは真実を語る」と言います。ヘレーヌは「サルは真実を語る」と言います。カンディは「ヘレーヌは嘘をついている」と言います。ロリネは「カンディは真実を語る」と言います。ロリネは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：サルは真実を語ります。アレハンドロは「サルは真実を語る」と言います。レイモンドは「アレハンドロは嘘をついている」と言います。コンセプションは「レイモンドは嘘をついている」と言います。エレノアは「コンセプションは嘘をついている」と言います。エレノアは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ショーンダは真実を語ります。フィデルは「ショーンダは真実を語る」と言います。デルバートは「フィデルは真実を語る」と言います。バーニタは「デルバートは真実を語る」と言います。ロリーンは「バーニタは嘘をついている」と言います。ロリーンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：フレッチャーは嘘をつきます。ジェリーは「フレッチャーは嘘をついている」と言います。レイモンドは「ジェリーは嘘をついている」と言います。コンセプションは「レイモンドは嘘をついている」と言います。アンバーリーは「コンセプションは真実を語っている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：クリスチャンは嘘をつきます。ミリーは「クリスチャンは嘘をついている」と言います。アンバーリーは「ミリーは嘘をついている」と言います。オスバルドは「アンバーリーは真実を語っている」と言います。キャンディは「オスバルドは真実を語っている」と言います。キャンディは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ウィリアムは嘘をつきます。レイモンドは「ウィリアムは真実を語る」と言います。ラシダは「レイモンドは嘘をついている」と言います。グウェンは「ラシダは嘘をついている」と言います。カは「グウェンは嘘をついている」と言います。カは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ジェイミーは真実を語ります。マイケルは「ジェイミーは嘘をついている」と言います。シェリーは「マイケルは嘘をついている」と言います。バーニタは「シェリーは嘘をついている」と言います。アンバーリーは「バーニタは真実を語っている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ショーンダは真実を語ります。ジムは「ショーンダは嘘をついている」と言います。アレクシスは「ジムは嘘をついている」と言います。フィービーは「アレクシスは真実を語っている」と言います。シェリーは「フィービーは真実を語っている」と言います。シェリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ミリセントは嘘をつきます。カは「ミリセントは嘘をついている」と言います。シマは「カは真実を語っている」と言います。ダラスは「シマは真実を語っている」と言います。ジェイミーは「ダラスは嘘をついている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスティは真実を語ります。フィデルは「クリスティは嘘をついている」と言います。ジェリーは「フィデルは真実を語っている」と言います。メイベルは「ジェリーは嘘をついている」と言います。デルフィーナは「メイベルは真実を語っている」と言います。デルフィーナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：司馬は嘘をつきます。メイベルは「司馬は真実を語る」と言います。オードリーは「メイベルは嘘をついている」と言います。レーダは「オードリーは真実を語る」と言います。ショーンダは「レーダは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：バーネルは嘘をつきます。コンセプションは「バーネルは嘘をついている」と言います。カンディは「コンセプションは嘘をついている」と言います。マイケルは「カンディは真実を語っている」と言います。オスバルドは「マイケルは真実を語っている」と言います。オスバルドは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ショーンダは真実を語ります。デルバートは「ショーンダは真実を語る」と言います。バーニタは「デルバートは嘘をついている」と言います。ヨランダは「バーニタは真実を語る」と言います。クリスティーは「ヨランダは真実を語る」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：インガは真実を語ります。シャロンダは「インガは真実を語る」と言います。フィービーは「シャロンダは真実を語る」と言います。クリスティアは「フィービーは嘘をついている」と言います。アレハンドロは「クリスティアは嘘をついている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フィデルは嘘をつきます。ミリセントは「フィデルは真実を語る」と言います。クリスティアは「ミリセントは嘘をついている」と言います。レーダは「クリスティアは嘘をついている」と言います。タミカは「レーダは真実を語る」と言います。タミカは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アンドレは真実を語ります。クリスティーは「アンドレは真実を語る」と言います。フィデルは「クリスティーは嘘をついている」と言います。アントワンは「フィデルは真実を語る」と言います。アレハンドロは「アントワンは嘘をついている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは真実を語ります。ウィリアムは「フレッチャーは真実を語る」と言います。ジェイミーは「ウィリアムは嘘をついている」と言います。レーダは「ジェイミーは嘘をついている」と言います。ジェイミーは「レーダは真実を語っている」と言います。ジェイミーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：タミカは嘘をつきます。ジェリーは「タミカは真実を語る」と言います。デルバートは「ジェリーは真実を語る」と言います。レーダは「デルバートは真実を語る」と言います。ウィリアムは「レーダは嘘をついている」と言います。ウィリアムは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレッサは嘘をつきます。サルは「テレッサは真実を語る」と言います。デルバートは「サルは真実を語る」と言います。タミカは「デルバートは真実を語る」と言います。グウェンは「タミカは真実を語る」と言います。グウェンは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジムは嘘をつきます。デルフィナは「ジムは真実を語る」と言います。ショーンダは「デルフィナは嘘をついている」と言います。フィデルは「ショーンダは嘘をついている」と言います。サルは「フィデルは真実を語る」と言います。サルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリーは嘘をつきます。マイケルは「ミリーは真実を語る」と言います。ビナは「マイケルは嘘をついている」と言います。コンセプションは「ビナは真実を語る」と言います。司馬鈞は「コンセプションは真実を語っている」と言います。司馬鈞は真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：キャンディは嘘をつきます。ミリーは「キャンディは真実を語る」と言います。ロリーンは「ミリーは真実を語る」と言います。ミカエラは「ロリーンは真実を語る」と言います。アンバーリーは「ミカエラは嘘をついている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：マイケルは嘘をつきます。ジェリーは「マイケルは真実を語る」と言います。デルバートは「ジェリーは真実を語る」と言います。シーマは「デルバートは嘘をついている」と言います。アレクシスは「シーマは嘘をついている」と言います。アレクシスは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：サルは嘘をつきます。クリスティアンは「サルは嘘をついている」と言います。ヘレーヌは「クリスティアンは嘘をついている」と言います。インガは「ヘレーヌは真実を語っている」と言います。マイケルは「インガは真実を語っている」と言います。マイケルは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：メイベルは嘘をつきます。クリスタは「メイベルは真実を語る」と言います。ベルニタは「クリスタは嘘をついている」と言います。カンディは「ベルニタは真実を語る」と言います。デルバートは「カンディは真実を語っている」と言います。デルバートは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カは嘘をつきます。ラシダは「カは真実を語る」と言います。シェリーは「ラシダは真実を語る」と言います。タミカは「シェリーは真実を語る」と言います。エレノアは「タミカは真実を語る」と言います。エレノアは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アントワンは真実を語ります。オードリーは「アントワンは真実を語る」と言います。インガは「オードリーは嘘をついている」と言います。シェナは「インガは真実を語る」と言います。クリスティーは「シェナは嘘をついている」と言います。クリスティーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：テレッサは嘘をつきます。マイケルは「テレッサは真実を語る」と言います。フィデルは「マイケルは真実を語る」と言います。レーダは「フィデルは嘘をついている」と言います。ロリネは「レーダは嘘をついている」と言います。ロリネは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：アントワンは真実を語ります。エレノアは「アントワンは真実を語る」と言います。ベルニータは「エレノアは真実を語る」と言います。オスバルドは「ベルニータは嘘をついている」と言います。クリスティーは「オスバルドは真実を語る」と言います。クリスティーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：インガは真実を語ります。エレノアは「インガは嘘をついている」と言います。ミリセントは「エレノアは真実を語っている」と言います。ウィリアムは「ミリセントは真実を語っている」と言います。アレハンドロは「ウィリアムは真実を語っている」と言います。アレハンドロは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シェリーは嘘をつきます。エレノアは「シェリーは真実を語る」と言います。マイケルは「エレノアは真実を語る」と言います。シーマは「マイケルは真実を語る」と言います。ショーンダは「シーマは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：タミカは嘘をつきます。コンセプションは「タミカは真実を語る」と言います。クリスティアンは「コンセプションは嘘をついている」と言います。アレハンドロは「クリスティアンは真実を語っている」と言います。ショーンダは「アレハンドロは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：エレネは嘘をつきます。デルフィーナは「エレネは嘘をついている」と言います。クリスティーは「デルフィーナは真実を語っている」と言います。ジェリーは「クリスティーは嘘をついている」と言います。タミカは「ジェリーは真実を語っている」と言います。タミカは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：コンセプションは嘘をつきます。シェナは「コンセプションは真実を語る」と言います。メイベルは「シェナは真実を語る」と言います。マイケルは「メイベルは嘘をついている」と言います。アンバーリーは「マイケルは嘘をついている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：クリスチャンは真実を語ります。ジェイミーは「クリスチャンは真実を語る」と言います。ミリセントは「ジェイミーは嘘をついている」と言います。フィデルは「ミリセントは嘘をついている」と言います。タミカは「フィデルは嘘をついている」と言います。タミカは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェイミーは嘘をつきます。サルは「ジェイミーは真実を語る」と言います。テレサは「サルは嘘をついている」と言います。メイベルは「テレサは真実を語る」と言います。カは「メイベルは嘘をついている」と言います。カは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ロリーンは嘘をつきます。アンバーリーは「ロリーンは嘘をついている」と言います。フレッチャーは「アンバーリーは嘘をついている」と言います。ミリーは「フレッチャーは真実を語っている」と言います。アントワンは「ミリーは嘘をついている」と言います。アントワンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アレクシスは真実を語ります。エレノアは「アレクシスは真実を語る」と言います。シェリーは「エレノアは嘘をついている」と言います。オードリーは「シェリーは真実を語る」と言います。インガは「オードリーは真実を語っている」と言います。インガは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：フィデルは真実を語ります。テレサは「フィデルは真実を語る」と言います。ウィリアムは「テレサは真実を語る」と言います。コンセプションは「ウィリアムは真実を語る」と言います。ベルニタは「コンセプションは嘘をついている」と言います。ベルニタは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは真実を語ります。ロリネは「ジェリーは嘘をついている」と言います。シェナは「ロリネは嘘をついている」と言います。グウェンは「シェナは嘘をついている」と言います。ショーンダは「グウェンは嘘をついている」と言います。ショーンダは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：インガは嘘をつきます。オードリーは「インガは嘘をついている」と言います。ラシダは「オードリーは嘘をついている」と言います。ウィリアムは「ラシダは真実を語っている」と言います。アンバーリーは「ウィリアムは嘘をついている」と言います。アンバーリーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カは真実を語ります。インガは「カは嘘をついている」と言います。ベルニータは「インガは嘘をついている」と言います。オスバルドは「ベルニータは真実を語っている」と言います。ミカエラは「オスバルドは嘘をついている」と言います。ミカエラは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェイミーは嘘をつきます。ジェイミーは「ジェイミーは真実を語る」と言います。サルは「ジェイミーは嘘をついている」と言います。アンバーリーは「サルは嘘をついている」と言います。ジェリーは「アンバーリーは真実を語る」と言います。ジェリーは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ミリーは嘘をつきます。アンドレは「ミリーは嘘をついている」と言います。ミカエラは「アンドレは嘘をついている」と言います。レーダは「ミカエラは真実を語っている」と言います。シェンナは「レーダは嘘をついている」と言います。シェンナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ショーンダは真実を語ります。メイベルは「ショーンダは真実を語る」と言います。ロリーンは「メイベルは嘘をついている」と言います。ミリーは「ロリーンは真実を語る」と言います。ビナは「ミリーは真実を語る」と言います。ビナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：フレッチャーは嘘をつきます。タミカは「フレッチャーは真実を語る」と言います。カは「タミカは嘘をついている」と言います。シマは「カは真実を語る」と言います。ライアンは「シマは真実を語る」と言います。ライアンは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：ショーンダは嘘をつきます。アンドレは「ショーンダは真実を語る」と言います。ジェイミーは「アンドレは嘘をついている」と言います。インガは「ジェイミーは嘘をついている」と言います。ミリセントは「インガは真実を語る」と言います。ミリセントは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ラシダは嘘をつきます。フレッチャーは「ラシダは嘘をついている」と言います。アントワンは「フレッチャーは嘘をついている」と言います。ウィリアムは「アントワンは真実を語っている」と言います。ビナは「ウィリアムは真実を語っている」と言います。ビナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ジェリーは嘘をつきます。カンディは「ジェリーは嘘をついている」と言います。フレッチャーは「カンディは嘘をついている」と言います。ライアンは「フレッチャーは嘘をついている」と言います。デルフィナは「ライアンは嘘をついている」と言います。デルフィナは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：ショーンダは真実を語ります。フィービーは「ショーンダは真実を語る」と言います。ライアンは「フィービーは真実を語る」と言います。クリスティーは「ライアンは真実を語る」と言います。ビナは「クリスティーは真実を語る」と言います。ビナは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：アレクシスは真実を語ります。アンバーリーは「アレクシスは真実を語る」と言います。アンドレーは「アンバーリーは真実を語る」と言います。ビナは「アンドレーは真実を語る」と言います。エレーヌは「ビナは真実を語る」と言います。エレーヌは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：グウェンは嘘をつきます。メイベルは「グウェンは真実を語る」と言います。レイモンドは「メイベルは真実を語る」と言います。ジェイミーは「レイモンドは真実を語る」と言います。アンドレは「ジェイミーは嘘をついている」と言います。アンドレは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：カンディは真実を語ります。ライアンは「カンディは嘘をついている」と言います。ミカエラは「ライアンは真実を語っている」と言います。シマは「ミカエラは嘘をついている」と言います。アンドレーは「シマは真実を語っている」と言います。アンドレーは真実を語っているでしょうか？", "target": "Yes"}
{"input": "問題：フレッチャーは真実を語ります。アレクシスは「フレッチャーは嘘をついている」と言います。ジェリーは「アレクシスは嘘をついている」と言います。エレノアは「ジェリーは真実を語っている」と言います。ジムは「エレノアは嘘をついている」と言います。ジムは真実を語っているでしょうか？", "target": "No"}
{"input": "問題：シェリーは真実を語ります。ライアンは「シェリーは嘘をついている」と言います。ベルニタは「ライアンは真実を語っている」と言います。タミカは「ベルニタは嘘をついている」と言います。ジェリーは「タミカは嘘をついている」と言います。ジェリーは真実を語っているでしょうか？", "target": "No"}
